PRU Assembler Unix v2.1.4 Sat Apr 14 23:41:47 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
beacon.asm                                                           PAGE    1

       1;******************************************************************************
       2;* PRU C/C++ Codegen                                              Unix v2.1.4 *
       3;* Date/Time created: Sat Apr 14 23:41:46 2018                                *
       4;******************************************************************************
       5        .compiler_opts --abi=eabi --endian=little --hll_source=on --object_format=elf --silicon_versio
       6
       7$C$DW$CU        .dwtag  DW_TAG_compile_unit
       8        .dwattr $C$DW$CU, DW_AT_name("beacon.c")
       9        .dwattr $C$DW$CU, DW_AT_producer("TI PRU C/C++ Codegen Unix v2.1.4 Copyright (c) 2012-2015 Tex
      10        .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      11        .dwattr $C$DW$CU, DW_AT_comp_dir("/var/lib/cloud9/pru_beacon")
      12        .global __PRU_CREG_PRU_CFG
      13        .global __PRU_CREG_PRU_INTC
      14
      15$C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("__halt")
      16        .dwattr $C$DW$1, DW_AT_TI_symbol_name("__halt")
      17        .dwattr $C$DW$1, DW_AT_declaration
      18        .dwattr $C$DW$1, DW_AT_external
      19
      20$C$DW$2 .dwtag  DW_TAG_subprogram, DW_AT_name("__delay_cycles")
      21        .dwattr $C$DW$2, DW_AT_TI_symbol_name("__delay_cycles")

     436;*                                                             *
     437;* FUNCTION PROPERTIES                                         *
     438;*                            0 Auto,  0 SOE     *
     439;***************************************************************
     440
PRU Assembler Unix v2.1.4 Sat Apr 14 23:41:47 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
beacon.asm                                                           PAGE    9

     441 00000000                 ||main||:
     442;* --------------------------------------------------------------------------*
     443        .dwcfi  cfa_offset, 0
     444        .dwpsn  file "beacon.c",line 101,column 5,is_stmt,isa 0
     445;----------------------------------------------------------------------
     446; 101 | __R30 &= ~PRU0_GPIO;                                                   
     447; 103 | while(1){                                                              
     448;----------------------------------------------------------------------
     449 00000000 0000001D02FEFE          CLR       r30, r30, 0x00000002  ; [ALU_PRU] |101| 
     450;* --------------------------------------------------------------------------*
     451;*   BEGIN LOOP ||$C$L9||
     452;*
     453;*   Loop source line                : 103
     454;*   Loop closing brace source line  : 108
     455;*   Known Minimum Trip Count        : 1
     456;*   Known Maximum Trip Count        : 4294967295
     457;*   Known Max Trip Count Factor     : 1
     458;* --------------------------------------------------------------------------*
     459 00000004                 ||$C$L9||:    
     460        .dwpsn  file "beacon.c",line 104,column 6,is_stmt,isa 0
     461;----------------------------------------------------------------------
     462; 104 | mark(171);                                                             
     463;----------------------------------------------------------------------
     464 00000004 0000002400ABEE          LDI       r14, 0x00ab           ; [ALU_PRU] |104| 
     465$C$DW$25        .dwtag  DW_TAG_TI_branch
     466        .dwattr $C$DW$25, DW_AT_low_pc(0x00)
     467        .dwattr $C$DW$25, DW_AT_name("mark")
     468        .dwattr $C$DW$25, DW_AT_TI_call
     469 00000008 000000230000C3!         JAL       r3.w2, ||mark||       ; [ALU_PRU] |104| mark
     470        .dwpsn  file "beacon.c",line 105,column 6,is_stmt,isa 0
     471;----------------------------------------------------------------------
     472; 105 | space(171);                                                            
     473;----------------------------------------------------------------------
     474 0000000c 0000002400ABEE          LDI       r14, 0x00ab           ; [ALU_PRU] |105| 
     475$C$DW$26        .dwtag  DW_TAG_TI_branch
     476        .dwattr $C$DW$26, DW_AT_low_pc(0x00)
     477        .dwattr $C$DW$26, DW_AT_name("space")
     478        .dwattr $C$DW$26, DW_AT_TI_call
     479 00000010 000000230000C3!         JAL       r3.w2, ||space||      ; [ALU_PRU] |105| space
     480        .dwpsn  file "beacon.c",line 106,column 6,is_stmt,isa 0
     481;----------------------------------------------------------------------
     482; 106 | putBits(0x00006b96, 16);                                               
     483;----------------------------------------------------------------------
     484 00000014 0000002400100F          LDI       r15.b0, 0x10          ; [ALU_PRU] |106| 
     485 00000018 000000246B96EE          LDI       r14, 0x6b96           ; [ALU_PRU] |106| 
     486$C$DW$27        .dwtag  DW_TAG_TI_branch
     487        .dwattr $C$DW$27, DW_AT_low_pc(0x00)
     488        .dwattr $C$DW$27, DW_AT_name("putBits")
     489        .dwattr $C$DW$27, DW_AT_TI_call
     490 0000001c 000000230000C3!         JAL       r3.w2, ||putBits||    ; [ALU_PRU] |106| putBits
     491        .dwpsn  file "beacon.c",line 107,column 6,is_stmt,isa 0
     492;----------------------------------------------------------------------
     493; 107 | __delay_cycles(200000000);                                             
     494; 110 | __halt();                                                              
     495;----------------------------------------------------------------------
PRU Assembler Unix v2.1.4 Sat Apr 14 23:41:47 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
beacon.asm                                                           PAGE   10

     496        .newblock
     497 00000020 E0FF912405F5D1          LDI32    r17, 99999999
     498 00000028 0000000501F1F1  $1:     SUB      r17, r17, 1
     499 0000002c 0000006F00F1FF          QBNE     $1, r17, 0            ; [ALU_PRU] |107| 
     500        .dwpsn  file "beacon.c",line 103,column 11,is_stmt,isa 0
     501 00000030 00000021000000!         JMP       ||$C$L9||             ; [ALU_PRU] |103| 
     502;* --------------------------------------------------------------------------*
     503        .dwattr $C$DW$24, DW_AT_TI_end_file("beacon.c")
     504        .dwattr $C$DW$24, DW_AT_TI_end_line(0x6f)
     505        .dwattr $C$DW$24, DW_AT_TI_end_column(0x01)
     506        .dwendentry
     507        .dwendtag $C$DW$24
     508
     509
     510;******************************************************************************
     511;* TYPE INFORMATION                                                           *
     512;******************************************************************************
     513
     514$C$DW$T$19      .dwtag  DW_TAG_structure_type
     515        .dwattr $C$DW$T$19, DW_AT_byte_size(0x04)
     516$C$DW$28        .dwtag  DW_TAG_member
     517        .dwattr $C$DW$28, DW_AT_type(*$C$DW$T$11)
     518        .dwattr $C$DW$28, DW_AT_name("REVID")
     519        .dwattr $C$DW$28, DW_AT_TI_symbol_name("REVID")
     520        .dwattr $C$DW$28, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x20)
     521        .dwattr $C$DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     522        .dwattr $C$DW$28, DW_AT_accessibility(DW_ACCESS_public)
     523        .dwattr $C$DW$28, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     524        .dwattr $C$DW$28, DW_AT_decl_line(0x2d)
     525        .dwattr $C$DW$28, DW_AT_decl_column(0x0d)
     526        .dwendtag $C$DW$T$19
     527
     528        .dwattr $C$DW$T$19, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
     529        .dwattr $C$DW$T$19, DW_AT_decl_line(0x2c)
     530        .dwattr $C$DW$T$19, DW_AT_decl_column(0x13)
     531$C$DW$T$108     .dwtag  DW_TAG_volatile_type
     532        .dwattr $C$DW$T$108, DW_AT_type(*$C$DW$T$19)
     533
     534$C$DW$T$20      .dwtag  DW_TAG_structure_type
     535        .dwattr $C$DW$T$20, DW_AT_byte_size(0x04)
     536$C$DW$29        .dwtag  DW_TAG_member
     537        .dwattr $C$DW$29, DW_AT_type(*$C$DW$T$11)
     538        .dwattr $C$DW$29, DW_AT_name("IDLE_MODE")
     539        .dwattr $C$DW$29, DW_AT_TI_symbol_name("IDLE_MODE")
     540        .dwattr $C$DW$29, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x02)
     541        .dwattr $C$DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     542        .dwattr $C$DW$29, DW_AT_accessibility(DW_ACCESS_public)
     543        .dwattr $C$DW$29, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     544        .dwattr $C$DW$29, DW_AT_decl_line(0x37)
     545        .dwattr $C$DW$29, DW_AT_decl_column(0x0d)
     546$C$DW$30        .dwtag  DW_TAG_member
     547        .dwattr $C$DW$30, DW_AT_type(*$C$DW$T$11)
     548        .dwattr $C$DW$30, DW_AT_name("STANDBY_MODE")
     549        .dwattr $C$DW$30, DW_AT_TI_symbol_name("STANDBY_MODE")
     550        .dwattr $C$DW$30, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x02)
PRU Assembler Unix v2.1.4 Sat Apr 14 23:41:47 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
beacon.asm                                                           PAGE   11

     551        .dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     552        .dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
     553        .dwattr $C$DW$30, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     554        .dwattr $C$DW$30, DW_AT_decl_line(0x38)
     555        .dwattr $C$DW$30, DW_AT_decl_column(0x0d)
     556$C$DW$31        .dwtag  DW_TAG_member
     557        .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$11)
     558        .dwattr $C$DW$31, DW_AT_name("STANDBY_INIT")
     559        .dwattr $C$DW$31, DW_AT_TI_symbol_name("STANDBY_INIT")
     560        .dwattr $C$DW$31, DW_AT_bit_offset(0x1b), DW_AT_bit_size(0x01)
     561        .dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     562        .dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
     563        .dwattr $C$DW$31, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     564        .dwattr $C$DW$31, DW_AT_decl_line(0x39)
     565        .dwattr $C$DW$31, DW_AT_decl_column(0x0d)
     566$C$DW$32        .dwtag  DW_TAG_member
     567        .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$11)
     568        .dwattr $C$DW$32, DW_AT_name("SUB_MWAIT")
     569        .dwattr $C$DW$32, DW_AT_TI_symbol_name("SUB_MWAIT")
     570        .dwattr $C$DW$32, DW_AT_bit_offset(0x1a), DW_AT_bit_size(0x01)
     571        .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     572        .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
     573        .dwattr $C$DW$32, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     574        .dwattr $C$DW$32, DW_AT_decl_line(0x3a)
     575        .dwattr $C$DW$32, DW_AT_decl_column(0x0d)
     576$C$DW$33        .dwtag  DW_TAG_member
     577        .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$11)
     578        .dwattr $C$DW$33, DW_AT_name("rsvd6")
     579        .dwattr $C$DW$33, DW_AT_TI_symbol_name("rsvd6")
     580        .dwattr $C$DW$33, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1a)
     581        .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     582        .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
     583        .dwattr $C$DW$33, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     584        .dwattr $C$DW$33, DW_AT_decl_line(0x3b)
     585        .dwattr $C$DW$33, DW_AT_decl_column(0x0d)
     586        .dwendtag $C$DW$T$20
     587
     588        .dwattr $C$DW$T$20, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
     589        .dwattr $C$DW$T$20, DW_AT_decl_line(0x36)
     590        .dwattr $C$DW$T$20, DW_AT_decl_column(0x13)
     591$C$DW$T$110     .dwtag  DW_TAG_volatile_type
     592        .dwattr $C$DW$T$110, DW_AT_type(*$C$DW$T$20)
     593
     594$C$DW$T$21      .dwtag  DW_TAG_structure_type
     595        .dwattr $C$DW$T$21, DW_AT_byte_size(0x04)
     596$C$DW$34        .dwtag  DW_TAG_member
     597        .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$11)
     598        .dwattr $C$DW$34, DW_AT_name("PRU0_GPI_MODE")
     599        .dwattr $C$DW$34, DW_AT_TI_symbol_name("PRU0_GPI_MODE")
     600        .dwattr $C$DW$34, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x02)
     601        .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     602        .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
     603        .dwattr $C$DW$34, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     604        .dwattr $C$DW$34, DW_AT_decl_line(0x45)
     605        .dwattr $C$DW$34, DW_AT_decl_column(0x0d)
PRU Assembler Unix v2.1.4 Sat Apr 14 23:41:47 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
beacon.asm                                                           PAGE   12

     606$C$DW$35        .dwtag  DW_TAG_member
     607        .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$11)
     608        .dwattr $C$DW$35, DW_AT_name("PRU0_GPI_CLK_MODE")
     609        .dwattr $C$DW$35, DW_AT_TI_symbol_name("PRU0_GPI_CLK_MODE")
     610        .dwattr $C$DW$35, DW_AT_bit_offset(0x1d), DW_AT_bit_size(0x01)
     611        .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     612        .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
     613        .dwattr $C$DW$35, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     614        .dwattr $C$DW$35, DW_AT_decl_line(0x46)
     615        .dwattr $C$DW$35, DW_AT_decl_column(0x0d)
     616$C$DW$36        .dwtag  DW_TAG_member
     617        .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$11)
     618        .dwattr $C$DW$36, DW_AT_name("PRU0_GPI_DIV0")
     619        .dwattr $C$DW$36, DW_AT_TI_symbol_name("PRU0_GPI_DIV0")
     620        .dwattr $C$DW$36, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x05)
     621        .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     622        .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
     623        .dwattr $C$DW$36, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     624        .dwattr $C$DW$36, DW_AT_decl_line(0x47)
     625        .dwattr $C$DW$36, DW_AT_decl_column(0x0d)
     626$C$DW$37        .dwtag  DW_TAG_member
     627        .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$11)
     628        .dwattr $C$DW$37, DW_AT_name("PRU0_GPI_DIV1")
     629        .dwattr $C$DW$37, DW_AT_TI_symbol_name("PRU0_GPI_DIV1")
     630        .dwattr $C$DW$37, DW_AT_bit_offset(0x13), DW_AT_bit_size(0x05)
     631        .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     632        .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
     633        .dwattr $C$DW$37, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     634        .dwattr $C$DW$37, DW_AT_decl_line(0x48)
     635        .dwattr $C$DW$37, DW_AT_decl_column(0x0d)
     636$C$DW$38        .dwtag  DW_TAG_member
     637        .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$11)
     638        .dwattr $C$DW$38, DW_AT_name("PRU0_GPI_SB")
     639        .dwattr $C$DW$38, DW_AT_TI_symbol_name("PRU0_GPI_SB")
     640        .dwattr $C$DW$38, DW_AT_bit_offset(0x12), DW_AT_bit_size(0x01)
     641        .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     642        .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
     643        .dwattr $C$DW$38, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     644        .dwattr $C$DW$38, DW_AT_decl_line(0x49)
     645        .dwattr $C$DW$38, DW_AT_decl_column(0x0d)
     646$C$DW$39        .dwtag  DW_TAG_member
     647        .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$11)
     648        .dwattr $C$DW$39, DW_AT_name("PRU0_GPO_MODE")
     649        .dwattr $C$DW$39, DW_AT_TI_symbol_name("PRU0_GPO_MODE")
     650        .dwattr $C$DW$39, DW_AT_bit_offset(0x11), DW_AT_bit_size(0x01)
     651        .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     652        .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
     653        .dwattr $C$DW$39, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     654        .dwattr $C$DW$39, DW_AT_decl_line(0x4a)
     655        .dwattr $C$DW$39, DW_AT_decl_column(0x0d)
     656$C$DW$40        .dwtag  DW_TAG_member
     657        .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$11)
     658        .dwattr $C$DW$40, DW_AT_name("PRU0_GPO_DIV0")
     659        .dwattr $C$DW$40, DW_AT_TI_symbol_name("PRU0_GPO_DIV0")
     660        .dwattr $C$DW$40, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x05)
PRU Assembler Unix v2.1.4 Sat Apr 14 23:41:47 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
beacon.asm                                                           PAGE   13

     661        .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     662        .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     663        .dwattr $C$DW$40, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     664        .dwattr $C$DW$40, DW_AT_decl_line(0x4b)
     665        .dwattr $C$DW$40, DW_AT_decl_column(0x0d)
     666$C$DW$41        .dwtag  DW_TAG_member
     667        .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$11)
     668        .dwattr $C$DW$41, DW_AT_name("PRU0_GPO_DIV1")
     669        .dwattr $C$DW$41, DW_AT_TI_symbol_name("PRU0_GPO_DIV1")
     670        .dwattr $C$DW$41, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x05)
     671        .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     672        .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
     673        .dwattr $C$DW$41, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     674        .dwattr $C$DW$41, DW_AT_decl_line(0x4c)
     675        .dwattr $C$DW$41, DW_AT_decl_column(0x0d)
     676$C$DW$42        .dwtag  DW_TAG_member
     677        .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$11)
     678        .dwattr $C$DW$42, DW_AT_name("PRU0_GPO_SH_SEL")
     679        .dwattr $C$DW$42, DW_AT_TI_symbol_name("PRU0_GPO_SH_SEL")
     680        .dwattr $C$DW$42, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
     681        .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     682        .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     683        .dwattr $C$DW$42, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     684        .dwattr $C$DW$42, DW_AT_decl_line(0x4d)
     685        .dwattr $C$DW$42, DW_AT_decl_column(0x0d)
     686$C$DW$43        .dwtag  DW_TAG_member
     687        .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$11)
     688        .dwattr $C$DW$43, DW_AT_name("rsvd26")
     689        .dwattr $C$DW$43, DW_AT_TI_symbol_name("rsvd26")
     690        .dwattr $C$DW$43, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x06)
     691        .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     692        .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     693        .dwattr $C$DW$43, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     694        .dwattr $C$DW$43, DW_AT_decl_line(0x4e)
     695        .dwattr $C$DW$43, DW_AT_decl_column(0x0d)
     696        .dwendtag $C$DW$T$21
     697
     698        .dwattr $C$DW$T$21, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
     699        .dwattr $C$DW$T$21, DW_AT_decl_line(0x44)
     700        .dwattr $C$DW$T$21, DW_AT_decl_column(0x13)
     701$C$DW$T$112     .dwtag  DW_TAG_volatile_type
     702        .dwattr $C$DW$T$112, DW_AT_type(*$C$DW$T$21)
     703
     704$C$DW$T$22      .dwtag  DW_TAG_structure_type
     705        .dwattr $C$DW$T$22, DW_AT_byte_size(0x04)
     706$C$DW$44        .dwtag  DW_TAG_member
     707        .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$11)
     708        .dwattr $C$DW$44, DW_AT_name("PRU1_GPI_MODE")
     709        .dwattr $C$DW$44, DW_AT_TI_symbol_name("PRU1_GPI_MODE")
     710        .dwattr $C$DW$44, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x02)
     711        .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     712        .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     713        .dwattr $C$DW$44, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     714        .dwattr $C$DW$44, DW_AT_decl_line(0x58)
     715        .dwattr $C$DW$44, DW_AT_decl_column(0x0d)
PRU Assembler Unix v2.1.4 Sat Apr 14 23:41:47 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
beacon.asm                                                           PAGE   14

     716$C$DW$45        .dwtag  DW_TAG_member
     717        .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$11)
     718        .dwattr $C$DW$45, DW_AT_name("PRU1_GPI_CLK_MODE")
     719        .dwattr $C$DW$45, DW_AT_TI_symbol_name("PRU1_GPI_CLK_MODE")
     720        .dwattr $C$DW$45, DW_AT_bit_offset(0x1d), DW_AT_bit_size(0x01)
     721        .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     722        .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     723        .dwattr $C$DW$45, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     724        .dwattr $C$DW$45, DW_AT_decl_line(0x59)
     725        .dwattr $C$DW$45, DW_AT_decl_column(0x0d)
     726$C$DW$46        .dwtag  DW_TAG_member
     727        .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$11)
     728        .dwattr $C$DW$46, DW_AT_name("PRU1_GPI_DIV0")
     729        .dwattr $C$DW$46, DW_AT_TI_symbol_name("PRU1_GPI_DIV0")
     730        .dwattr $C$DW$46, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x05)
     731        .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     732        .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     733        .dwattr $C$DW$46, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     734        .dwattr $C$DW$46, DW_AT_decl_line(0x5a)
     735        .dwattr $C$DW$46, DW_AT_decl_column(0x0d)
     736$C$DW$47        .dwtag  DW_TAG_member
     737        .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$11)
     738        .dwattr $C$DW$47, DW_AT_name("PRU1_GPI_DIV1")
     739        .dwattr $C$DW$47, DW_AT_TI_symbol_name("PRU1_GPI_DIV1")
     740        .dwattr $C$DW$47, DW_AT_bit_offset(0x13), DW_AT_bit_size(0x05)
     741        .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     742        .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     743        .dwattr $C$DW$47, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     744        .dwattr $C$DW$47, DW_AT_decl_line(0x5b)
     745        .dwattr $C$DW$47, DW_AT_decl_column(0x0d)
     746$C$DW$48        .dwtag  DW_TAG_member
     747        .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$11)
     748        .dwattr $C$DW$48, DW_AT_name("PRU1_GPI_SB")
     749        .dwattr $C$DW$48, DW_AT_TI_symbol_name("PRU1_GPI_SB")
     750        .dwattr $C$DW$48, DW_AT_bit_offset(0x12), DW_AT_bit_size(0x01)
     751        .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     752        .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     753        .dwattr $C$DW$48, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     754        .dwattr $C$DW$48, DW_AT_decl_line(0x5c)
     755        .dwattr $C$DW$48, DW_AT_decl_column(0x0d)
     756$C$DW$49        .dwtag  DW_TAG_member
     757        .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$11)
     758        .dwattr $C$DW$49, DW_AT_name("PRU1_GPO_MODE")
     759        .dwattr $C$DW$49, DW_AT_TI_symbol_name("PRU1_GPO_MODE")
     760        .dwattr $C$DW$49, DW_AT_bit_offset(0x11), DW_AT_bit_size(0x01)
     761        .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     762        .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     763        .dwattr $C$DW$49, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     764        .dwattr $C$DW$49, DW_AT_decl_line(0x5d)
     765        .dwattr $C$DW$49, DW_AT_decl_column(0x0d)
     766$C$DW$50        .dwtag  DW_TAG_member
     767        .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$11)
     768        .dwattr $C$DW$50, DW_AT_name("PRU1_GPO_DIV0")
     769        .dwattr $C$DW$50, DW_AT_TI_symbol_name("PRU1_GPO_DIV0")
     770        .dwattr $C$DW$50, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x05)
PRU Assembler Unix v2.1.4 Sat Apr 14 23:41:47 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
beacon.asm                                                           PAGE   15

     771        .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     772        .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     773        .dwattr $C$DW$50, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     774        .dwattr $C$DW$50, DW_AT_decl_line(0x5e)
     775        .dwattr $C$DW$50, DW_AT_decl_column(0x0d)
     776$C$DW$51        .dwtag  DW_TAG_member
     777        .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$11)
     778        .dwattr $C$DW$51, DW_AT_name("PRU1_GPO_DIV1")
     779        .dwattr $C$DW$51, DW_AT_TI_symbol_name("PRU1_GPO_DIV1")
     780        .dwattr $C$DW$51, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x05)
     781        .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     782        .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     783        .dwattr $C$DW$51, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     784        .dwattr $C$DW$51, DW_AT_decl_line(0x5f)
     785        .dwattr $C$DW$51, DW_AT_decl_column(0x0d)
     786$C$DW$52        .dwtag  DW_TAG_member
     787        .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$11)
     788        .dwattr $C$DW$52, DW_AT_name("PRU1_GPO_SH_SEL")
     789        .dwattr $C$DW$52, DW_AT_TI_symbol_name("PRU1_GPO_SH_SEL")
     790        .dwattr $C$DW$52, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
     791        .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     792        .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     793        .dwattr $C$DW$52, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     794        .dwattr $C$DW$52, DW_AT_decl_line(0x60)
     795        .dwattr $C$DW$52, DW_AT_decl_column(0x0d)
     796$C$DW$53        .dwtag  DW_TAG_member
     797        .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$11)
     798        .dwattr $C$DW$53, DW_AT_name("rsvd26")
     799        .dwattr $C$DW$53, DW_AT_TI_symbol_name("rsvd26")
     800        .dwattr $C$DW$53, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x06)
     801        .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     802        .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     803        .dwattr $C$DW$53, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     804        .dwattr $C$DW$53, DW_AT_decl_line(0x61)
     805        .dwattr $C$DW$53, DW_AT_decl_column(0x0d)
     806        .dwendtag $C$DW$T$22
     807
     808        .dwattr $C$DW$T$22, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
     809        .dwattr $C$DW$T$22, DW_AT_decl_line(0x57)
     810        .dwattr $C$DW$T$22, DW_AT_decl_column(0x13)
     811$C$DW$T$114     .dwtag  DW_TAG_volatile_type
     812        .dwattr $C$DW$T$114, DW_AT_type(*$C$DW$T$22)
     813
     814$C$DW$T$23      .dwtag  DW_TAG_structure_type
     815        .dwattr $C$DW$T$23, DW_AT_byte_size(0x04)
     816$C$DW$54        .dwtag  DW_TAG_member
     817        .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$11)
     818        .dwattr $C$DW$54, DW_AT_name("PRU0_CLK_STOP_REQ")
     819        .dwattr $C$DW$54, DW_AT_TI_symbol_name("PRU0_CLK_STOP_REQ")
     820        .dwattr $C$DW$54, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
     821        .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     822        .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     823        .dwattr $C$DW$54, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     824        .dwattr $C$DW$54, DW_AT_decl_line(0x6b)
     825        .dwattr $C$DW$54, DW_AT_decl_column(0x0d)
PRU Assembler Unix v2.1.4 Sat Apr 14 23:41:47 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
beacon.asm                                                           PAGE   16

     826$C$DW$55        .dwtag  DW_TAG_member
     827        .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$11)
     828        .dwattr $C$DW$55, DW_AT_name("PRU0_CLK_STOP_ACK")
     829        .dwattr $C$DW$55, DW_AT_TI_symbol_name("PRU0_CLK_STOP_ACK")
     830        .dwattr $C$DW$55, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x01)
     831        .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     832        .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     833        .dwattr $C$DW$55, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     834        .dwattr $C$DW$55, DW_AT_decl_line(0x6c)
     835        .dwattr $C$DW$55, DW_AT_decl_column(0x0d)
     836$C$DW$56        .dwtag  DW_TAG_member
     837        .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$11)
     838        .dwattr $C$DW$56, DW_AT_name("PRU0_CLK_EN")
     839        .dwattr $C$DW$56, DW_AT_TI_symbol_name("PRU0_CLK_EN")
     840        .dwattr $C$DW$56, DW_AT_bit_offset(0x1d), DW_AT_bit_size(0x01)
     841        .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     842        .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     843        .dwattr $C$DW$56, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     844        .dwattr $C$DW$56, DW_AT_decl_line(0x6d)
     845        .dwattr $C$DW$56, DW_AT_decl_column(0x0d)
     846$C$DW$57        .dwtag  DW_TAG_member
     847        .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$11)
     848        .dwattr $C$DW$57, DW_AT_name("PRU1_CLK_STOP_REQ")
     849        .dwattr $C$DW$57, DW_AT_TI_symbol_name("PRU1_CLK_STOP_REQ")
     850        .dwattr $C$DW$57, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x01)
     851        .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     852        .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     853        .dwattr $C$DW$57, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     854        .dwattr $C$DW$57, DW_AT_decl_line(0x6e)
     855        .dwattr $C$DW$57, DW_AT_decl_column(0x0d)
     856$C$DW$58        .dwtag  DW_TAG_member
     857        .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$11)
     858        .dwattr $C$DW$58, DW_AT_name("PRU1_CLK_STOP_ACK")
     859        .dwattr $C$DW$58, DW_AT_TI_symbol_name("PRU1_CLK_STOP_ACK")
     860        .dwattr $C$DW$58, DW_AT_bit_offset(0x1b), DW_AT_bit_size(0x01)
     861        .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     862        .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     863        .dwattr $C$DW$58, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     864        .dwattr $C$DW$58, DW_AT_decl_line(0x6f)
     865        .dwattr $C$DW$58, DW_AT_decl_column(0x0d)
     866$C$DW$59        .dwtag  DW_TAG_member
     867        .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$11)
     868        .dwattr $C$DW$59, DW_AT_name("PRU1_CLK_EN")
     869        .dwattr $C$DW$59, DW_AT_TI_symbol_name("PRU1_CLK_EN")
     870        .dwattr $C$DW$59, DW_AT_bit_offset(0x1a), DW_AT_bit_size(0x01)
     871        .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     872        .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     873        .dwattr $C$DW$59, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     874        .dwattr $C$DW$59, DW_AT_decl_line(0x70)
     875        .dwattr $C$DW$59, DW_AT_decl_column(0x0d)
     876$C$DW$60        .dwtag  DW_TAG_member
     877        .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$11)
     878        .dwattr $C$DW$60, DW_AT_name("INTC_CLK_STOP_REQ")
     879        .dwattr $C$DW$60, DW_AT_TI_symbol_name("INTC_CLK_STOP_REQ")
     880        .dwattr $C$DW$60, DW_AT_bit_offset(0x19), DW_AT_bit_size(0x01)
PRU Assembler Unix v2.1.4 Sat Apr 14 23:41:47 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
beacon.asm                                                           PAGE   17

     881        .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     882        .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     883        .dwattr $C$DW$60, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     884        .dwattr $C$DW$60, DW_AT_decl_line(0x71)
     885        .dwattr $C$DW$60, DW_AT_decl_column(0x0d)
     886$C$DW$61        .dwtag  DW_TAG_member
     887        .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$11)
     888        .dwattr $C$DW$61, DW_AT_name("INTC_CLK_STOP_ACK")
     889        .dwattr $C$DW$61, DW_AT_TI_symbol_name("INTC_CLK_STOP_ACK")
     890        .dwattr $C$DW$61, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x01)
     891        .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     892        .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     893        .dwattr $C$DW$61, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     894        .dwattr $C$DW$61, DW_AT_decl_line(0x72)
     895        .dwattr $C$DW$61, DW_AT_decl_column(0x0d)
     896$C$DW$62        .dwtag  DW_TAG_member
     897        .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$11)
     898        .dwattr $C$DW$62, DW_AT_name("INTC_CLK_EN")
     899        .dwattr $C$DW$62, DW_AT_TI_symbol_name("INTC_CLK_EN")
     900        .dwattr $C$DW$62, DW_AT_bit_offset(0x17), DW_AT_bit_size(0x01)
     901        .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     902        .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     903        .dwattr $C$DW$62, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     904        .dwattr $C$DW$62, DW_AT_decl_line(0x73)
     905        .dwattr $C$DW$62, DW_AT_decl_column(0x0d)
     906$C$DW$63        .dwtag  DW_TAG_member
     907        .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$11)
     908        .dwattr $C$DW$63, DW_AT_name("UART_CLK_STOP_REQ")
     909        .dwattr $C$DW$63, DW_AT_TI_symbol_name("UART_CLK_STOP_REQ")
     910        .dwattr $C$DW$63, DW_AT_bit_offset(0x16), DW_AT_bit_size(0x01)
     911        .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     912        .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     913        .dwattr $C$DW$63, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     914        .dwattr $C$DW$63, DW_AT_decl_line(0x74)
     915        .dwattr $C$DW$63, DW_AT_decl_column(0x0d)
     916$C$DW$64        .dwtag  DW_TAG_member
     917        .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$11)
     918        .dwattr $C$DW$64, DW_AT_name("UART_CLK_STOP_ACK")
     919        .dwattr $C$DW$64, DW_AT_TI_symbol_name("UART_CLK_STOP_ACK")
     920        .dwattr $C$DW$64, DW_AT_bit_offset(0x15), DW_AT_bit_size(0x01)
     921        .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     922        .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     923        .dwattr $C$DW$64, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     924        .dwattr $C$DW$64, DW_AT_decl_line(0x75)
     925        .dwattr $C$DW$64, DW_AT_decl_column(0x0d)
     926$C$DW$65        .dwtag  DW_TAG_member
     927        .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$11)
     928        .dwattr $C$DW$65, DW_AT_name("UART_CLK_EN")
     929        .dwattr $C$DW$65, DW_AT_TI_symbol_name("UART_CLK_EN")
     930        .dwattr $C$DW$65, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x01)
     931        .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     932        .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     933        .dwattr $C$DW$65, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     934        .dwattr $C$DW$65, DW_AT_decl_line(0x76)
     935        .dwattr $C$DW$65, DW_AT_decl_column(0x0d)
PRU Assembler Unix v2.1.4 Sat Apr 14 23:41:47 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
beacon.asm                                                           PAGE   18

     936$C$DW$66        .dwtag  DW_TAG_member
     937        .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$11)
     938        .dwattr $C$DW$66, DW_AT_name("ECAP_CLK_STOP_REQ")
     939        .dwattr $C$DW$66, DW_AT_TI_symbol_name("ECAP_CLK_STOP_REQ")
     940        .dwattr $C$DW$66, DW_AT_bit_offset(0x13), DW_AT_bit_size(0x01)
     941        .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     942        .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     943        .dwattr $C$DW$66, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     944        .dwattr $C$DW$66, DW_AT_decl_line(0x77)
     945        .dwattr $C$DW$66, DW_AT_decl_column(0x0d)
     946$C$DW$67        .dwtag  DW_TAG_member
     947        .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$11)
     948        .dwattr $C$DW$67, DW_AT_name("ECAP_CLK_STOP_ACK")
     949        .dwattr $C$DW$67, DW_AT_TI_symbol_name("ECAP_CLK_STOP_ACK")
     950        .dwattr $C$DW$67, DW_AT_bit_offset(0x12), DW_AT_bit_size(0x01)
     951        .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     952        .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
     953        .dwattr $C$DW$67, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     954        .dwattr $C$DW$67, DW_AT_decl_line(0x78)
     955        .dwattr $C$DW$67, DW_AT_decl_column(0x0d)
     956$C$DW$68        .dwtag  DW_TAG_member
     957        .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$11)
     958        .dwattr $C$DW$68, DW_AT_name("ECAP_CLK_EN")
     959        .dwattr $C$DW$68, DW_AT_TI_symbol_name("ECAP_CLK_EN")
     960        .dwattr $C$DW$68, DW_AT_bit_offset(0x11), DW_AT_bit_size(0x01)
     961        .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     962        .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
     963        .dwattr $C$DW$68, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     964        .dwattr $C$DW$68, DW_AT_decl_line(0x79)
     965        .dwattr $C$DW$68, DW_AT_decl_column(0x0d)
     966$C$DW$69        .dwtag  DW_TAG_member
     967        .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$11)
     968        .dwattr $C$DW$69, DW_AT_name("IEP_CLK_STOP_REQ")
     969        .dwattr $C$DW$69, DW_AT_TI_symbol_name("IEP_CLK_STOP_REQ")
     970        .dwattr $C$DW$69, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x01)
     971        .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     972        .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
     973        .dwattr $C$DW$69, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     974        .dwattr $C$DW$69, DW_AT_decl_line(0x7a)
     975        .dwattr $C$DW$69, DW_AT_decl_column(0x0d)
     976$C$DW$70        .dwtag  DW_TAG_member
     977        .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$11)
     978        .dwattr $C$DW$70, DW_AT_name("IEP_CLK_STOP_ACK")
     979        .dwattr $C$DW$70, DW_AT_TI_symbol_name("IEP_CLK_STOP_ACK")
     980        .dwattr $C$DW$70, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
     981        .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     982        .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
     983        .dwattr $C$DW$70, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     984        .dwattr $C$DW$70, DW_AT_decl_line(0x7b)
     985        .dwattr $C$DW$70, DW_AT_decl_column(0x0d)
     986$C$DW$71        .dwtag  DW_TAG_member
     987        .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$11)
     988        .dwattr $C$DW$71, DW_AT_name("IEP_CLK_EN")
     989        .dwattr $C$DW$71, DW_AT_TI_symbol_name("IEP_CLK_EN")
     990        .dwattr $C$DW$71, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
PRU Assembler Unix v2.1.4 Sat Apr 14 23:41:47 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
beacon.asm                                                           PAGE   19

     991        .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     992        .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
     993        .dwattr $C$DW$71, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     994        .dwattr $C$DW$71, DW_AT_decl_line(0x7c)
     995        .dwattr $C$DW$71, DW_AT_decl_column(0x0d)
     996$C$DW$72        .dwtag  DW_TAG_member
     997        .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$11)
     998        .dwattr $C$DW$72, DW_AT_name("rsvd18")
     999        .dwattr $C$DW$72, DW_AT_TI_symbol_name("rsvd18")
    1000        .dwattr $C$DW$72, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0e)
    1001        .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1002        .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
    1003        .dwattr $C$DW$72, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1004        .dwattr $C$DW$72, DW_AT_decl_line(0x7d)
    1005        .dwattr $C$DW$72, DW_AT_decl_column(0x0d)
    1006        .dwendtag $C$DW$T$23
    1007
    1008        .dwattr $C$DW$T$23, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1009        .dwattr $C$DW$T$23, DW_AT_decl_line(0x6a)
    1010        .dwattr $C$DW$T$23, DW_AT_decl_column(0x13)
    1011$C$DW$T$116     .dwtag  DW_TAG_volatile_type
    1012        .dwattr $C$DW$T$116, DW_AT_type(*$C$DW$T$23)
    1013
    1014$C$DW$T$24      .dwtag  DW_TAG_structure_type
    1015        .dwattr $C$DW$T$24, DW_AT_byte_size(0x04)
    1016$C$DW$73        .dwtag  DW_TAG_member
    1017        .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$11)
    1018        .dwattr $C$DW$73, DW_AT_name("PRU0_IMEM_PE_RAW")
    1019        .dwattr $C$DW$73, DW_AT_TI_symbol_name("PRU0_IMEM_PE_RAW")
    1020        .dwattr $C$DW$73, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x04)
    1021        .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1022        .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
    1023        .dwattr $C$DW$73, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1024        .dwattr $C$DW$73, DW_AT_decl_line(0x87)
    1025        .dwattr $C$DW$73, DW_AT_decl_column(0x0d)
    1026$C$DW$74        .dwtag  DW_TAG_member
    1027        .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$11)
    1028        .dwattr $C$DW$74, DW_AT_name("PRU0_DMEM_PE_RAW")
    1029        .dwattr $C$DW$74, DW_AT_TI_symbol_name("PRU0_DMEM_PE_RAW")
    1030        .dwattr $C$DW$74, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x04)
    1031        .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1032        .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
    1033        .dwattr $C$DW$74, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1034        .dwattr $C$DW$74, DW_AT_decl_line(0x88)
    1035        .dwattr $C$DW$74, DW_AT_decl_column(0x0d)
    1036$C$DW$75        .dwtag  DW_TAG_member
    1037        .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$11)
    1038        .dwattr $C$DW$75, DW_AT_name("PRU1_IMEM_PE_RAW")
    1039        .dwattr $C$DW$75, DW_AT_TI_symbol_name("PRU1_IMEM_PE_RAW")
    1040        .dwattr $C$DW$75, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x04)
    1041        .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1042        .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
    1043        .dwattr $C$DW$75, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1044        .dwattr $C$DW$75, DW_AT_decl_line(0x89)
    1045        .dwattr $C$DW$75, DW_AT_decl_column(0x0d)
PRU Assembler Unix v2.1.4 Sat Apr 14 23:41:47 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
beacon.asm                                                           PAGE   20

    1046$C$DW$76        .dwtag  DW_TAG_member
    1047        .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$11)
    1048        .dwattr $C$DW$76, DW_AT_name("PRU1_DMEM_PE_RAW")
    1049        .dwattr $C$DW$76, DW_AT_TI_symbol_name("PRU1_DMEM_PE_RAW")
    1050        .dwattr $C$DW$76, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x04)
    1051        .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1052        .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    1053        .dwattr $C$DW$76, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1054        .dwattr $C$DW$76, DW_AT_decl_line(0x8a)
    1055        .dwattr $C$DW$76, DW_AT_decl_column(0x0d)
    1056$C$DW$77        .dwtag  DW_TAG_member
    1057        .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$11)
    1058        .dwattr $C$DW$77, DW_AT_name("RAM_PE_RAW")
    1059        .dwattr $C$DW$77, DW_AT_TI_symbol_name("RAM_PE_RAW")
    1060        .dwattr $C$DW$77, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
    1061        .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1062        .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1063        .dwattr $C$DW$77, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1064        .dwattr $C$DW$77, DW_AT_decl_line(0x8b)
    1065        .dwattr $C$DW$77, DW_AT_decl_column(0x0d)
    1066$C$DW$78        .dwtag  DW_TAG_member
    1067        .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$11)
    1068        .dwattr $C$DW$78, DW_AT_name("rsvd20")
    1069        .dwattr $C$DW$78, DW_AT_TI_symbol_name("rsvd20")
    1070        .dwattr $C$DW$78, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
    1071        .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1072        .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1073        .dwattr $C$DW$78, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1074        .dwattr $C$DW$78, DW_AT_decl_line(0x8c)
    1075        .dwattr $C$DW$78, DW_AT_decl_column(0x0d)
    1076        .dwendtag $C$DW$T$24
    1077
    1078        .dwattr $C$DW$T$24, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1079        .dwattr $C$DW$T$24, DW_AT_decl_line(0x86)
    1080        .dwattr $C$DW$T$24, DW_AT_decl_column(0x14)
    1081$C$DW$T$118     .dwtag  DW_TAG_volatile_type
    1082        .dwattr $C$DW$T$118, DW_AT_type(*$C$DW$T$24)
    1083
    1084$C$DW$T$25      .dwtag  DW_TAG_structure_type
    1085        .dwattr $C$DW$T$25, DW_AT_byte_size(0x04)
    1086$C$DW$79        .dwtag  DW_TAG_member
    1087        .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$11)
    1088        .dwattr $C$DW$79, DW_AT_name("PRU0_IMEM_PE")
    1089        .dwattr $C$DW$79, DW_AT_TI_symbol_name("PRU0_IMEM_PE")
    1090        .dwattr $C$DW$79, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x04)
    1091        .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1092        .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1093        .dwattr $C$DW$79, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1094        .dwattr $C$DW$79, DW_AT_decl_line(0x96)
    1095        .dwattr $C$DW$79, DW_AT_decl_column(0x0d)
    1096$C$DW$80        .dwtag  DW_TAG_member
    1097        .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$11)
    1098        .dwattr $C$DW$80, DW_AT_name("PRU0_DMEM_PE")
    1099        .dwattr $C$DW$80, DW_AT_TI_symbol_name("PRU0_DMEM_PE")
    1100        .dwattr $C$DW$80, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x04)
PRU Assembler Unix v2.1.4 Sat Apr 14 23:41:47 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
beacon.asm                                                           PAGE   21

    1101        .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1102        .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1103        .dwattr $C$DW$80, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1104        .dwattr $C$DW$80, DW_AT_decl_line(0x97)
    1105        .dwattr $C$DW$80, DW_AT_decl_column(0x0d)
    1106$C$DW$81        .dwtag  DW_TAG_member
    1107        .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$11)
    1108        .dwattr $C$DW$81, DW_AT_name("PRU1_IMEM_PE")
    1109        .dwattr $C$DW$81, DW_AT_TI_symbol_name("PRU1_IMEM_PE")
    1110        .dwattr $C$DW$81, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x04)
    1111        .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1112        .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1113        .dwattr $C$DW$81, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1114        .dwattr $C$DW$81, DW_AT_decl_line(0x98)
    1115        .dwattr $C$DW$81, DW_AT_decl_column(0x0d)
    1116$C$DW$82        .dwtag  DW_TAG_member
    1117        .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$11)
    1118        .dwattr $C$DW$82, DW_AT_name("PRU1_DMEM_PE")
    1119        .dwattr $C$DW$82, DW_AT_TI_symbol_name("PRU1_DMEM_PE")
    1120        .dwattr $C$DW$82, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x04)
    1121        .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1122        .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1123        .dwattr $C$DW$82, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1124        .dwattr $C$DW$82, DW_AT_decl_line(0x99)
    1125        .dwattr $C$DW$82, DW_AT_decl_column(0x0d)
    1126$C$DW$83        .dwtag  DW_TAG_member
    1127        .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$11)
    1128        .dwattr $C$DW$83, DW_AT_name("RAM_PE")
    1129        .dwattr $C$DW$83, DW_AT_TI_symbol_name("RAM_PE")
    1130        .dwattr $C$DW$83, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
    1131        .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1132        .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1133        .dwattr $C$DW$83, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1134        .dwattr $C$DW$83, DW_AT_decl_line(0x9a)
    1135        .dwattr $C$DW$83, DW_AT_decl_column(0x0d)
    1136$C$DW$84        .dwtag  DW_TAG_member
    1137        .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$11)
    1138        .dwattr $C$DW$84, DW_AT_name("rsvd20")
    1139        .dwattr $C$DW$84, DW_AT_TI_symbol_name("rsvd20")
    1140        .dwattr $C$DW$84, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
    1141        .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1142        .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1143        .dwattr $C$DW$84, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1144        .dwattr $C$DW$84, DW_AT_decl_line(0x9b)
    1145        .dwattr $C$DW$84, DW_AT_decl_column(0x0d)
    1146        .dwendtag $C$DW$T$25
    1147
    1148        .dwattr $C$DW$T$25, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1149        .dwattr $C$DW$T$25, DW_AT_decl_line(0x95)
    1150        .dwattr $C$DW$T$25, DW_AT_decl_column(0x14)
    1151$C$DW$T$120     .dwtag  DW_TAG_volatile_type
    1152        .dwattr $C$DW$T$120, DW_AT_type(*$C$DW$T$25)
    1153
    1154$C$DW$T$26      .dwtag  DW_TAG_structure_type
    1155        .dwattr $C$DW$T$26, DW_AT_byte_size(0x04)
PRU Assembler Unix v2.1.4 Sat Apr 14 23:41:47 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
beacon.asm                                                           PAGE   22

    1156$C$DW$85        .dwtag  DW_TAG_member
    1157        .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$11)
    1158        .dwattr $C$DW$85, DW_AT_name("PRU0_IMEM_PE_SET")
    1159        .dwattr $C$DW$85, DW_AT_TI_symbol_name("PRU0_IMEM_PE_SET")
    1160        .dwattr $C$DW$85, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x04)
    1161        .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1162        .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1163        .dwattr $C$DW$85, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1164        .dwattr $C$DW$85, DW_AT_decl_line(0xa4)
    1165        .dwattr $C$DW$85, DW_AT_decl_column(0x0d)
    1166$C$DW$86        .dwtag  DW_TAG_member
    1167        .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$11)
    1168        .dwattr $C$DW$86, DW_AT_name("PRU0_DMEM_PE_SET")
    1169        .dwattr $C$DW$86, DW_AT_TI_symbol_name("PRU0_DMEM_PE_SET")
    1170        .dwattr $C$DW$86, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x04)
    1171        .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1172        .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1173        .dwattr $C$DW$86, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1174        .dwattr $C$DW$86, DW_AT_decl_line(0xa5)
    1175        .dwattr $C$DW$86, DW_AT_decl_column(0x0d)
    1176$C$DW$87        .dwtag  DW_TAG_member
    1177        .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$11)
    1178        .dwattr $C$DW$87, DW_AT_name("PRU1_IMEM_PE_SET")
    1179        .dwattr $C$DW$87, DW_AT_TI_symbol_name("PRU1_IMEM_PE_SET")
    1180        .dwattr $C$DW$87, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x04)
    1181        .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1182        .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1183        .dwattr $C$DW$87, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1184        .dwattr $C$DW$87, DW_AT_decl_line(0xa6)
    1185        .dwattr $C$DW$87, DW_AT_decl_column(0x0d)
    1186$C$DW$88        .dwtag  DW_TAG_member
    1187        .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$11)
    1188        .dwattr $C$DW$88, DW_AT_name("PRU1_DMEM_PE_SET")
    1189        .dwattr $C$DW$88, DW_AT_TI_symbol_name("PRU1_DMEM_PE_SET")
    1190        .dwattr $C$DW$88, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x04)
    1191        .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1192        .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1193        .dwattr $C$DW$88, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1194        .dwattr $C$DW$88, DW_AT_decl_line(0xa7)
    1195        .dwattr $C$DW$88, DW_AT_decl_column(0x0d)
    1196$C$DW$89        .dwtag  DW_TAG_member
    1197        .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$11)
    1198        .dwattr $C$DW$89, DW_AT_name("RAM_PE_SET")
    1199        .dwattr $C$DW$89, DW_AT_TI_symbol_name("RAM_PE_SET")
    1200        .dwattr $C$DW$89, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
    1201        .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1202        .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1203        .dwattr $C$DW$89, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1204        .dwattr $C$DW$89, DW_AT_decl_line(0xa8)
    1205        .dwattr $C$DW$89, DW_AT_decl_column(0x0d)
    1206$C$DW$90        .dwtag  DW_TAG_member
    1207        .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$11)
    1208        .dwattr $C$DW$90, DW_AT_name("rsvd20")
    1209        .dwattr $C$DW$90, DW_AT_TI_symbol_name("rsvd20")
    1210        .dwattr $C$DW$90, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
PRU Assembler Unix v2.1.4 Sat Apr 14 23:41:47 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
beacon.asm                                                           PAGE   23

    1211        .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1212        .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1213        .dwattr $C$DW$90, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1214        .dwattr $C$DW$90, DW_AT_decl_line(0xa9)
    1215        .dwattr $C$DW$90, DW_AT_decl_column(0x0d)
    1216        .dwendtag $C$DW$T$26
    1217
    1218        .dwattr $C$DW$T$26, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1219        .dwattr $C$DW$T$26, DW_AT_decl_line(0xa3)
    1220        .dwattr $C$DW$T$26, DW_AT_decl_column(0x13)
    1221$C$DW$T$122     .dwtag  DW_TAG_volatile_type
    1222        .dwattr $C$DW$T$122, DW_AT_type(*$C$DW$T$26)
    1223
    1224$C$DW$T$27      .dwtag  DW_TAG_structure_type
    1225        .dwattr $C$DW$T$27, DW_AT_byte_size(0x04)
    1226$C$DW$91        .dwtag  DW_TAG_member
    1227        .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$11)
    1228        .dwattr $C$DW$91, DW_AT_name("PRU0_IMEM_PE_CLR")
    1229        .dwattr $C$DW$91, DW_AT_TI_symbol_name("PRU0_IMEM_PE_CLR")
    1230        .dwattr $C$DW$91, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x04)
    1231        .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1232        .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1233        .dwattr $C$DW$91, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1234        .dwattr $C$DW$91, DW_AT_decl_line(0xb3)
    1235        .dwattr $C$DW$91, DW_AT_decl_column(0x0d)
    1236$C$DW$92        .dwtag  DW_TAG_member
    1237        .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$11)
    1238        .dwattr $C$DW$92, DW_AT_name("PRU0_DMEM_PE_CLR")
    1239        .dwattr $C$DW$92, DW_AT_TI_symbol_name("PRU0_DMEM_PE_CLR")
    1240        .dwattr $C$DW$92, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x04)
    1241        .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1242        .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1243        .dwattr $C$DW$92, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1244        .dwattr $C$DW$92, DW_AT_decl_line(0xb4)
    1245        .dwattr $C$DW$92, DW_AT_decl_column(0x0d)
    1246$C$DW$93        .dwtag  DW_TAG_member
    1247        .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$11)
    1248        .dwattr $C$DW$93, DW_AT_name("PRU1_IMEM_PE_CLR")
    1249        .dwattr $C$DW$93, DW_AT_TI_symbol_name("PRU1_IMEM_PE_CLR")
    1250        .dwattr $C$DW$93, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x04)
    1251        .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1252        .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1253        .dwattr $C$DW$93, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1254        .dwattr $C$DW$93, DW_AT_decl_line(0xb5)
    1255        .dwattr $C$DW$93, DW_AT_decl_column(0x0d)
    1256$C$DW$94        .dwtag  DW_TAG_member
    1257        .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$11)
    1258        .dwattr $C$DW$94, DW_AT_name("PRU1_DMEM_PE_CLR")
    1259        .dwattr $C$DW$94, DW_AT_TI_symbol_name("PRU1_DMEM_PE_CLR")
    1260        .dwattr $C$DW$94, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x04)
    1261        .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1262        .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1263        .dwattr $C$DW$94, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1264        .dwattr $C$DW$94, DW_AT_decl_line(0xb6)
    1265        .dwattr $C$DW$94, DW_AT_decl_column(0x0d)
PRU Assembler Unix v2.1.4 Sat Apr 14 23:41:47 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
beacon.asm                                                           PAGE   24

    1266$C$DW$95        .dwtag  DW_TAG_member
    1267        .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$11)
    1268        .dwattr $C$DW$95, DW_AT_name("rsvd16")
    1269        .dwattr $C$DW$95, DW_AT_TI_symbol_name("rsvd16")
    1270        .dwattr $C$DW$95, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1271        .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1272        .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1273        .dwattr $C$DW$95, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1274        .dwattr $C$DW$95, DW_AT_decl_line(0xb7)
    1275        .dwattr $C$DW$95, DW_AT_decl_column(0x0d)
    1276        .dwendtag $C$DW$T$27
    1277
    1278        .dwattr $C$DW$T$27, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1279        .dwattr $C$DW$T$27, DW_AT_decl_line(0xb2)
    1280        .dwattr $C$DW$T$27, DW_AT_decl_column(0x13)
    1281$C$DW$T$124     .dwtag  DW_TAG_volatile_type
    1282        .dwattr $C$DW$T$124, DW_AT_type(*$C$DW$T$27)
    1283
    1284$C$DW$T$28      .dwtag  DW_TAG_structure_type
    1285        .dwattr $C$DW$T$28, DW_AT_byte_size(0x04)
    1286$C$DW$96        .dwtag  DW_TAG_member
    1287        .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$11)
    1288        .dwattr $C$DW$96, DW_AT_name("PMAO_PRU0")
    1289        .dwattr $C$DW$96, DW_AT_TI_symbol_name("PMAO_PRU0")
    1290        .dwattr $C$DW$96, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
    1291        .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1292        .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1293        .dwattr $C$DW$96, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1294        .dwattr $C$DW$96, DW_AT_decl_line(0xc4)
    1295        .dwattr $C$DW$96, DW_AT_decl_column(0x0d)
    1296$C$DW$97        .dwtag  DW_TAG_member
    1297        .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$11)
    1298        .dwattr $C$DW$97, DW_AT_name("PMAO_PRU1")
    1299        .dwattr $C$DW$97, DW_AT_TI_symbol_name("PMAO_PRU1")
    1300        .dwattr $C$DW$97, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x01)
    1301        .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1302        .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1303        .dwattr $C$DW$97, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1304        .dwattr $C$DW$97, DW_AT_decl_line(0xc5)
    1305        .dwattr $C$DW$97, DW_AT_decl_column(0x0d)
    1306$C$DW$98        .dwtag  DW_TAG_member
    1307        .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$11)
    1308        .dwattr $C$DW$98, DW_AT_name("rsvd2")
    1309        .dwattr $C$DW$98, DW_AT_TI_symbol_name("rsvd2")
    1310        .dwattr $C$DW$98, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1e)
    1311        .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1312        .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1313        .dwattr $C$DW$98, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1314        .dwattr $C$DW$98, DW_AT_decl_line(0xc6)
    1315        .dwattr $C$DW$98, DW_AT_decl_column(0x0d)
    1316        .dwendtag $C$DW$T$28
    1317
    1318        .dwattr $C$DW$T$28, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1319        .dwattr $C$DW$T$28, DW_AT_decl_line(0xc3)
    1320        .dwattr $C$DW$T$28, DW_AT_decl_column(0x13)
PRU Assembler Unix v2.1.4 Sat Apr 14 23:41:47 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
beacon.asm                                                           PAGE   25

    1321$C$DW$T$126     .dwtag  DW_TAG_volatile_type
    1322        .dwattr $C$DW$T$126, DW_AT_type(*$C$DW$T$28)
    1323
    1324$C$DW$T$29      .dwtag  DW_TAG_structure_type
    1325        .dwattr $C$DW$T$29, DW_AT_byte_size(0x04)
    1326$C$DW$99        .dwtag  DW_TAG_member
    1327        .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$11)
    1328        .dwattr $C$DW$99, DW_AT_name("OCP_EN")
    1329        .dwattr $C$DW$99, DW_AT_TI_symbol_name("OCP_EN")
    1330        .dwattr $C$DW$99, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
    1331        .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1332        .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1333        .dwattr $C$DW$99, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1334        .dwattr $C$DW$99, DW_AT_decl_line(0xd3)
    1335        .dwattr $C$DW$99, DW_AT_decl_column(0x0d)
    1336$C$DW$100       .dwtag  DW_TAG_member
    1337        .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$11)
    1338        .dwattr $C$DW$100, DW_AT_name("rsvd1")
    1339        .dwattr $C$DW$100, DW_AT_TI_symbol_name("rsvd1")
    1340        .dwattr $C$DW$100, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1f)
    1341        .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1342        .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1343        .dwattr $C$DW$100, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1344        .dwattr $C$DW$100, DW_AT_decl_line(0xd4)
    1345        .dwattr $C$DW$100, DW_AT_decl_column(0x0d)
    1346        .dwendtag $C$DW$T$29
    1347
    1348        .dwattr $C$DW$T$29, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1349        .dwattr $C$DW$T$29, DW_AT_decl_line(0xd2)
    1350        .dwattr $C$DW$T$29, DW_AT_decl_column(0x13)
    1351$C$DW$T$128     .dwtag  DW_TAG_volatile_type
    1352        .dwattr $C$DW$T$128, DW_AT_type(*$C$DW$T$29)
    1353
    1354$C$DW$T$30      .dwtag  DW_TAG_structure_type
    1355        .dwattr $C$DW$T$30, DW_AT_byte_size(0x04)
    1356$C$DW$101       .dwtag  DW_TAG_member
    1357        .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$11)
    1358        .dwattr $C$DW$101, DW_AT_name("PRU1_PAD_HP_EN")
    1359        .dwattr $C$DW$101, DW_AT_TI_symbol_name("PRU1_PAD_HP_EN")
    1360        .dwattr $C$DW$101, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
    1361        .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1362        .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1363        .dwattr $C$DW$101, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1364        .dwattr $C$DW$101, DW_AT_decl_line(0xde)
    1365        .dwattr $C$DW$101, DW_AT_decl_column(0x0d)
    1366$C$DW$102       .dwtag  DW_TAG_member
    1367        .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$11)
    1368        .dwattr $C$DW$102, DW_AT_name("XFR_SHIFT_EN")
    1369        .dwattr $C$DW$102, DW_AT_TI_symbol_name("XFR_SHIFT_EN")
    1370        .dwattr $C$DW$102, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x01)
    1371        .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1372        .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1373        .dwattr $C$DW$102, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1374        .dwattr $C$DW$102, DW_AT_decl_line(0xdf)
    1375        .dwattr $C$DW$102, DW_AT_decl_column(0x0d)
PRU Assembler Unix v2.1.4 Sat Apr 14 23:41:47 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
beacon.asm                                                           PAGE   26

    1376$C$DW$103       .dwtag  DW_TAG_member
    1377        .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$11)
    1378        .dwattr $C$DW$103, DW_AT_name("rsvd2")
    1379        .dwattr $C$DW$103, DW_AT_TI_symbol_name("rsvd2")
    1380        .dwattr $C$DW$103, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1e)
    1381        .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1382        .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1383        .dwattr $C$DW$103, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1384        .dwattr $C$DW$103, DW_AT_decl_line(0xe0)
    1385        .dwattr $C$DW$103, DW_AT_decl_column(0x0d)
    1386        .dwendtag $C$DW$T$30
    1387
    1388        .dwattr $C$DW$T$30, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1389        .dwattr $C$DW$T$30, DW_AT_decl_line(0xdd)
    1390        .dwattr $C$DW$T$30, DW_AT_decl_column(0x13)
    1391$C$DW$T$130     .dwtag  DW_TAG_volatile_type
    1392        .dwattr $C$DW$T$130, DW_AT_type(*$C$DW$T$30)
    1393
    1394$C$DW$T$31      .dwtag  DW_TAG_structure_type
    1395        .dwattr $C$DW$T$31, DW_AT_byte_size(0x04)
    1396$C$DW$104       .dwtag  DW_TAG_member
    1397        .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$11)
    1398        .dwattr $C$DW$104, DW_AT_name("PIN_MUX_SEL")
    1399        .dwattr $C$DW$104, DW_AT_TI_symbol_name("PIN_MUX_SEL")
    1400        .dwattr $C$DW$104, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x08)
    1401        .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1402        .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1403        .dwattr $C$DW$104, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1404        .dwattr $C$DW$104, DW_AT_decl_line(0xec)
    1405        .dwattr $C$DW$104, DW_AT_decl_column(0x0d)
    1406$C$DW$105       .dwtag  DW_TAG_member
    1407        .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$11)
    1408        .dwattr $C$DW$105, DW_AT_name("rsvd2")
    1409        .dwattr $C$DW$105, DW_AT_TI_symbol_name("rsvd2")
    1410        .dwattr $C$DW$105, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x18)
    1411        .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1412        .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1413        .dwattr $C$DW$105, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1414        .dwattr $C$DW$105, DW_AT_decl_line(0xed)
    1415        .dwattr $C$DW$105, DW_AT_decl_column(0x0d)
    1416        .dwendtag $C$DW$T$31
    1417
    1418        .dwattr $C$DW$T$31, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1419        .dwattr $C$DW$T$31, DW_AT_decl_line(0xeb)
    1420        .dwattr $C$DW$T$31, DW_AT_decl_column(0x13)
    1421$C$DW$T$132     .dwtag  DW_TAG_volatile_type
    1422        .dwattr $C$DW$T$132, DW_AT_type(*$C$DW$T$31)
    1423
    1424$C$DW$T$35      .dwtag  DW_TAG_structure_type
    1425        .dwattr $C$DW$T$35, DW_AT_byte_size(0x44)
    1426$C$DW$106       .dwtag  DW_TAG_member
    1427        .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$109)
    1428        .dwattr $C$DW$106, DW_AT_name("$P$T0")
    1429        .dwattr $C$DW$106, DW_AT_TI_symbol_name("$P$T0")
    1430        .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
PRU Assembler Unix v2.1.4 Sat Apr 14 23:41:47 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
beacon.asm                                                           PAGE   27

    1431        .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1432        .dwattr $C$DW$106, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1433        .dwattr $C$DW$106, DW_AT_decl_line(0x29)
    1434        .dwattr $C$DW$106, DW_AT_decl_column(0x02)
    1435$C$DW$107       .dwtag  DW_TAG_member
    1436        .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$111)
    1437        .dwattr $C$DW$107, DW_AT_name("$P$T1")
    1438        .dwattr $C$DW$107, DW_AT_TI_symbol_name("$P$T1")
    1439        .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1440        .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1441        .dwattr $C$DW$107, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1442        .dwattr $C$DW$107, DW_AT_decl_line(0x33)
    1443        .dwattr $C$DW$107, DW_AT_decl_column(0x02)
    1444$C$DW$108       .dwtag  DW_TAG_member
    1445        .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$113)
    1446        .dwattr $C$DW$108, DW_AT_name("$P$T2")
    1447        .dwattr $C$DW$108, DW_AT_TI_symbol_name("$P$T2")
    1448        .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1449        .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1450        .dwattr $C$DW$108, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1451        .dwattr $C$DW$108, DW_AT_decl_line(0x41)
    1452        .dwattr $C$DW$108, DW_AT_decl_column(0x02)
    1453$C$DW$109       .dwtag  DW_TAG_member
    1454        .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$115)
    1455        .dwattr $C$DW$109, DW_AT_name("$P$T3")
    1456        .dwattr $C$DW$109, DW_AT_TI_symbol_name("$P$T3")
    1457        .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1458        .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1459        .dwattr $C$DW$109, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1460        .dwattr $C$DW$109, DW_AT_decl_line(0x54)
    1461        .dwattr $C$DW$109, DW_AT_decl_column(0x02)
    1462$C$DW$110       .dwtag  DW_TAG_member
    1463        .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$117)
    1464        .dwattr $C$DW$110, DW_AT_name("$P$T4")
    1465        .dwattr $C$DW$110, DW_AT_TI_symbol_name("$P$T4")
    1466        .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1467        .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1468        .dwattr $C$DW$110, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1469        .dwattr $C$DW$110, DW_AT_decl_line(0x67)
    1470        .dwattr $C$DW$110, DW_AT_decl_column(0x02)
    1471$C$DW$111       .dwtag  DW_TAG_member
    1472        .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$119)
    1473        .dwattr $C$DW$111, DW_AT_name("$P$T5")
    1474        .dwattr $C$DW$111, DW_AT_TI_symbol_name("$P$T5")
    1475        .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1476        .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1477        .dwattr $C$DW$111, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1478        .dwattr $C$DW$111, DW_AT_decl_line(0x83)
    1479        .dwattr $C$DW$111, DW_AT_decl_column(0x02)
    1480$C$DW$112       .dwtag  DW_TAG_member
    1481        .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$121)
    1482        .dwattr $C$DW$112, DW_AT_name("$P$T6")
    1483        .dwattr $C$DW$112, DW_AT_TI_symbol_name("$P$T6")
    1484        .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1485        .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
PRU Assembler Unix v2.1.4 Sat Apr 14 23:41:47 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
beacon.asm                                                           PAGE   28

    1486        .dwattr $C$DW$112, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1487        .dwattr $C$DW$112, DW_AT_decl_line(0x92)
    1488        .dwattr $C$DW$112, DW_AT_decl_column(0x02)
    1489$C$DW$113       .dwtag  DW_TAG_member
    1490        .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$123)
    1491        .dwattr $C$DW$113, DW_AT_name("$P$T7")
    1492        .dwattr $C$DW$113, DW_AT_TI_symbol_name("$P$T7")
    1493        .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1494        .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1495        .dwattr $C$DW$113, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1496        .dwattr $C$DW$113, DW_AT_decl_line(0xa0)
    1497        .dwattr $C$DW$113, DW_AT_decl_column(0x02)
    1498$C$DW$114       .dwtag  DW_TAG_member
    1499        .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$125)
    1500        .dwattr $C$DW$114, DW_AT_name("$P$T8")
    1501        .dwattr $C$DW$114, DW_AT_TI_symbol_name("$P$T8")
    1502        .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1503        .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1504        .dwattr $C$DW$114, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1505        .dwattr $C$DW$114, DW_AT_decl_line(0xaf)
    1506        .dwattr $C$DW$114, DW_AT_decl_column(0x02)
    1507$C$DW$115       .dwtag  DW_TAG_member
    1508        .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$32)
    1509        .dwattr $C$DW$115, DW_AT_name("rsvd24")
    1510        .dwattr $C$DW$115, DW_AT_TI_symbol_name("rsvd24")
    1511        .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1512        .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1513        .dwattr $C$DW$115, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1514        .dwattr $C$DW$115, DW_AT_decl_line(0xbc)
    1515        .dwattr $C$DW$115, DW_AT_decl_column(0x0b)
    1516$C$DW$116       .dwtag  DW_TAG_member
    1517        .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$127)
    1518        .dwattr $C$DW$116, DW_AT_name("$P$T9")
    1519        .dwattr $C$DW$116, DW_AT_TI_symbol_name("$P$T9")
    1520        .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    1521        .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1522        .dwattr $C$DW$116, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1523        .dwattr $C$DW$116, DW_AT_decl_line(0xc0)
    1524        .dwattr $C$DW$116, DW_AT_decl_column(0x02)
    1525$C$DW$117       .dwtag  DW_TAG_member
    1526        .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$33)
    1527        .dwattr $C$DW$117, DW_AT_name("rsvd2c")
    1528        .dwattr $C$DW$117, DW_AT_TI_symbol_name("rsvd2c")
    1529        .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    1530        .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1531        .dwattr $C$DW$117, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1532        .dwattr $C$DW$117, DW_AT_decl_line(0xcb)
    1533        .dwattr $C$DW$117, DW_AT_decl_column(0x0b)
    1534$C$DW$118       .dwtag  DW_TAG_member
    1535        .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$129)
    1536        .dwattr $C$DW$118, DW_AT_name("$P$T10")
    1537        .dwattr $C$DW$118, DW_AT_TI_symbol_name("$P$T10")
    1538        .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    1539        .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1540        .dwattr $C$DW$118, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
PRU Assembler Unix v2.1.4 Sat Apr 14 23:41:47 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
beacon.asm                                                           PAGE   29

    1541        .dwattr $C$DW$118, DW_AT_decl_line(0xcf)
    1542        .dwattr $C$DW$118, DW_AT_decl_column(0x02)
    1543$C$DW$119       .dwtag  DW_TAG_member
    1544        .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$131)
    1545        .dwattr $C$DW$119, DW_AT_name("$P$T11")
    1546        .dwattr $C$DW$119, DW_AT_TI_symbol_name("$P$T11")
    1547        .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    1548        .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1549        .dwattr $C$DW$119, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1550        .dwattr $C$DW$119, DW_AT_decl_line(0xda)
    1551        .dwattr $C$DW$119, DW_AT_decl_column(0x02)
    1552$C$DW$120       .dwtag  DW_TAG_member
    1553        .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$34)
    1554        .dwattr $C$DW$120, DW_AT_name("rsvd38")
    1555        .dwattr $C$DW$120, DW_AT_TI_symbol_name("rsvd38")
    1556        .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    1557        .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1558        .dwattr $C$DW$120, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1559        .dwattr $C$DW$120, DW_AT_decl_line(0xe5)
    1560        .dwattr $C$DW$120, DW_AT_decl_column(0x0b)
    1561$C$DW$121       .dwtag  DW_TAG_member
    1562        .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$133)
    1563        .dwattr $C$DW$121, DW_AT_name("$P$T12")
    1564        .dwattr $C$DW$121, DW_AT_TI_symbol_name("$P$T12")
    1565        .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    1566        .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1567        .dwattr $C$DW$121, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1568        .dwattr $C$DW$121, DW_AT_decl_line(0xe8)
    1569        .dwattr $C$DW$121, DW_AT_decl_column(0x02)
    1570        .dwendtag $C$DW$T$35
    1571
    1572        .dwattr $C$DW$T$35, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1573        .dwattr $C$DW$T$35, DW_AT_decl_line(0x26)
    1574        .dwattr $C$DW$T$35, DW_AT_decl_column(0x10)
    1575$C$DW$T$262     .dwtag  DW_TAG_typedef, DW_AT_name("pruCfg")
    1576        .dwattr $C$DW$T$262, DW_AT_type(*$C$DW$T$35)
    1577        .dwattr $C$DW$T$262, DW_AT_language(DW_LANG_C)
    1578        .dwattr $C$DW$T$262, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/
    1579        .dwattr $C$DW$T$262, DW_AT_decl_line(0xf0)
    1580        .dwattr $C$DW$T$262, DW_AT_decl_column(0x03)
    1581$C$DW$T$263     .dwtag  DW_TAG_volatile_type
    1582        .dwattr $C$DW$T$263, DW_AT_type(*$C$DW$T$262)
    1583
    1584$C$DW$T$36      .dwtag  DW_TAG_structure_type
    1585        .dwattr $C$DW$T$36, DW_AT_byte_size(0x04)
    1586$C$DW$122       .dwtag  DW_TAG_member
    1587        .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$11)
    1588        .dwattr $C$DW$122, DW_AT_name("REV_MINOR")
    1589        .dwattr $C$DW$122, DW_AT_TI_symbol_name("REV_MINOR")
    1590        .dwattr $C$DW$122, DW_AT_bit_offset(0x1a), DW_AT_bit_size(0x06)
    1591        .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1592        .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1593        .dwattr $C$DW$122, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1594        .dwattr $C$DW$122, DW_AT_decl_line(0x2d)
    1595        .dwattr $C$DW$122, DW_AT_decl_column(0x0d)
PRU Assembler Unix v2.1.4 Sat Apr 14 23:41:47 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
beacon.asm                                                           PAGE   30

    1596$C$DW$123       .dwtag  DW_TAG_member
    1597        .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$11)
    1598        .dwattr $C$DW$123, DW_AT_name("REV_CUSTOM")
    1599        .dwattr $C$DW$123, DW_AT_TI_symbol_name("REV_CUSTOM")
    1600        .dwattr $C$DW$123, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x02)
    1601        .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1602        .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1603        .dwattr $C$DW$123, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1604        .dwattr $C$DW$123, DW_AT_decl_line(0x2e)
    1605        .dwattr $C$DW$123, DW_AT_decl_column(0x0d)
    1606$C$DW$124       .dwtag  DW_TAG_member
    1607        .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$11)
    1608        .dwattr $C$DW$124, DW_AT_name("REV_MAJOR")
    1609        .dwattr $C$DW$124, DW_AT_TI_symbol_name("REV_MAJOR")
    1610        .dwattr $C$DW$124, DW_AT_bit_offset(0x15), DW_AT_bit_size(0x03)
    1611        .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1612        .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1613        .dwattr $C$DW$124, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1614        .dwattr $C$DW$124, DW_AT_decl_line(0x2f)
    1615        .dwattr $C$DW$124, DW_AT_decl_column(0x0d)
    1616$C$DW$125       .dwtag  DW_TAG_member
    1617        .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$11)
    1618        .dwattr $C$DW$125, DW_AT_name("REV_RTL")
    1619        .dwattr $C$DW$125, DW_AT_TI_symbol_name("REV_RTL")
    1620        .dwattr $C$DW$125, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x05)
    1621        .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1622        .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1623        .dwattr $C$DW$125, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1624        .dwattr $C$DW$125, DW_AT_decl_line(0x30)
    1625        .dwattr $C$DW$125, DW_AT_decl_column(0x0d)
    1626$C$DW$126       .dwtag  DW_TAG_member
    1627        .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$11)
    1628        .dwattr $C$DW$126, DW_AT_name("REV_MODULE")
    1629        .dwattr $C$DW$126, DW_AT_TI_symbol_name("REV_MODULE")
    1630        .dwattr $C$DW$126, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x0c)
    1631        .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1632        .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1633        .dwattr $C$DW$126, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1634        .dwattr $C$DW$126, DW_AT_decl_line(0x31)
    1635        .dwattr $C$DW$126, DW_AT_decl_column(0x0d)
    1636$C$DW$127       .dwtag  DW_TAG_member
    1637        .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$11)
    1638        .dwattr $C$DW$127, DW_AT_name("rsvd28")
    1639        .dwattr $C$DW$127, DW_AT_TI_symbol_name("rsvd28")
    1640        .dwattr $C$DW$127, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
    1641        .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1642        .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1643        .dwattr $C$DW$127, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1644        .dwattr $C$DW$127, DW_AT_decl_line(0x32)
    1645        .dwattr $C$DW$127, DW_AT_decl_column(0x0d)
    1646$C$DW$128       .dwtag  DW_TAG_member
    1647        .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$11)
    1648        .dwattr $C$DW$128, DW_AT_name("REV_SCHEME")
    1649        .dwattr $C$DW$128, DW_AT_TI_symbol_name("REV_SCHEME")
    1650        .dwattr $C$DW$128, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
PRU Assembler Unix v2.1.4 Sat Apr 14 23:41:47 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
beacon.asm                                                           PAGE   31

    1651        .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1652        .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1653        .dwattr $C$DW$128, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1654        .dwattr $C$DW$128, DW_AT_decl_line(0x33)
    1655        .dwattr $C$DW$128, DW_AT_decl_column(0x0d)
    1656        .dwendtag $C$DW$T$36
    1657
    1658        .dwattr $C$DW$T$36, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1659        .dwattr $C$DW$T$36, DW_AT_decl_line(0x2c)
    1660        .dwattr $C$DW$T$36, DW_AT_decl_column(0x13)
    1661$C$DW$T$134     .dwtag  DW_TAG_volatile_type
    1662        .dwattr $C$DW$T$134, DW_AT_type(*$C$DW$T$36)
    1663
    1664$C$DW$T$37      .dwtag  DW_TAG_structure_type
    1665        .dwattr $C$DW$T$37, DW_AT_byte_size(0x04)
    1666$C$DW$129       .dwtag  DW_TAG_member
    1667        .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$11)
    1668        .dwattr $C$DW$129, DW_AT_name("rsvd0")
    1669        .dwattr $C$DW$129, DW_AT_TI_symbol_name("rsvd0")
    1670        .dwattr $C$DW$129, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x02)
    1671        .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1672        .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1673        .dwattr $C$DW$129, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1674        .dwattr $C$DW$129, DW_AT_decl_line(0x3d)
    1675        .dwattr $C$DW$129, DW_AT_decl_column(0x0d)
    1676$C$DW$130       .dwtag  DW_TAG_member
    1677        .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$11)
    1678        .dwattr $C$DW$130, DW_AT_name("NEST_MODE")
    1679        .dwattr $C$DW$130, DW_AT_TI_symbol_name("NEST_MODE")
    1680        .dwattr $C$DW$130, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x02)
    1681        .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1682        .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1683        .dwattr $C$DW$130, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1684        .dwattr $C$DW$130, DW_AT_decl_line(0x3e)
    1685        .dwattr $C$DW$130, DW_AT_decl_column(0x0d)
    1686$C$DW$131       .dwtag  DW_TAG_member
    1687        .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$11)
    1688        .dwattr $C$DW$131, DW_AT_name("rsvd4")
    1689        .dwattr $C$DW$131, DW_AT_TI_symbol_name("rsvd4")
    1690        .dwattr $C$DW$131, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1c)
    1691        .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1692        .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1693        .dwattr $C$DW$131, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1694        .dwattr $C$DW$131, DW_AT_decl_line(0x3f)
    1695        .dwattr $C$DW$131, DW_AT_decl_column(0x0d)
    1696        .dwendtag $C$DW$T$37
    1697
    1698        .dwattr $C$DW$T$37, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1699        .dwattr $C$DW$T$37, DW_AT_decl_line(0x3c)
    1700        .dwattr $C$DW$T$37, DW_AT_decl_column(0x13)
    1701$C$DW$T$136     .dwtag  DW_TAG_volatile_type
    1702        .dwattr $C$DW$T$136, DW_AT_type(*$C$DW$T$37)
    1703
    1704$C$DW$T$38      .dwtag  DW_TAG_structure_type
    1705        .dwattr $C$DW$T$38, DW_AT_byte_size(0x04)
PRU Assembler Unix v2.1.4 Sat Apr 14 23:41:47 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
beacon.asm                                                           PAGE   32

    1706$C$DW$132       .dwtag  DW_TAG_member
    1707        .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$11)
    1708        .dwattr $C$DW$132, DW_AT_name("EN_HINT_ANY")
    1709        .dwattr $C$DW$132, DW_AT_TI_symbol_name("EN_HINT_ANY")
    1710        .dwattr $C$DW$132, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
    1711        .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1712        .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1713        .dwattr $C$DW$132, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1714        .dwattr $C$DW$132, DW_AT_decl_line(0x4c)
    1715        .dwattr $C$DW$132, DW_AT_decl_column(0x0d)
    1716$C$DW$133       .dwtag  DW_TAG_member
    1717        .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$11)
    1718        .dwattr $C$DW$133, DW_AT_name("rsvd1")
    1719        .dwattr $C$DW$133, DW_AT_TI_symbol_name("rsvd1")
    1720        .dwattr $C$DW$133, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1f)
    1721        .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1722        .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1723        .dwattr $C$DW$133, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1724        .dwattr $C$DW$133, DW_AT_decl_line(0x4d)
    1725        .dwattr $C$DW$133, DW_AT_decl_column(0x0d)
    1726        .dwendtag $C$DW$T$38
    1727
    1728        .dwattr $C$DW$T$38, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1729        .dwattr $C$DW$T$38, DW_AT_decl_line(0x4b)
    1730        .dwattr $C$DW$T$38, DW_AT_decl_column(0x13)
    1731$C$DW$T$138     .dwtag  DW_TAG_volatile_type
    1732        .dwattr $C$DW$T$138, DW_AT_type(*$C$DW$T$38)
    1733
    1734$C$DW$T$39      .dwtag  DW_TAG_structure_type
    1735        .dwattr $C$DW$T$39, DW_AT_byte_size(0x04)
    1736$C$DW$134       .dwtag  DW_TAG_member
    1737        .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$11)
    1738        .dwattr $C$DW$134, DW_AT_name("GLB_NEST_LEVEL")
    1739        .dwattr $C$DW$134, DW_AT_TI_symbol_name("GLB_NEST_LEVEL")
    1740        .dwattr $C$DW$134, DW_AT_bit_offset(0x17), DW_AT_bit_size(0x09)
    1741        .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1742        .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1743        .dwattr $C$DW$134, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1744        .dwattr $C$DW$134, DW_AT_decl_line(0x5a)
    1745        .dwattr $C$DW$134, DW_AT_decl_column(0x0d)
    1746$C$DW$135       .dwtag  DW_TAG_member
    1747        .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$11)
    1748        .dwattr $C$DW$135, DW_AT_name("rsvd9")
    1749        .dwattr $C$DW$135, DW_AT_TI_symbol_name("rsvd9")
    1750        .dwattr $C$DW$135, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x16)
    1751        .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1752        .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1753        .dwattr $C$DW$135, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1754        .dwattr $C$DW$135, DW_AT_decl_line(0x5b)
    1755        .dwattr $C$DW$135, DW_AT_decl_column(0x0d)
    1756$C$DW$136       .dwtag  DW_TAG_member
    1757        .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$11)
    1758        .dwattr $C$DW$136, DW_AT_name("AUTO_OVERRIDE")
    1759        .dwattr $C$DW$136, DW_AT_TI_symbol_name("AUTO_OVERRIDE")
    1760        .dwattr $C$DW$136, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
PRU Assembler Unix v2.1.4 Sat Apr 14 23:41:47 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
beacon.asm                                                           PAGE   33

    1761        .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1762        .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1763        .dwattr $C$DW$136, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1764        .dwattr $C$DW$136, DW_AT_decl_line(0x5c)
    1765        .dwattr $C$DW$136, DW_AT_decl_column(0x0d)
    1766        .dwendtag $C$DW$T$39
    1767
    1768        .dwattr $C$DW$T$39, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1769        .dwattr $C$DW$T$39, DW_AT_decl_line(0x59)
    1770        .dwattr $C$DW$T$39, DW_AT_decl_column(0x13)
    1771$C$DW$T$140     .dwtag  DW_TAG_volatile_type
    1772        .dwattr $C$DW$T$140, DW_AT_type(*$C$DW$T$39)
    1773
    1774$C$DW$T$40      .dwtag  DW_TAG_structure_type
    1775        .dwattr $C$DW$T$40, DW_AT_byte_size(0x04)
    1776$C$DW$137       .dwtag  DW_TAG_member
    1777        .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$11)
    1778        .dwattr $C$DW$137, DW_AT_name("STS_SET_IDX")
    1779        .dwattr $C$DW$137, DW_AT_TI_symbol_name("STS_SET_IDX")
    1780        .dwattr $C$DW$137, DW_AT_bit_offset(0x16), DW_AT_bit_size(0x0a)
    1781        .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1782        .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1783        .dwattr $C$DW$137, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1784        .dwattr $C$DW$137, DW_AT_decl_line(0x66)
    1785        .dwattr $C$DW$137, DW_AT_decl_column(0x0d)
    1786$C$DW$138       .dwtag  DW_TAG_member
    1787        .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$11)
    1788        .dwattr $C$DW$138, DW_AT_name("rsvd10")
    1789        .dwattr $C$DW$138, DW_AT_TI_symbol_name("rsvd10")
    1790        .dwattr $C$DW$138, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x16)
    1791        .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1792        .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1793        .dwattr $C$DW$138, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1794        .dwattr $C$DW$138, DW_AT_decl_line(0x67)
    1795        .dwattr $C$DW$138, DW_AT_decl_column(0x0d)
    1796        .dwendtag $C$DW$T$40
    1797
    1798        .dwattr $C$DW$T$40, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1799        .dwattr $C$DW$T$40, DW_AT_decl_line(0x65)
    1800        .dwattr $C$DW$T$40, DW_AT_decl_column(0x13)
    1801$C$DW$T$142     .dwtag  DW_TAG_volatile_type
    1802        .dwattr $C$DW$T$142, DW_AT_type(*$C$DW$T$40)
    1803
    1804$C$DW$T$41      .dwtag  DW_TAG_structure_type
    1805        .dwattr $C$DW$T$41, DW_AT_byte_size(0x04)
    1806$C$DW$139       .dwtag  DW_TAG_member
    1807        .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$11)
    1808        .dwattr $C$DW$139, DW_AT_name("STS_CLR_IDX")
    1809        .dwattr $C$DW$139, DW_AT_TI_symbol_name("STS_CLR_IDX")
    1810        .dwattr $C$DW$139, DW_AT_bit_offset(0x16), DW_AT_bit_size(0x0a)
    1811        .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1812        .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1813        .dwattr $C$DW$139, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1814        .dwattr $C$DW$139, DW_AT_decl_line(0x71)
    1815        .dwattr $C$DW$139, DW_AT_decl_column(0x0d)
PRU Assembler Unix v2.1.4 Sat Apr 14 23:41:47 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
beacon.asm                                                           PAGE   34

    1816$C$DW$140       .dwtag  DW_TAG_member
    1817        .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$11)
    1818        .dwattr $C$DW$140, DW_AT_name("rsvd10")
    1819        .dwattr $C$DW$140, DW_AT_TI_symbol_name("rsvd10")
    1820        .dwattr $C$DW$140, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x16)
    1821        .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1822        .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1823        .dwattr $C$DW$140, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1824        .dwattr $C$DW$140, DW_AT_decl_line(0x72)
    1825        .dwattr $C$DW$140, DW_AT_decl_column(0x0d)
    1826        .dwendtag $C$DW$T$41
    1827
    1828        .dwattr $C$DW$T$41, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1829        .dwattr $C$DW$T$41, DW_AT_decl_line(0x70)
    1830        .dwattr $C$DW$T$41, DW_AT_decl_column(0x13)
    1831$C$DW$T$144     .dwtag  DW_TAG_volatile_type
    1832        .dwattr $C$DW$T$144, DW_AT_type(*$C$DW$T$41)
    1833
    1834$C$DW$T$42      .dwtag  DW_TAG_structure_type
    1835        .dwattr $C$DW$T$42, DW_AT_byte_size(0x04)
    1836$C$DW$141       .dwtag  DW_TAG_member
    1837        .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$11)
