PRU Assembler Unix v2.1.4 Sun Apr 15 00:36:12 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
beacon.asm                                                           PAGE    1

       1;******************************************************************************
       2;* PRU C/C++ Codegen                                              Unix v2.1.4 *
       3;* Date/Time created: Sun Apr 15 00:36:12 2018                                *
       4;******************************************************************************
       5        .compiler_opts --abi=eabi --endian=little --hll_source=on --object_format=elf --silicon_versio
       6
       7$C$DW$CU        .dwtag  DW_TAG_compile_unit
       8        .dwattr $C$DW$CU, DW_AT_name("beacon.c")
       9        .dwattr $C$DW$CU, DW_AT_producer("TI PRU C/C++ Codegen Unix v2.1.4 Copyright (c) 2012-2015 Tex
      10        .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      11        .dwattr $C$DW$CU, DW_AT_comp_dir("/var/lib/cloud9/pru_beacon")
      12        .global __PRU_CREG_PRU_CFG
      13        .global __PRU_CREG_PRU_INTC
      14
      15$C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("__delay_cycles")
      16        .dwattr $C$DW$1, DW_AT_TI_symbol_name("__delay_cycles")
      17        .dwattr $C$DW$1, DW_AT_declaration
      18        .dwattr $C$DW$1, DW_AT_external
      19$C$DW$2 .dwtag  DW_TAG_formal_parameter
      20        .dwattr $C$DW$2, DW_AT_type(*$C$DW$T$11)
      21        .dwendtag $C$DW$1

     985        .dwattr $C$DW$64, DW_AT_low_pc(0x00)
     986        .dwattr $C$DW$64, DW_AT_name("parseCode")
     987        .dwattr $C$DW$64, DW_AT_TI_call
     988 0000014c 000000230000C3!         JAL       r3.w2, ||parseCode||  ; [ALU_PRU] |189| parseCode
     989        .dwpsn  file "beacon.c",line 190,column 6,is_stmt,isa 0
     990;----------------------------------------------------------------------
PRU Assembler Unix v2.1.4 Sun Apr 15 00:36:12 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
beacon.asm                                                           PAGE   19

     991; 190 | signal = 0x4080 | (code << 9) | (code << 1);                           
     992; 192 | } else{                                                                
     993;----------------------------------------------------------------------
     994 00000150 0000000908EEE0          LSL       r0, r14, 0x08         ; [ALU_PRU] |190| code
     995 00000154 00000012EEE0E0          OR        r0, r0, r14           ; [ALU_PRU] |190| code
     996 00000158 0000000901E0E1          LSL       r1, r0, 0x01          ; [ALU_PRU] |190| 
     997 0000015c 000000244080E0          LDI       r0, 0x4080            ; [ALU_PRU] |190| 
     998 00000160 00000012E0E1E6          OR        r6, r1, r0            ; [ALU_PRU] |190| signal
     999 00000164 00000021000000!         JMP       ||$C$L18||            ; [ALU_PRU] |190| 
    1000;* --------------------------------------------------------------------------*
    1001 00000168                 ||$C$L17||:    
    1002        .dwpsn  file "beacon.c",line 193,column 6,is_stmt,isa 0
    1003;----------------------------------------------------------------------
    1004; 193 | CT_INTC.SICR_bit.STS_CLR_IDX = FROM_ARM_HOST;                          
    1005;----------------------------------------------------------------------
    1006 00000168 FC008024FFFFC0          LDI32     r0, 0xfffffc00        ; [ALU_PRU] |193| 
    1007 00000170 000000F1002481          LBBO      &r1, r4, 0, 4         ; [ALU_PRU] |193| $O$K6
    1008 00000174 00000010E0E1E0          AND       r0, r1, r0            ; [ALU_PRU] |193| 
    1009 00000178 0000001311E0E0          OR        r0, r0, 0x11          ; [ALU_PRU] |193| 
    1010 0000017c 000000E1002480          SBBO      &r0, r4, 0, 4         ; [ALU_PRU] |193| $O$K6
    1011;* --------------------------------------------------------------------------*
    1012 00000180                 ||$C$L18||:    
    1013        .dwpsn  file "beacon.c",line 199,column 6,is_stmt,isa 0
    1014;----------------------------------------------------------------------
    1015; 199 | __delay_cycles(200000000);                                             
    1016;----------------------------------------------------------------------
    1017        .newblock
    1018 00000180 E0FF802405F5C0          LDI32    r0, 99999999
    1019 00000188 0000000501E0E0  $1:     SUB      r0, r0, 1
    1020 0000018c 0000006F00E0FF          QBNE     $1, r0, 0             ; [ALU_PRU] |199| 
    1021        .dwpsn  file "beacon.c",line 178,column 11,is_stmt,isa 0
    1022 00000190 00000021000000!         JMP       ||$C$L16||            ; [ALU_PRU] |178| 
    1023;* --------------------------------------------------------------------------*
    1024        .dwattr $C$DW$48, DW_AT_TI_end_file("beacon.c")
    1025        .dwattr $C$DW$48, DW_AT_TI_end_line(0xca)
    1026        .dwattr $C$DW$48, DW_AT_TI_end_column(0x01)
    1027        .dwendentry
    1028        .dwendtag $C$DW$48
    1029
    1030;******************************************************************************
    1031;* STRINGS                                                                    *
    1032;******************************************************************************
    1033 00000000                         .sect   ".rodata:.string"
    1034 00000000 00000000000072  ||$C$SL1||:     .string "rpmsg-pru",0
         00000001 00000000000070 
         00000002 0000000000006D 
         00000003 00000000000073 
         00000004 00000000000067 
         00000005 0000000000002D 
         00000006 00000000000070 
         00000007 00000000000072 
         00000008 00000000000075 
         00000009 00000000000000 
    1035 0000000a 00000000000043  ||$C$SL2||:     .string "Channel 30",0
         0000000b 00000000000068 
PRU Assembler Unix v2.1.4 Sun Apr 15 00:36:12 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
beacon.asm                                                           PAGE   20

         0000000c 00000000000061 
         0000000d 0000000000006E 
         0000000e 0000000000006E 
         0000000f 00000000000065 
         00000010 0000000000006C 
         00000011 00000000000020 
         00000012 00000000000033 
         00000013 00000000000030 
         00000014 00000000000000 
    1036;*****************************************************************************
    1037;* UNDEFINED EXTERNAL REFERENCES                                             *
    1038;*****************************************************************************
    1039        .global ||pru_rpmsg_init||
    1040        .global ||pru_rpmsg_receive||
    1041        .global ||pru_rpmsg_channel||
    1042
    1043;******************************************************************************
    1044;* TYPE INFORMATION                                                           *
    1045;******************************************************************************
    1046
    1047$C$DW$T$19      .dwtag  DW_TAG_structure_type
    1048        .dwattr $C$DW$T$19, DW_AT_byte_size(0x04)
    1049$C$DW$65        .dwtag  DW_TAG_member
    1050        .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$11)
    1051        .dwattr $C$DW$65, DW_AT_name("REVID")
    1052        .dwattr $C$DW$65, DW_AT_TI_symbol_name("REVID")
    1053        .dwattr $C$DW$65, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x20)
    1054        .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1055        .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
    1056        .dwattr $C$DW$65, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1057        .dwattr $C$DW$65, DW_AT_decl_line(0x2d)
    1058        .dwattr $C$DW$65, DW_AT_decl_column(0x0d)
    1059        .dwendtag $C$DW$T$19
    1060
    1061        .dwattr $C$DW$T$19, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1062        .dwattr $C$DW$T$19, DW_AT_decl_line(0x2c)
    1063        .dwattr $C$DW$T$19, DW_AT_decl_column(0x13)
    1064$C$DW$T$108     .dwtag  DW_TAG_volatile_type
    1065        .dwattr $C$DW$T$108, DW_AT_type(*$C$DW$T$19)
    1066
    1067$C$DW$T$20      .dwtag  DW_TAG_structure_type
    1068        .dwattr $C$DW$T$20, DW_AT_byte_size(0x04)
    1069$C$DW$66        .dwtag  DW_TAG_member
    1070        .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$11)
    1071        .dwattr $C$DW$66, DW_AT_name("IDLE_MODE")
    1072        .dwattr $C$DW$66, DW_AT_TI_symbol_name("IDLE_MODE")
    1073        .dwattr $C$DW$66, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x02)
    1074        .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1075        .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
    1076        .dwattr $C$DW$66, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1077        .dwattr $C$DW$66, DW_AT_decl_line(0x37)
    1078        .dwattr $C$DW$66, DW_AT_decl_column(0x0d)
    1079$C$DW$67        .dwtag  DW_TAG_member
    1080        .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$11)
    1081        .dwattr $C$DW$67, DW_AT_name("STANDBY_MODE")
PRU Assembler Unix v2.1.4 Sun Apr 15 00:36:12 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
beacon.asm                                                           PAGE   21

    1082        .dwattr $C$DW$67, DW_AT_TI_symbol_name("STANDBY_MODE")
    1083        .dwattr $C$DW$67, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x02)
    1084        .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1085        .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
    1086        .dwattr $C$DW$67, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1087        .dwattr $C$DW$67, DW_AT_decl_line(0x38)
    1088        .dwattr $C$DW$67, DW_AT_decl_column(0x0d)
    1089$C$DW$68        .dwtag  DW_TAG_member
    1090        .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$11)
    1091        .dwattr $C$DW$68, DW_AT_name("STANDBY_INIT")
    1092        .dwattr $C$DW$68, DW_AT_TI_symbol_name("STANDBY_INIT")
    1093        .dwattr $C$DW$68, DW_AT_bit_offset(0x1b), DW_AT_bit_size(0x01)
    1094        .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1095        .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
    1096        .dwattr $C$DW$68, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1097        .dwattr $C$DW$68, DW_AT_decl_line(0x39)
    1098        .dwattr $C$DW$68, DW_AT_decl_column(0x0d)
    1099$C$DW$69        .dwtag  DW_TAG_member
    1100        .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$11)
    1101        .dwattr $C$DW$69, DW_AT_name("SUB_MWAIT")
    1102        .dwattr $C$DW$69, DW_AT_TI_symbol_name("SUB_MWAIT")
    1103        .dwattr $C$DW$69, DW_AT_bit_offset(0x1a), DW_AT_bit_size(0x01)
    1104        .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1105        .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
    1106        .dwattr $C$DW$69, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1107        .dwattr $C$DW$69, DW_AT_decl_line(0x3a)
    1108        .dwattr $C$DW$69, DW_AT_decl_column(0x0d)
    1109$C$DW$70        .dwtag  DW_TAG_member
    1110        .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$11)
    1111        .dwattr $C$DW$70, DW_AT_name("rsvd6")
    1112        .dwattr $C$DW$70, DW_AT_TI_symbol_name("rsvd6")
    1113        .dwattr $C$DW$70, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1a)
    1114        .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1115        .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
    1116        .dwattr $C$DW$70, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1117        .dwattr $C$DW$70, DW_AT_decl_line(0x3b)
    1118        .dwattr $C$DW$70, DW_AT_decl_column(0x0d)
    1119        .dwendtag $C$DW$T$20
    1120
    1121        .dwattr $C$DW$T$20, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1122        .dwattr $C$DW$T$20, DW_AT_decl_line(0x36)
    1123        .dwattr $C$DW$T$20, DW_AT_decl_column(0x13)
    1124$C$DW$T$110     .dwtag  DW_TAG_volatile_type
    1125        .dwattr $C$DW$T$110, DW_AT_type(*$C$DW$T$20)
    1126
    1127$C$DW$T$21      .dwtag  DW_TAG_structure_type
    1128        .dwattr $C$DW$T$21, DW_AT_byte_size(0x04)
    1129$C$DW$71        .dwtag  DW_TAG_member
    1130        .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$11)
    1131        .dwattr $C$DW$71, DW_AT_name("PRU0_GPI_MODE")
    1132        .dwattr $C$DW$71, DW_AT_TI_symbol_name("PRU0_GPI_MODE")
    1133        .dwattr $C$DW$71, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x02)
    1134        .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1135        .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
    1136        .dwattr $C$DW$71, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
PRU Assembler Unix v2.1.4 Sun Apr 15 00:36:12 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
beacon.asm                                                           PAGE   22

    1137        .dwattr $C$DW$71, DW_AT_decl_line(0x45)
    1138        .dwattr $C$DW$71, DW_AT_decl_column(0x0d)
    1139$C$DW$72        .dwtag  DW_TAG_member
    1140        .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$11)
    1141        .dwattr $C$DW$72, DW_AT_name("PRU0_GPI_CLK_MODE")
    1142        .dwattr $C$DW$72, DW_AT_TI_symbol_name("PRU0_GPI_CLK_MODE")
    1143        .dwattr $C$DW$72, DW_AT_bit_offset(0x1d), DW_AT_bit_size(0x01)
    1144        .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1145        .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
    1146        .dwattr $C$DW$72, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1147        .dwattr $C$DW$72, DW_AT_decl_line(0x46)
    1148        .dwattr $C$DW$72, DW_AT_decl_column(0x0d)
    1149$C$DW$73        .dwtag  DW_TAG_member
    1150        .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$11)
    1151        .dwattr $C$DW$73, DW_AT_name("PRU0_GPI_DIV0")
    1152        .dwattr $C$DW$73, DW_AT_TI_symbol_name("PRU0_GPI_DIV0")
    1153        .dwattr $C$DW$73, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x05)
    1154        .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1155        .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
    1156        .dwattr $C$DW$73, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1157        .dwattr $C$DW$73, DW_AT_decl_line(0x47)
    1158        .dwattr $C$DW$73, DW_AT_decl_column(0x0d)
    1159$C$DW$74        .dwtag  DW_TAG_member
    1160        .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$11)
    1161        .dwattr $C$DW$74, DW_AT_name("PRU0_GPI_DIV1")
    1162        .dwattr $C$DW$74, DW_AT_TI_symbol_name("PRU0_GPI_DIV1")
    1163        .dwattr $C$DW$74, DW_AT_bit_offset(0x13), DW_AT_bit_size(0x05)
    1164        .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1165        .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
    1166        .dwattr $C$DW$74, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1167        .dwattr $C$DW$74, DW_AT_decl_line(0x48)
    1168        .dwattr $C$DW$74, DW_AT_decl_column(0x0d)
    1169$C$DW$75        .dwtag  DW_TAG_member
    1170        .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$11)
    1171        .dwattr $C$DW$75, DW_AT_name("PRU0_GPI_SB")
    1172        .dwattr $C$DW$75, DW_AT_TI_symbol_name("PRU0_GPI_SB")
    1173        .dwattr $C$DW$75, DW_AT_bit_offset(0x12), DW_AT_bit_size(0x01)
    1174        .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1175        .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
    1176        .dwattr $C$DW$75, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1177        .dwattr $C$DW$75, DW_AT_decl_line(0x49)
    1178        .dwattr $C$DW$75, DW_AT_decl_column(0x0d)
    1179$C$DW$76        .dwtag  DW_TAG_member
    1180        .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$11)
    1181        .dwattr $C$DW$76, DW_AT_name("PRU0_GPO_MODE")
    1182        .dwattr $C$DW$76, DW_AT_TI_symbol_name("PRU0_GPO_MODE")
    1183        .dwattr $C$DW$76, DW_AT_bit_offset(0x11), DW_AT_bit_size(0x01)
    1184        .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1185        .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    1186        .dwattr $C$DW$76, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1187        .dwattr $C$DW$76, DW_AT_decl_line(0x4a)
    1188        .dwattr $C$DW$76, DW_AT_decl_column(0x0d)
    1189$C$DW$77        .dwtag  DW_TAG_member
    1190        .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$11)
    1191        .dwattr $C$DW$77, DW_AT_name("PRU0_GPO_DIV0")
PRU Assembler Unix v2.1.4 Sun Apr 15 00:36:12 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
beacon.asm                                                           PAGE   23

    1192        .dwattr $C$DW$77, DW_AT_TI_symbol_name("PRU0_GPO_DIV0")
    1193        .dwattr $C$DW$77, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x05)
    1194        .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1195        .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1196        .dwattr $C$DW$77, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1197        .dwattr $C$DW$77, DW_AT_decl_line(0x4b)
    1198        .dwattr $C$DW$77, DW_AT_decl_column(0x0d)
    1199$C$DW$78        .dwtag  DW_TAG_member
    1200        .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$11)
    1201        .dwattr $C$DW$78, DW_AT_name("PRU0_GPO_DIV1")
    1202        .dwattr $C$DW$78, DW_AT_TI_symbol_name("PRU0_GPO_DIV1")
    1203        .dwattr $C$DW$78, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x05)
    1204        .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1205        .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1206        .dwattr $C$DW$78, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1207        .dwattr $C$DW$78, DW_AT_decl_line(0x4c)
    1208        .dwattr $C$DW$78, DW_AT_decl_column(0x0d)
    1209$C$DW$79        .dwtag  DW_TAG_member
    1210        .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$11)
    1211        .dwattr $C$DW$79, DW_AT_name("PRU0_GPO_SH_SEL")
    1212        .dwattr $C$DW$79, DW_AT_TI_symbol_name("PRU0_GPO_SH_SEL")
    1213        .dwattr $C$DW$79, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1214        .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1215        .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1216        .dwattr $C$DW$79, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1217        .dwattr $C$DW$79, DW_AT_decl_line(0x4d)
    1218        .dwattr $C$DW$79, DW_AT_decl_column(0x0d)
    1219$C$DW$80        .dwtag  DW_TAG_member
    1220        .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$11)
    1221        .dwattr $C$DW$80, DW_AT_name("rsvd26")
    1222        .dwattr $C$DW$80, DW_AT_TI_symbol_name("rsvd26")
    1223        .dwattr $C$DW$80, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x06)
    1224        .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1225        .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1226        .dwattr $C$DW$80, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1227        .dwattr $C$DW$80, DW_AT_decl_line(0x4e)
    1228        .dwattr $C$DW$80, DW_AT_decl_column(0x0d)
    1229        .dwendtag $C$DW$T$21
    1230
    1231        .dwattr $C$DW$T$21, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1232        .dwattr $C$DW$T$21, DW_AT_decl_line(0x44)
    1233        .dwattr $C$DW$T$21, DW_AT_decl_column(0x13)
    1234$C$DW$T$112     .dwtag  DW_TAG_volatile_type
    1235        .dwattr $C$DW$T$112, DW_AT_type(*$C$DW$T$21)
    1236
    1237$C$DW$T$22      .dwtag  DW_TAG_structure_type
    1238        .dwattr $C$DW$T$22, DW_AT_byte_size(0x04)
    1239$C$DW$81        .dwtag  DW_TAG_member
    1240        .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$11)
    1241        .dwattr $C$DW$81, DW_AT_name("PRU1_GPI_MODE")
    1242        .dwattr $C$DW$81, DW_AT_TI_symbol_name("PRU1_GPI_MODE")
    1243        .dwattr $C$DW$81, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x02)
    1244        .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1245        .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1246        .dwattr $C$DW$81, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
PRU Assembler Unix v2.1.4 Sun Apr 15 00:36:12 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
beacon.asm                                                           PAGE   24

    1247        .dwattr $C$DW$81, DW_AT_decl_line(0x58)
    1248        .dwattr $C$DW$81, DW_AT_decl_column(0x0d)
    1249$C$DW$82        .dwtag  DW_TAG_member
    1250        .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$11)
    1251        .dwattr $C$DW$82, DW_AT_name("PRU1_GPI_CLK_MODE")
    1252        .dwattr $C$DW$82, DW_AT_TI_symbol_name("PRU1_GPI_CLK_MODE")
    1253        .dwattr $C$DW$82, DW_AT_bit_offset(0x1d), DW_AT_bit_size(0x01)
    1254        .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1255        .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1256        .dwattr $C$DW$82, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1257        .dwattr $C$DW$82, DW_AT_decl_line(0x59)
    1258        .dwattr $C$DW$82, DW_AT_decl_column(0x0d)
    1259$C$DW$83        .dwtag  DW_TAG_member
    1260        .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$11)
    1261        .dwattr $C$DW$83, DW_AT_name("PRU1_GPI_DIV0")
    1262        .dwattr $C$DW$83, DW_AT_TI_symbol_name("PRU1_GPI_DIV0")
    1263        .dwattr $C$DW$83, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x05)
    1264        .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1265        .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1266        .dwattr $C$DW$83, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1267        .dwattr $C$DW$83, DW_AT_decl_line(0x5a)
    1268        .dwattr $C$DW$83, DW_AT_decl_column(0x0d)
    1269$C$DW$84        .dwtag  DW_TAG_member
    1270        .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$11)
    1271        .dwattr $C$DW$84, DW_AT_name("PRU1_GPI_DIV1")
    1272        .dwattr $C$DW$84, DW_AT_TI_symbol_name("PRU1_GPI_DIV1")
    1273        .dwattr $C$DW$84, DW_AT_bit_offset(0x13), DW_AT_bit_size(0x05)
    1274        .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1275        .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1276        .dwattr $C$DW$84, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1277        .dwattr $C$DW$84, DW_AT_decl_line(0x5b)
    1278        .dwattr $C$DW$84, DW_AT_decl_column(0x0d)
    1279$C$DW$85        .dwtag  DW_TAG_member
    1280        .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$11)
    1281        .dwattr $C$DW$85, DW_AT_name("PRU1_GPI_SB")
    1282        .dwattr $C$DW$85, DW_AT_TI_symbol_name("PRU1_GPI_SB")
    1283        .dwattr $C$DW$85, DW_AT_bit_offset(0x12), DW_AT_bit_size(0x01)
    1284        .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1285        .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1286        .dwattr $C$DW$85, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1287        .dwattr $C$DW$85, DW_AT_decl_line(0x5c)
    1288        .dwattr $C$DW$85, DW_AT_decl_column(0x0d)
    1289$C$DW$86        .dwtag  DW_TAG_member
    1290        .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$11)
    1291        .dwattr $C$DW$86, DW_AT_name("PRU1_GPO_MODE")
    1292        .dwattr $C$DW$86, DW_AT_TI_symbol_name("PRU1_GPO_MODE")
    1293        .dwattr $C$DW$86, DW_AT_bit_offset(0x11), DW_AT_bit_size(0x01)
    1294        .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1295        .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1296        .dwattr $C$DW$86, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1297        .dwattr $C$DW$86, DW_AT_decl_line(0x5d)
    1298        .dwattr $C$DW$86, DW_AT_decl_column(0x0d)
    1299$C$DW$87        .dwtag  DW_TAG_member
    1300        .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$11)
    1301        .dwattr $C$DW$87, DW_AT_name("PRU1_GPO_DIV0")
PRU Assembler Unix v2.1.4 Sun Apr 15 00:36:12 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
beacon.asm                                                           PAGE   25

    1302        .dwattr $C$DW$87, DW_AT_TI_symbol_name("PRU1_GPO_DIV0")
    1303        .dwattr $C$DW$87, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x05)
    1304        .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1305        .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1306        .dwattr $C$DW$87, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1307        .dwattr $C$DW$87, DW_AT_decl_line(0x5e)
    1308        .dwattr $C$DW$87, DW_AT_decl_column(0x0d)
    1309$C$DW$88        .dwtag  DW_TAG_member
    1310        .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$11)
    1311        .dwattr $C$DW$88, DW_AT_name("PRU1_GPO_DIV1")
    1312        .dwattr $C$DW$88, DW_AT_TI_symbol_name("PRU1_GPO_DIV1")
    1313        .dwattr $C$DW$88, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x05)
    1314        .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1315        .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1316        .dwattr $C$DW$88, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1317        .dwattr $C$DW$88, DW_AT_decl_line(0x5f)
    1318        .dwattr $C$DW$88, DW_AT_decl_column(0x0d)
    1319$C$DW$89        .dwtag  DW_TAG_member
    1320        .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$11)
    1321        .dwattr $C$DW$89, DW_AT_name("PRU1_GPO_SH_SEL")
    1322        .dwattr $C$DW$89, DW_AT_TI_symbol_name("PRU1_GPO_SH_SEL")
    1323        .dwattr $C$DW$89, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1324        .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1325        .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1326        .dwattr $C$DW$89, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1327        .dwattr $C$DW$89, DW_AT_decl_line(0x60)
    1328        .dwattr $C$DW$89, DW_AT_decl_column(0x0d)
    1329$C$DW$90        .dwtag  DW_TAG_member
    1330        .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$11)
    1331        .dwattr $C$DW$90, DW_AT_name("rsvd26")
    1332        .dwattr $C$DW$90, DW_AT_TI_symbol_name("rsvd26")
    1333        .dwattr $C$DW$90, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x06)
    1334        .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1335        .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1336        .dwattr $C$DW$90, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1337        .dwattr $C$DW$90, DW_AT_decl_line(0x61)
    1338        .dwattr $C$DW$90, DW_AT_decl_column(0x0d)
    1339        .dwendtag $C$DW$T$22
    1340
    1341        .dwattr $C$DW$T$22, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1342        .dwattr $C$DW$T$22, DW_AT_decl_line(0x57)
    1343        .dwattr $C$DW$T$22, DW_AT_decl_column(0x13)
    1344$C$DW$T$114     .dwtag  DW_TAG_volatile_type
    1345        .dwattr $C$DW$T$114, DW_AT_type(*$C$DW$T$22)
    1346
    1347$C$DW$T$23      .dwtag  DW_TAG_structure_type
    1348        .dwattr $C$DW$T$23, DW_AT_byte_size(0x04)
    1349$C$DW$91        .dwtag  DW_TAG_member
    1350        .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$11)
    1351        .dwattr $C$DW$91, DW_AT_name("PRU0_CLK_STOP_REQ")
    1352        .dwattr $C$DW$91, DW_AT_TI_symbol_name("PRU0_CLK_STOP_REQ")
    1353        .dwattr $C$DW$91, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
    1354        .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1355        .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1356        .dwattr $C$DW$91, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
PRU Assembler Unix v2.1.4 Sun Apr 15 00:36:12 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
beacon.asm                                                           PAGE   26

    1357        .dwattr $C$DW$91, DW_AT_decl_line(0x6b)
    1358        .dwattr $C$DW$91, DW_AT_decl_column(0x0d)
    1359$C$DW$92        .dwtag  DW_TAG_member
    1360        .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$11)
    1361        .dwattr $C$DW$92, DW_AT_name("PRU0_CLK_STOP_ACK")
    1362        .dwattr $C$DW$92, DW_AT_TI_symbol_name("PRU0_CLK_STOP_ACK")
    1363        .dwattr $C$DW$92, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x01)
    1364        .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1365        .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1366        .dwattr $C$DW$92, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1367        .dwattr $C$DW$92, DW_AT_decl_line(0x6c)
    1368        .dwattr $C$DW$92, DW_AT_decl_column(0x0d)
    1369$C$DW$93        .dwtag  DW_TAG_member
    1370        .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$11)
    1371        .dwattr $C$DW$93, DW_AT_name("PRU0_CLK_EN")
    1372        .dwattr $C$DW$93, DW_AT_TI_symbol_name("PRU0_CLK_EN")
    1373        .dwattr $C$DW$93, DW_AT_bit_offset(0x1d), DW_AT_bit_size(0x01)
    1374        .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1375        .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1376        .dwattr $C$DW$93, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1377        .dwattr $C$DW$93, DW_AT_decl_line(0x6d)
    1378        .dwattr $C$DW$93, DW_AT_decl_column(0x0d)
    1379$C$DW$94        .dwtag  DW_TAG_member
    1380        .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$11)
    1381        .dwattr $C$DW$94, DW_AT_name("PRU1_CLK_STOP_REQ")
    1382        .dwattr $C$DW$94, DW_AT_TI_symbol_name("PRU1_CLK_STOP_REQ")
    1383        .dwattr $C$DW$94, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x01)
    1384        .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1385        .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1386        .dwattr $C$DW$94, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1387        .dwattr $C$DW$94, DW_AT_decl_line(0x6e)
    1388        .dwattr $C$DW$94, DW_AT_decl_column(0x0d)
    1389$C$DW$95        .dwtag  DW_TAG_member
    1390        .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$11)
    1391        .dwattr $C$DW$95, DW_AT_name("PRU1_CLK_STOP_ACK")
    1392        .dwattr $C$DW$95, DW_AT_TI_symbol_name("PRU1_CLK_STOP_ACK")
    1393        .dwattr $C$DW$95, DW_AT_bit_offset(0x1b), DW_AT_bit_size(0x01)
    1394        .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1395        .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1396        .dwattr $C$DW$95, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1397        .dwattr $C$DW$95, DW_AT_decl_line(0x6f)
    1398        .dwattr $C$DW$95, DW_AT_decl_column(0x0d)
    1399$C$DW$96        .dwtag  DW_TAG_member
    1400        .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$11)
    1401        .dwattr $C$DW$96, DW_AT_name("PRU1_CLK_EN")
    1402        .dwattr $C$DW$96, DW_AT_TI_symbol_name("PRU1_CLK_EN")
    1403        .dwattr $C$DW$96, DW_AT_bit_offset(0x1a), DW_AT_bit_size(0x01)
    1404        .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1405        .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1406        .dwattr $C$DW$96, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1407        .dwattr $C$DW$96, DW_AT_decl_line(0x70)
    1408        .dwattr $C$DW$96, DW_AT_decl_column(0x0d)
    1409$C$DW$97        .dwtag  DW_TAG_member
    1410        .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$11)
    1411        .dwattr $C$DW$97, DW_AT_name("INTC_CLK_STOP_REQ")
PRU Assembler Unix v2.1.4 Sun Apr 15 00:36:12 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
beacon.asm                                                           PAGE   27

    1412        .dwattr $C$DW$97, DW_AT_TI_symbol_name("INTC_CLK_STOP_REQ")
    1413        .dwattr $C$DW$97, DW_AT_bit_offset(0x19), DW_AT_bit_size(0x01)
    1414        .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1415        .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1416        .dwattr $C$DW$97, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1417        .dwattr $C$DW$97, DW_AT_decl_line(0x71)
    1418        .dwattr $C$DW$97, DW_AT_decl_column(0x0d)
    1419$C$DW$98        .dwtag  DW_TAG_member
    1420        .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$11)
    1421        .dwattr $C$DW$98, DW_AT_name("INTC_CLK_STOP_ACK")
    1422        .dwattr $C$DW$98, DW_AT_TI_symbol_name("INTC_CLK_STOP_ACK")
    1423        .dwattr $C$DW$98, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x01)
    1424        .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1425        .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1426        .dwattr $C$DW$98, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1427        .dwattr $C$DW$98, DW_AT_decl_line(0x72)
    1428        .dwattr $C$DW$98, DW_AT_decl_column(0x0d)
    1429$C$DW$99        .dwtag  DW_TAG_member
    1430        .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$11)
    1431        .dwattr $C$DW$99, DW_AT_name("INTC_CLK_EN")
    1432        .dwattr $C$DW$99, DW_AT_TI_symbol_name("INTC_CLK_EN")
    1433        .dwattr $C$DW$99, DW_AT_bit_offset(0x17), DW_AT_bit_size(0x01)
    1434        .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1435        .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1436        .dwattr $C$DW$99, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1437        .dwattr $C$DW$99, DW_AT_decl_line(0x73)
    1438        .dwattr $C$DW$99, DW_AT_decl_column(0x0d)
    1439$C$DW$100       .dwtag  DW_TAG_member
    1440        .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$11)
    1441        .dwattr $C$DW$100, DW_AT_name("UART_CLK_STOP_REQ")
    1442        .dwattr $C$DW$100, DW_AT_TI_symbol_name("UART_CLK_STOP_REQ")
    1443        .dwattr $C$DW$100, DW_AT_bit_offset(0x16), DW_AT_bit_size(0x01)
    1444        .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1445        .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1446        .dwattr $C$DW$100, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1447        .dwattr $C$DW$100, DW_AT_decl_line(0x74)
    1448        .dwattr $C$DW$100, DW_AT_decl_column(0x0d)
    1449$C$DW$101       .dwtag  DW_TAG_member
    1450        .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$11)
    1451        .dwattr $C$DW$101, DW_AT_name("UART_CLK_STOP_ACK")
    1452        .dwattr $C$DW$101, DW_AT_TI_symbol_name("UART_CLK_STOP_ACK")
    1453        .dwattr $C$DW$101, DW_AT_bit_offset(0x15), DW_AT_bit_size(0x01)
    1454        .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1455        .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1456        .dwattr $C$DW$101, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1457        .dwattr $C$DW$101, DW_AT_decl_line(0x75)
    1458        .dwattr $C$DW$101, DW_AT_decl_column(0x0d)
    1459$C$DW$102       .dwtag  DW_TAG_member
    1460        .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$11)
    1461        .dwattr $C$DW$102, DW_AT_name("UART_CLK_EN")
    1462        .dwattr $C$DW$102, DW_AT_TI_symbol_name("UART_CLK_EN")
    1463        .dwattr $C$DW$102, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x01)
    1464        .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1465        .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1466        .dwattr $C$DW$102, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
PRU Assembler Unix v2.1.4 Sun Apr 15 00:36:12 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
beacon.asm                                                           PAGE   28

    1467        .dwattr $C$DW$102, DW_AT_decl_line(0x76)
    1468        .dwattr $C$DW$102, DW_AT_decl_column(0x0d)
    1469$C$DW$103       .dwtag  DW_TAG_member
    1470        .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$11)
    1471        .dwattr $C$DW$103, DW_AT_name("ECAP_CLK_STOP_REQ")
    1472        .dwattr $C$DW$103, DW_AT_TI_symbol_name("ECAP_CLK_STOP_REQ")
    1473        .dwattr $C$DW$103, DW_AT_bit_offset(0x13), DW_AT_bit_size(0x01)
    1474        .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1475        .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1476        .dwattr $C$DW$103, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1477        .dwattr $C$DW$103, DW_AT_decl_line(0x77)
    1478        .dwattr $C$DW$103, DW_AT_decl_column(0x0d)
    1479$C$DW$104       .dwtag  DW_TAG_member
    1480        .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$11)
    1481        .dwattr $C$DW$104, DW_AT_name("ECAP_CLK_STOP_ACK")
    1482        .dwattr $C$DW$104, DW_AT_TI_symbol_name("ECAP_CLK_STOP_ACK")
    1483        .dwattr $C$DW$104, DW_AT_bit_offset(0x12), DW_AT_bit_size(0x01)
    1484        .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1485        .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1486        .dwattr $C$DW$104, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1487        .dwattr $C$DW$104, DW_AT_decl_line(0x78)
    1488        .dwattr $C$DW$104, DW_AT_decl_column(0x0d)
    1489$C$DW$105       .dwtag  DW_TAG_member
    1490        .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$11)
    1491        .dwattr $C$DW$105, DW_AT_name("ECAP_CLK_EN")
    1492        .dwattr $C$DW$105, DW_AT_TI_symbol_name("ECAP_CLK_EN")
    1493        .dwattr $C$DW$105, DW_AT_bit_offset(0x11), DW_AT_bit_size(0x01)
    1494        .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1495        .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1496        .dwattr $C$DW$105, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1497        .dwattr $C$DW$105, DW_AT_decl_line(0x79)
    1498        .dwattr $C$DW$105, DW_AT_decl_column(0x0d)
    1499$C$DW$106       .dwtag  DW_TAG_member
    1500        .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$11)
    1501        .dwattr $C$DW$106, DW_AT_name("IEP_CLK_STOP_REQ")
    1502        .dwattr $C$DW$106, DW_AT_TI_symbol_name("IEP_CLK_STOP_REQ")
    1503        .dwattr $C$DW$106, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x01)
    1504        .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1505        .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1506        .dwattr $C$DW$106, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1507        .dwattr $C$DW$106, DW_AT_decl_line(0x7a)
    1508        .dwattr $C$DW$106, DW_AT_decl_column(0x0d)
    1509$C$DW$107       .dwtag  DW_TAG_member
    1510        .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$11)
    1511        .dwattr $C$DW$107, DW_AT_name("IEP_CLK_STOP_ACK")
    1512        .dwattr $C$DW$107, DW_AT_TI_symbol_name("IEP_CLK_STOP_ACK")
    1513        .dwattr $C$DW$107, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1514        .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1515        .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1516        .dwattr $C$DW$107, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1517        .dwattr $C$DW$107, DW_AT_decl_line(0x7b)
    1518        .dwattr $C$DW$107, DW_AT_decl_column(0x0d)
    1519$C$DW$108       .dwtag  DW_TAG_member
    1520        .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$11)
    1521        .dwattr $C$DW$108, DW_AT_name("IEP_CLK_EN")
PRU Assembler Unix v2.1.4 Sun Apr 15 00:36:12 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
beacon.asm                                                           PAGE   29

    1522        .dwattr $C$DW$108, DW_AT_TI_symbol_name("IEP_CLK_EN")
    1523        .dwattr $C$DW$108, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1524        .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1525        .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1526        .dwattr $C$DW$108, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1527        .dwattr $C$DW$108, DW_AT_decl_line(0x7c)
    1528        .dwattr $C$DW$108, DW_AT_decl_column(0x0d)
    1529$C$DW$109       .dwtag  DW_TAG_member
    1530        .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$11)
    1531        .dwattr $C$DW$109, DW_AT_name("rsvd18")
    1532        .dwattr $C$DW$109, DW_AT_TI_symbol_name("rsvd18")
    1533        .dwattr $C$DW$109, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0e)
    1534        .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1535        .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1536        .dwattr $C$DW$109, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1537        .dwattr $C$DW$109, DW_AT_decl_line(0x7d)
    1538        .dwattr $C$DW$109, DW_AT_decl_column(0x0d)
    1539        .dwendtag $C$DW$T$23
    1540
    1541        .dwattr $C$DW$T$23, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1542        .dwattr $C$DW$T$23, DW_AT_decl_line(0x6a)
    1543        .dwattr $C$DW$T$23, DW_AT_decl_column(0x13)
    1544$C$DW$T$116     .dwtag  DW_TAG_volatile_type
    1545        .dwattr $C$DW$T$116, DW_AT_type(*$C$DW$T$23)
    1546
    1547$C$DW$T$24      .dwtag  DW_TAG_structure_type
    1548        .dwattr $C$DW$T$24, DW_AT_byte_size(0x04)
    1549$C$DW$110       .dwtag  DW_TAG_member
    1550        .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$11)
    1551        .dwattr $C$DW$110, DW_AT_name("PRU0_IMEM_PE_RAW")
    1552        .dwattr $C$DW$110, DW_AT_TI_symbol_name("PRU0_IMEM_PE_RAW")
    1553        .dwattr $C$DW$110, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x04)
    1554        .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1555        .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1556        .dwattr $C$DW$110, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1557        .dwattr $C$DW$110, DW_AT_decl_line(0x87)
    1558        .dwattr $C$DW$110, DW_AT_decl_column(0x0d)
    1559$C$DW$111       .dwtag  DW_TAG_member
    1560        .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$11)
    1561        .dwattr $C$DW$111, DW_AT_name("PRU0_DMEM_PE_RAW")
    1562        .dwattr $C$DW$111, DW_AT_TI_symbol_name("PRU0_DMEM_PE_RAW")
    1563        .dwattr $C$DW$111, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x04)
    1564        .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1565        .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1566        .dwattr $C$DW$111, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1567        .dwattr $C$DW$111, DW_AT_decl_line(0x88)
    1568        .dwattr $C$DW$111, DW_AT_decl_column(0x0d)
    1569$C$DW$112       .dwtag  DW_TAG_member
    1570        .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$11)
    1571        .dwattr $C$DW$112, DW_AT_name("PRU1_IMEM_PE_RAW")
    1572        .dwattr $C$DW$112, DW_AT_TI_symbol_name("PRU1_IMEM_PE_RAW")
    1573        .dwattr $C$DW$112, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x04)
    1574        .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1575        .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1576        .dwattr $C$DW$112, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
PRU Assembler Unix v2.1.4 Sun Apr 15 00:36:12 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
beacon.asm                                                           PAGE   30

    1577        .dwattr $C$DW$112, DW_AT_decl_line(0x89)
    1578        .dwattr $C$DW$112, DW_AT_decl_column(0x0d)
    1579$C$DW$113       .dwtag  DW_TAG_member
    1580        .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$11)
    1581        .dwattr $C$DW$113, DW_AT_name("PRU1_DMEM_PE_RAW")
    1582        .dwattr $C$DW$113, DW_AT_TI_symbol_name("PRU1_DMEM_PE_RAW")
    1583        .dwattr $C$DW$113, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x04)
    1584        .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1585        .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1586        .dwattr $C$DW$113, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1587        .dwattr $C$DW$113, DW_AT_decl_line(0x8a)
    1588        .dwattr $C$DW$113, DW_AT_decl_column(0x0d)
    1589$C$DW$114       .dwtag  DW_TAG_member
    1590        .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$11)
    1591        .dwattr $C$DW$114, DW_AT_name("RAM_PE_RAW")
    1592        .dwattr $C$DW$114, DW_AT_TI_symbol_name("RAM_PE_RAW")
    1593        .dwattr $C$DW$114, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
    1594        .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1595        .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1596        .dwattr $C$DW$114, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1597        .dwattr $C$DW$114, DW_AT_decl_line(0x8b)
    1598        .dwattr $C$DW$114, DW_AT_decl_column(0x0d)
    1599$C$DW$115       .dwtag  DW_TAG_member
    1600        .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$11)
    1601        .dwattr $C$DW$115, DW_AT_name("rsvd20")
    1602        .dwattr $C$DW$115, DW_AT_TI_symbol_name("rsvd20")
    1603        .dwattr $C$DW$115, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
    1604        .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1605        .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1606        .dwattr $C$DW$115, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1607        .dwattr $C$DW$115, DW_AT_decl_line(0x8c)
    1608        .dwattr $C$DW$115, DW_AT_decl_column(0x0d)
    1609        .dwendtag $C$DW$T$24
    1610
    1611        .dwattr $C$DW$T$24, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1612        .dwattr $C$DW$T$24, DW_AT_decl_line(0x86)
    1613        .dwattr $C$DW$T$24, DW_AT_decl_column(0x14)
    1614$C$DW$T$118     .dwtag  DW_TAG_volatile_type
    1615        .dwattr $C$DW$T$118, DW_AT_type(*$C$DW$T$24)
    1616
    1617$C$DW$T$25      .dwtag  DW_TAG_structure_type
    1618        .dwattr $C$DW$T$25, DW_AT_byte_size(0x04)
    1619$C$DW$116       .dwtag  DW_TAG_member
    1620        .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$11)
    1621        .dwattr $C$DW$116, DW_AT_name("PRU0_IMEM_PE")
    1622        .dwattr $C$DW$116, DW_AT_TI_symbol_name("PRU0_IMEM_PE")
    1623        .dwattr $C$DW$116, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x04)
    1624        .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1625        .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1626        .dwattr $C$DW$116, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1627        .dwattr $C$DW$116, DW_AT_decl_line(0x96)
    1628        .dwattr $C$DW$116, DW_AT_decl_column(0x0d)
    1629$C$DW$117       .dwtag  DW_TAG_member
    1630        .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$11)
    1631        .dwattr $C$DW$117, DW_AT_name("PRU0_DMEM_PE")
PRU Assembler Unix v2.1.4 Sun Apr 15 00:36:12 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
beacon.asm                                                           PAGE   31

    1632        .dwattr $C$DW$117, DW_AT_TI_symbol_name("PRU0_DMEM_PE")
    1633        .dwattr $C$DW$117, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x04)
    1634        .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1635        .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1636        .dwattr $C$DW$117, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1637        .dwattr $C$DW$117, DW_AT_decl_line(0x97)
    1638        .dwattr $C$DW$117, DW_AT_decl_column(0x0d)
    1639$C$DW$118       .dwtag  DW_TAG_member
    1640        .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$11)
    1641        .dwattr $C$DW$118, DW_AT_name("PRU1_IMEM_PE")
    1642        .dwattr $C$DW$118, DW_AT_TI_symbol_name("PRU1_IMEM_PE")
    1643        .dwattr $C$DW$118, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x04)
    1644        .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1645        .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1646        .dwattr $C$DW$118, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1647        .dwattr $C$DW$118, DW_AT_decl_line(0x98)
    1648        .dwattr $C$DW$118, DW_AT_decl_column(0x0d)
    1649$C$DW$119       .dwtag  DW_TAG_member
    1650        .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$11)
    1651        .dwattr $C$DW$119, DW_AT_name("PRU1_DMEM_PE")
    1652        .dwattr $C$DW$119, DW_AT_TI_symbol_name("PRU1_DMEM_PE")
    1653        .dwattr $C$DW$119, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x04)
    1654        .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1655        .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1656        .dwattr $C$DW$119, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1657        .dwattr $C$DW$119, DW_AT_decl_line(0x99)
    1658        .dwattr $C$DW$119, DW_AT_decl_column(0x0d)
    1659$C$DW$120       .dwtag  DW_TAG_member
    1660        .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$11)
    1661        .dwattr $C$DW$120, DW_AT_name("RAM_PE")
    1662        .dwattr $C$DW$120, DW_AT_TI_symbol_name("RAM_PE")
    1663        .dwattr $C$DW$120, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
    1664        .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1665        .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1666        .dwattr $C$DW$120, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1667        .dwattr $C$DW$120, DW_AT_decl_line(0x9a)
    1668        .dwattr $C$DW$120, DW_AT_decl_column(0x0d)
    1669$C$DW$121       .dwtag  DW_TAG_member
    1670        .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$11)
    1671        .dwattr $C$DW$121, DW_AT_name("rsvd20")
    1672        .dwattr $C$DW$121, DW_AT_TI_symbol_name("rsvd20")
    1673        .dwattr $C$DW$121, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
    1674        .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1675        .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1676        .dwattr $C$DW$121, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1677        .dwattr $C$DW$121, DW_AT_decl_line(0x9b)
    1678        .dwattr $C$DW$121, DW_AT_decl_column(0x0d)
    1679        .dwendtag $C$DW$T$25
    1680
    1681        .dwattr $C$DW$T$25, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1682        .dwattr $C$DW$T$25, DW_AT_decl_line(0x95)
    1683        .dwattr $C$DW$T$25, DW_AT_decl_column(0x14)
    1684$C$DW$T$120     .dwtag  DW_TAG_volatile_type
    1685        .dwattr $C$DW$T$120, DW_AT_type(*$C$DW$T$25)
    1686
PRU Assembler Unix v2.1.4 Sun Apr 15 00:36:12 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
beacon.asm                                                           PAGE   32

    1687$C$DW$T$26      .dwtag  DW_TAG_structure_type
    1688        .dwattr $C$DW$T$26, DW_AT_byte_size(0x04)
    1689$C$DW$122       .dwtag  DW_TAG_member
    1690        .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$11)
    1691        .dwattr $C$DW$122, DW_AT_name("PRU0_IMEM_PE_SET")
    1692        .dwattr $C$DW$122, DW_AT_TI_symbol_name("PRU0_IMEM_PE_SET")
    1693        .dwattr $C$DW$122, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x04)
    1694        .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1695        .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1696        .dwattr $C$DW$122, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1697        .dwattr $C$DW$122, DW_AT_decl_line(0xa4)
    1698        .dwattr $C$DW$122, DW_AT_decl_column(0x0d)
    1699$C$DW$123       .dwtag  DW_TAG_member
    1700        .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$11)
    1701        .dwattr $C$DW$123, DW_AT_name("PRU0_DMEM_PE_SET")
    1702        .dwattr $C$DW$123, DW_AT_TI_symbol_name("PRU0_DMEM_PE_SET")
    1703        .dwattr $C$DW$123, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x04)
    1704        .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1705        .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1706        .dwattr $C$DW$123, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1707        .dwattr $C$DW$123, DW_AT_decl_line(0xa5)
    1708        .dwattr $C$DW$123, DW_AT_decl_column(0x0d)
    1709$C$DW$124       .dwtag  DW_TAG_member
    1710        .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$11)
    1711        .dwattr $C$DW$124, DW_AT_name("PRU1_IMEM_PE_SET")
    1712        .dwattr $C$DW$124, DW_AT_TI_symbol_name("PRU1_IMEM_PE_SET")
    1713        .dwattr $C$DW$124, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x04)
    1714        .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1715        .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1716        .dwattr $C$DW$124, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1717        .dwattr $C$DW$124, DW_AT_decl_line(0xa6)
    1718        .dwattr $C$DW$124, DW_AT_decl_column(0x0d)
    1719$C$DW$125       .dwtag  DW_TAG_member
    1720        .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$11)
    1721        .dwattr $C$DW$125, DW_AT_name("PRU1_DMEM_PE_SET")
    1722        .dwattr $C$DW$125, DW_AT_TI_symbol_name("PRU1_DMEM_PE_SET")
    1723        .dwattr $C$DW$125, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x04)
    1724        .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1725        .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1726        .dwattr $C$DW$125, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1727        .dwattr $C$DW$125, DW_AT_decl_line(0xa7)
    1728        .dwattr $C$DW$125, DW_AT_decl_column(0x0d)
    1729$C$DW$126       .dwtag  DW_TAG_member
    1730        .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$11)
    1731        .dwattr $C$DW$126, DW_AT_name("RAM_PE_SET")
    1732        .dwattr $C$DW$126, DW_AT_TI_symbol_name("RAM_PE_SET")
    1733        .dwattr $C$DW$126, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
    1734        .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1735        .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1736        .dwattr $C$DW$126, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1737        .dwattr $C$DW$126, DW_AT_decl_line(0xa8)
    1738        .dwattr $C$DW$126, DW_AT_decl_column(0x0d)
    1739$C$DW$127       .dwtag  DW_TAG_member
    1740        .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$11)
    1741        .dwattr $C$DW$127, DW_AT_name("rsvd20")
PRU Assembler Unix v2.1.4 Sun Apr 15 00:36:12 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
beacon.asm                                                           PAGE   33

    1742        .dwattr $C$DW$127, DW_AT_TI_symbol_name("rsvd20")
    1743        .dwattr $C$DW$127, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
    1744        .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1745        .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1746        .dwattr $C$DW$127, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1747        .dwattr $C$DW$127, DW_AT_decl_line(0xa9)
    1748        .dwattr $C$DW$127, DW_AT_decl_column(0x0d)
    1749        .dwendtag $C$DW$T$26
    1750
    1751        .dwattr $C$DW$T$26, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1752        .dwattr $C$DW$T$26, DW_AT_decl_line(0xa3)
    1753        .dwattr $C$DW$T$26, DW_AT_decl_column(0x13)
    1754$C$DW$T$122     .dwtag  DW_TAG_volatile_type
    1755        .dwattr $C$DW$T$122, DW_AT_type(*$C$DW$T$26)
    1756
    1757$C$DW$T$27      .dwtag  DW_TAG_structure_type
    1758        .dwattr $C$DW$T$27, DW_AT_byte_size(0x04)
    1759$C$DW$128       .dwtag  DW_TAG_member
    1760        .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$11)
    1761        .dwattr $C$DW$128, DW_AT_name("PRU0_IMEM_PE_CLR")
    1762        .dwattr $C$DW$128, DW_AT_TI_symbol_name("PRU0_IMEM_PE_CLR")
    1763        .dwattr $C$DW$128, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x04)
    1764        .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1765        .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1766        .dwattr $C$DW$128, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1767        .dwattr $C$DW$128, DW_AT_decl_line(0xb3)
    1768        .dwattr $C$DW$128, DW_AT_decl_column(0x0d)
    1769$C$DW$129       .dwtag  DW_TAG_member
    1770        .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$11)
    1771        .dwattr $C$DW$129, DW_AT_name("PRU0_DMEM_PE_CLR")
    1772        .dwattr $C$DW$129, DW_AT_TI_symbol_name("PRU0_DMEM_PE_CLR")
    1773        .dwattr $C$DW$129, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x04)
    1774        .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1775        .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1776        .dwattr $C$DW$129, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1777        .dwattr $C$DW$129, DW_AT_decl_line(0xb4)
    1778        .dwattr $C$DW$129, DW_AT_decl_column(0x0d)
    1779$C$DW$130       .dwtag  DW_TAG_member
    1780        .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$11)
    1781        .dwattr $C$DW$130, DW_AT_name("PRU1_IMEM_PE_CLR")
    1782        .dwattr $C$DW$130, DW_AT_TI_symbol_name("PRU1_IMEM_PE_CLR")
    1783        .dwattr $C$DW$130, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x04)
    1784        .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1785        .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1786        .dwattr $C$DW$130, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1787        .dwattr $C$DW$130, DW_AT_decl_line(0xb5)
    1788        .dwattr $C$DW$130, DW_AT_decl_column(0x0d)
    1789$C$DW$131       .dwtag  DW_TAG_member
    1790        .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$11)
    1791        .dwattr $C$DW$131, DW_AT_name("PRU1_DMEM_PE_CLR")
    1792        .dwattr $C$DW$131, DW_AT_TI_symbol_name("PRU1_DMEM_PE_CLR")
    1793        .dwattr $C$DW$131, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x04)
    1794        .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1795        .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1796        .dwattr $C$DW$131, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
PRU Assembler Unix v2.1.4 Sun Apr 15 00:36:12 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
beacon.asm                                                           PAGE   34

    1797        .dwattr $C$DW$131, DW_AT_decl_line(0xb6)
    1798        .dwattr $C$DW$131, DW_AT_decl_column(0x0d)
    1799$C$DW$132       .dwtag  DW_TAG_member
    1800        .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$11)
    1801        .dwattr $C$DW$132, DW_AT_name("rsvd16")
    1802        .dwattr $C$DW$132, DW_AT_TI_symbol_name("rsvd16")
    1803        .dwattr $C$DW$132, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1804        .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1805        .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1806        .dwattr $C$DW$132, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1807        .dwattr $C$DW$132, DW_AT_decl_line(0xb7)
    1808        .dwattr $C$DW$132, DW_AT_decl_column(0x0d)
    1809        .dwendtag $C$DW$T$27
    1810
    1811        .dwattr $C$DW$T$27, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1812        .dwattr $C$DW$T$27, DW_AT_decl_line(0xb2)
    1813        .dwattr $C$DW$T$27, DW_AT_decl_column(0x13)
    1814$C$DW$T$124     .dwtag  DW_TAG_volatile_type
    1815        .dwattr $C$DW$T$124, DW_AT_type(*$C$DW$T$27)
    1816
    1817$C$DW$T$28      .dwtag  DW_TAG_structure_type
    1818        .dwattr $C$DW$T$28, DW_AT_byte_size(0x04)
    1819$C$DW$133       .dwtag  DW_TAG_member
    1820        .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$11)
    1821        .dwattr $C$DW$133, DW_AT_name("PMAO_PRU0")
    1822        .dwattr $C$DW$133, DW_AT_TI_symbol_name("PMAO_PRU0")
    1823        .dwattr $C$DW$133, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
    1824        .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1825        .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1826        .dwattr $C$DW$133, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1827        .dwattr $C$DW$133, DW_AT_decl_line(0xc4)
    1828        .dwattr $C$DW$133, DW_AT_decl_column(0x0d)
    1829$C$DW$134       .dwtag  DW_TAG_member
    1830        .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$11)
    1831        .dwattr $C$DW$134, DW_AT_name("PMAO_PRU1")
    1832        .dwattr $C$DW$134, DW_AT_TI_symbol_name("PMAO_PRU1")
    1833        .dwattr $C$DW$134, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x01)
    1834        .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1835        .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1836        .dwattr $C$DW$134, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1837        .dwattr $C$DW$134, DW_AT_decl_line(0xc5)
    1838        .dwattr $C$DW$134, DW_AT_decl_column(0x0d)
    1839$C$DW$135       .dwtag  DW_TAG_member
    1840        .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$11)
    1841        .dwattr $C$DW$135, DW_AT_name("rsvd2")
    1842        .dwattr $C$DW$135, DW_AT_TI_symbol_name("rsvd2")
    1843        .dwattr $C$DW$135, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1e)
    1844        .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1845        .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1846        .dwattr $C$DW$135, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1847        .dwattr $C$DW$135, DW_AT_decl_line(0xc6)
    1848        .dwattr $C$DW$135, DW_AT_decl_column(0x0d)
    1849        .dwendtag $C$DW$T$28
    1850
    1851        .dwattr $C$DW$T$28, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
PRU Assembler Unix v2.1.4 Sun Apr 15 00:36:12 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
beacon.asm                                                           PAGE   35

    1852        .dwattr $C$DW$T$28, DW_AT_decl_line(0xc3)
    1853        .dwattr $C$DW$T$28, DW_AT_decl_column(0x13)
    1854$C$DW$T$126     .dwtag  DW_TAG_volatile_type
    1855        .dwattr $C$DW$T$126, DW_AT_type(*$C$DW$T$28)
    1856
    1857$C$DW$T$29      .dwtag  DW_TAG_structure_type
    1858        .dwattr $C$DW$T$29, DW_AT_byte_size(0x04)
    1859$C$DW$136       .dwtag  DW_TAG_member
    1860        .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$11)
    1861        .dwattr $C$DW$136, DW_AT_name("OCP_EN")
    1862        .dwattr $C$DW$136, DW_AT_TI_symbol_name("OCP_EN")
    1863        .dwattr $C$DW$136, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
    1864        .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1865        .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1866        .dwattr $C$DW$136, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1867        .dwattr $C$DW$136, DW_AT_decl_line(0xd3)
    1868        .dwattr $C$DW$136, DW_AT_decl_column(0x0d)
    1869$C$DW$137       .dwtag  DW_TAG_member
    1870        .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$11)
    1871        .dwattr $C$DW$137, DW_AT_name("rsvd1")
    1872        .dwattr $C$DW$137, DW_AT_TI_symbol_name("rsvd1")
    1873        .dwattr $C$DW$137, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1f)
    1874        .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1875        .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1876        .dwattr $C$DW$137, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1877        .dwattr $C$DW$137, DW_AT_decl_line(0xd4)
    1878        .dwattr $C$DW$137, DW_AT_decl_column(0x0d)
    1879        .dwendtag $C$DW$T$29
    1880
    1881        .dwattr $C$DW$T$29, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1882        .dwattr $C$DW$T$29, DW_AT_decl_line(0xd2)
    1883        .dwattr $C$DW$T$29, DW_AT_decl_column(0x13)
    1884$C$DW$T$128     .dwtag  DW_TAG_volatile_type
    1885        .dwattr $C$DW$T$128, DW_AT_type(*$C$DW$T$29)
    1886
    1887$C$DW$T$30      .dwtag  DW_TAG_structure_type
    1888        .dwattr $C$DW$T$30, DW_AT_byte_size(0x04)
    1889$C$DW$138       .dwtag  DW_TAG_member
    1890        .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$11)
    1891        .dwattr $C$DW$138, DW_AT_name("PRU1_PAD_HP_EN")
    1892        .dwattr $C$DW$138, DW_AT_TI_symbol_name("PRU1_PAD_HP_EN")
    1893        .dwattr $C$DW$138, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
    1894        .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1895        .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1896        .dwattr $C$DW$138, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1897        .dwattr $C$DW$138, DW_AT_decl_line(0xde)
    1898        .dwattr $C$DW$138, DW_AT_decl_column(0x0d)
    1899$C$DW$139       .dwtag  DW_TAG_member
    1900        .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$11)
    1901        .dwattr $C$DW$139, DW_AT_name("XFR_SHIFT_EN")
    1902        .dwattr $C$DW$139, DW_AT_TI_symbol_name("XFR_SHIFT_EN")
    1903        .dwattr $C$DW$139, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x01)
    1904        .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1905        .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1906        .dwattr $C$DW$139, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
PRU Assembler Unix v2.1.4 Sun Apr 15 00:36:12 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
beacon.asm                                                           PAGE   36

    1907        .dwattr $C$DW$139, DW_AT_decl_line(0xdf)
    1908        .dwattr $C$DW$139, DW_AT_decl_column(0x0d)
    1909$C$DW$140       .dwtag  DW_TAG_member
    1910        .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$11)
    1911        .dwattr $C$DW$140, DW_AT_name("rsvd2")
    1912        .dwattr $C$DW$140, DW_AT_TI_symbol_name("rsvd2")
    1913        .dwattr $C$DW$140, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1e)
    1914        .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1915        .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1916        .dwattr $C$DW$140, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1917        .dwattr $C$DW$140, DW_AT_decl_line(0xe0)
    1918        .dwattr $C$DW$140, DW_AT_decl_column(0x0d)
    1919        .dwendtag $C$DW$T$30
    1920
    1921        .dwattr $C$DW$T$30, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1922        .dwattr $C$DW$T$30, DW_AT_decl_line(0xdd)
    1923        .dwattr $C$DW$T$30, DW_AT_decl_column(0x13)
    1924$C$DW$T$130     .dwtag  DW_TAG_volatile_type
    1925        .dwattr $C$DW$T$130, DW_AT_type(*$C$DW$T$30)
    1926
    1927$C$DW$T$31      .dwtag  DW_TAG_structure_type
    1928        .dwattr $C$DW$T$31, DW_AT_byte_size(0x04)
    1929$C$DW$141       .dwtag  DW_TAG_member
    1930        .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$11)
    1931        .dwattr $C$DW$141, DW_AT_name("PIN_MUX_SEL")
    1932        .dwattr $C$DW$141, DW_AT_TI_symbol_name("PIN_MUX_SEL")
    1933        .dwattr $C$DW$141, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x08)
    1934        .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1935        .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1936        .dwattr $C$DW$141, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1937        .dwattr $C$DW$141, DW_AT_decl_line(0xec)
    1938        .dwattr $C$DW$141, DW_AT_decl_column(0x0d)
    1939$C$DW$142       .dwtag  DW_TAG_member
    1940        .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$11)
    1941        .dwattr $C$DW$142, DW_AT_name("rsvd2")
    1942        .dwattr $C$DW$142, DW_AT_TI_symbol_name("rsvd2")
    1943        .dwattr $C$DW$142, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x18)
    1944        .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1945        .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1946        .dwattr $C$DW$142, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1947        .dwattr $C$DW$142, DW_AT_decl_line(0xed)
    1948        .dwattr $C$DW$142, DW_AT_decl_column(0x0d)
    1949        .dwendtag $C$DW$T$31
    1950
    1951        .dwattr $C$DW$T$31, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1952        .dwattr $C$DW$T$31, DW_AT_decl_line(0xeb)
    1953        .dwattr $C$DW$T$31, DW_AT_decl_column(0x13)
    1954$C$DW$T$132     .dwtag  DW_TAG_volatile_type
    1955        .dwattr $C$DW$T$132, DW_AT_type(*$C$DW$T$31)
    1956
    1957$C$DW$T$35      .dwtag  DW_TAG_structure_type
    1958        .dwattr $C$DW$T$35, DW_AT_byte_size(0x44)
    1959$C$DW$143       .dwtag  DW_TAG_member
    1960        .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$109)
    1961        .dwattr $C$DW$143, DW_AT_name("$P$T0")
PRU Assembler Unix v2.1.4 Sun Apr 15 00:36:12 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
beacon.asm                                                           PAGE   37

    1962        .dwattr $C$DW$143, DW_AT_TI_symbol_name("$P$T0")
    1963        .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1964        .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1965        .dwattr $C$DW$143, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1966        .dwattr $C$DW$143, DW_AT_decl_line(0x29)
    1967        .dwattr $C$DW$143, DW_AT_decl_column(0x02)
    1968$C$DW$144       .dwtag  DW_TAG_member
    1969        .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$111)
    1970        .dwattr $C$DW$144, DW_AT_name("$P$T1")
    1971        .dwattr $C$DW$144, DW_AT_TI_symbol_name("$P$T1")
    1972        .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1973        .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1974        .dwattr $C$DW$144, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1975        .dwattr $C$DW$144, DW_AT_decl_line(0x33)
    1976        .dwattr $C$DW$144, DW_AT_decl_column(0x02)
    1977$C$DW$145       .dwtag  DW_TAG_member
    1978        .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$113)
    1979        .dwattr $C$DW$145, DW_AT_name("$P$T2")
    1980        .dwattr $C$DW$145, DW_AT_TI_symbol_name("$P$T2")
    1981        .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1982        .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1983        .dwattr $C$DW$145, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1984        .dwattr $C$DW$145, DW_AT_decl_line(0x41)
    1985        .dwattr $C$DW$145, DW_AT_decl_column(0x02)
    1986$C$DW$146       .dwtag  DW_TAG_member
    1987        .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$115)
    1988        .dwattr $C$DW$146, DW_AT_name("$P$T3")
    1989        .dwattr $C$DW$146, DW_AT_TI_symbol_name("$P$T3")
    1990        .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1991        .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1992        .dwattr $C$DW$146, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1993        .dwattr $C$DW$146, DW_AT_decl_line(0x54)
    1994        .dwattr $C$DW$146, DW_AT_decl_column(0x02)
    1995$C$DW$147       .dwtag  DW_TAG_member
    1996        .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$117)
    1997        .dwattr $C$DW$147, DW_AT_name("$P$T4")
    1998        .dwattr $C$DW$147, DW_AT_TI_symbol_name("$P$T4")
    1999        .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2000        .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    2001        .dwattr $C$DW$147, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2002        .dwattr $C$DW$147, DW_AT_decl_line(0x67)
    2003        .dwattr $C$DW$147, DW_AT_decl_column(0x02)
    2004$C$DW$148       .dwtag  DW_TAG_member
    2005        .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$119)
    2006        .dwattr $C$DW$148, DW_AT_name("$P$T5")
    2007        .dwattr $C$DW$148, DW_AT_TI_symbol_name("$P$T5")
    2008        .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2009        .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    2010        .dwattr $C$DW$148, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2011        .dwattr $C$DW$148, DW_AT_decl_line(0x83)
    2012        .dwattr $C$DW$148, DW_AT_decl_column(0x02)
    2013$C$DW$149       .dwtag  DW_TAG_member
    2014        .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$121)
    2015        .dwattr $C$DW$149, DW_AT_name("$P$T6")
    2016        .dwattr $C$DW$149, DW_AT_TI_symbol_name("$P$T6")
PRU Assembler Unix v2.1.4 Sun Apr 15 00:36:12 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
beacon.asm                                                           PAGE   38

    2017        .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2018        .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    2019        .dwattr $C$DW$149, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2020        .dwattr $C$DW$149, DW_AT_decl_line(0x92)
    2021        .dwattr $C$DW$149, DW_AT_decl_column(0x02)
    2022$C$DW$150       .dwtag  DW_TAG_member
    2023        .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$123)
    2024        .dwattr $C$DW$150, DW_AT_name("$P$T7")
    2025        .dwattr $C$DW$150, DW_AT_TI_symbol_name("$P$T7")
    2026        .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2027        .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    2028        .dwattr $C$DW$150, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2029        .dwattr $C$DW$150, DW_AT_decl_line(0xa0)
    2030        .dwattr $C$DW$150, DW_AT_decl_column(0x02)
    2031$C$DW$151       .dwtag  DW_TAG_member
    2032        .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$125)
    2033        .dwattr $C$DW$151, DW_AT_name("$P$T8")
    2034        .dwattr $C$DW$151, DW_AT_TI_symbol_name("$P$T8")
    2035        .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2036        .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    2037        .dwattr $C$DW$151, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2038        .dwattr $C$DW$151, DW_AT_decl_line(0xaf)
    2039        .dwattr $C$DW$151, DW_AT_decl_column(0x02)
    2040$C$DW$152       .dwtag  DW_TAG_member
    2041        .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$32)
    2042        .dwattr $C$DW$152, DW_AT_name("rsvd24")
    2043        .dwattr $C$DW$152, DW_AT_TI_symbol_name("rsvd24")
    2044        .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    2045        .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    2046        .dwattr $C$DW$152, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2047        .dwattr $C$DW$152, DW_AT_decl_line(0xbc)
    2048        .dwattr $C$DW$152, DW_AT_decl_column(0x0b)
    2049$C$DW$153       .dwtag  DW_TAG_member
    2050        .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$127)
    2051        .dwattr $C$DW$153, DW_AT_name("$P$T9")
    2052        .dwattr $C$DW$153, DW_AT_TI_symbol_name("$P$T9")
    2053        .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    2054        .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    2055        .dwattr $C$DW$153, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2056        .dwattr $C$DW$153, DW_AT_decl_line(0xc0)
    2057        .dwattr $C$DW$153, DW_AT_decl_column(0x02)
    2058$C$DW$154       .dwtag  DW_TAG_member
    2059        .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$33)
    2060        .dwattr $C$DW$154, DW_AT_name("rsvd2c")
    2061        .dwattr $C$DW$154, DW_AT_TI_symbol_name("rsvd2c")
    2062        .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    2063        .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    2064        .dwattr $C$DW$154, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2065        .dwattr $C$DW$154, DW_AT_decl_line(0xcb)
    2066        .dwattr $C$DW$154, DW_AT_decl_column(0x0b)
    2067$C$DW$155       .dwtag  DW_TAG_member
    2068        .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$129)
    2069        .dwattr $C$DW$155, DW_AT_name("$P$T10")
    2070        .dwattr $C$DW$155, DW_AT_TI_symbol_name("$P$T10")
    2071        .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
PRU Assembler Unix v2.1.4 Sun Apr 15 00:36:12 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
beacon.asm                                                           PAGE   39

    2072        .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    2073        .dwattr $C$DW$155, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2074        .dwattr $C$DW$155, DW_AT_decl_line(0xcf)
    2075        .dwattr $C$DW$155, DW_AT_decl_column(0x02)
    2076$C$DW$156       .dwtag  DW_TAG_member
    2077        .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$131)
    2078        .dwattr $C$DW$156, DW_AT_name("$P$T11")
    2079        .dwattr $C$DW$156, DW_AT_TI_symbol_name("$P$T11")
    2080        .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    2081        .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    2082        .dwattr $C$DW$156, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2083        .dwattr $C$DW$156, DW_AT_decl_line(0xda)
    2084        .dwattr $C$DW$156, DW_AT_decl_column(0x02)
    2085$C$DW$157       .dwtag  DW_TAG_member
    2086        .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$34)
    2087        .dwattr $C$DW$157, DW_AT_name("rsvd38")
    2088        .dwattr $C$DW$157, DW_AT_TI_symbol_name("rsvd38")
    2089        .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    2090        .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    2091        .dwattr $C$DW$157, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2092        .dwattr $C$DW$157, DW_AT_decl_line(0xe5)
    2093        .dwattr $C$DW$157, DW_AT_decl_column(0x0b)
    2094$C$DW$158       .dwtag  DW_TAG_member
    2095        .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$133)
    2096        .dwattr $C$DW$158, DW_AT_name("$P$T12")
    2097        .dwattr $C$DW$158, DW_AT_TI_symbol_name("$P$T12")
    2098        .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    2099        .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    2100        .dwattr $C$DW$158, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2101        .dwattr $C$DW$158, DW_AT_decl_line(0xe8)
    2102        .dwattr $C$DW$158, DW_AT_decl_column(0x02)
    2103        .dwendtag $C$DW$T$35
    2104
    2105        .dwattr $C$DW$T$35, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    2106        .dwattr $C$DW$T$35, DW_AT_decl_line(0x26)
    2107        .dwattr $C$DW$T$35, DW_AT_decl_column(0x10)
    2108$C$DW$T$290     .dwtag  DW_TAG_typedef, DW_AT_name("pruCfg")
    2109        .dwattr $C$DW$T$290, DW_AT_type(*$C$DW$T$35)
    2110        .dwattr $C$DW$T$290, DW_AT_language(DW_LANG_C)
    2111        .dwattr $C$DW$T$290, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/
    2112        .dwattr $C$DW$T$290, DW_AT_decl_line(0xf0)
    2113        .dwattr $C$DW$T$290, DW_AT_decl_column(0x03)
    2114$C$DW$T$291     .dwtag  DW_TAG_volatile_type
    2115        .dwattr $C$DW$T$291, DW_AT_type(*$C$DW$T$290)
    2116
    2117$C$DW$T$36      .dwtag  DW_TAG_structure_type
    2118        .dwattr $C$DW$T$36, DW_AT_byte_size(0x04)
    2119$C$DW$159       .dwtag  DW_TAG_member
    2120        .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$11)
    2121        .dwattr $C$DW$159, DW_AT_name("REV_MINOR")
    2122        .dwattr $C$DW$159, DW_AT_TI_symbol_name("REV_MINOR")
    2123        .dwattr $C$DW$159, DW_AT_bit_offset(0x1a), DW_AT_bit_size(0x06)
    2124        .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2125        .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    2126        .dwattr $C$DW$159, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
PRU Assembler Unix v2.1.4 Sun Apr 15 00:36:12 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
beacon.asm                                                           PAGE   40

    2127        .dwattr $C$DW$159, DW_AT_decl_line(0x2d)
    2128        .dwattr $C$DW$159, DW_AT_decl_column(0x0d)
    2129$C$DW$160       .dwtag  DW_TAG_member
    2130        .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$11)
    2131        .dwattr $C$DW$160, DW_AT_name("REV_CUSTOM")
    2132        .dwattr $C$DW$160, DW_AT_TI_symbol_name("REV_CUSTOM")
    2133        .dwattr $C$DW$160, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x02)
    2134        .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2135        .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    2136        .dwattr $C$DW$160, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2137        .dwattr $C$DW$160, DW_AT_decl_line(0x2e)
    2138        .dwattr $C$DW$160, DW_AT_decl_column(0x0d)
    2139$C$DW$161       .dwtag  DW_TAG_member
    2140        .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$11)
    2141        .dwattr $C$DW$161, DW_AT_name("REV_MAJOR")
    2142        .dwattr $C$DW$161, DW_AT_TI_symbol_name("REV_MAJOR")
    2143        .dwattr $C$DW$161, DW_AT_bit_offset(0x15), DW_AT_bit_size(0x03)
    2144        .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2145        .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    2146        .dwattr $C$DW$161, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2147        .dwattr $C$DW$161, DW_AT_decl_line(0x2f)
    2148        .dwattr $C$DW$161, DW_AT_decl_column(0x0d)
    2149$C$DW$162       .dwtag  DW_TAG_member
    2150        .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$11)
    2151        .dwattr $C$DW$162, DW_AT_name("REV_RTL")
    2152        .dwattr $C$DW$162, DW_AT_TI_symbol_name("REV_RTL")
    2153        .dwattr $C$DW$162, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x05)
    2154        .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2155        .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2156        .dwattr $C$DW$162, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2157        .dwattr $C$DW$162, DW_AT_decl_line(0x30)
    2158        .dwattr $C$DW$162, DW_AT_decl_column(0x0d)
    2159$C$DW$163       .dwtag  DW_TAG_member
    2160        .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$11)
    2161        .dwattr $C$DW$163, DW_AT_name("REV_MODULE")
    2162        .dwattr $C$DW$163, DW_AT_TI_symbol_name("REV_MODULE")
    2163        .dwattr $C$DW$163, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x0c)
    2164        .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2165        .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2166        .dwattr $C$DW$163, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2167        .dwattr $C$DW$163, DW_AT_decl_line(0x31)
    2168        .dwattr $C$DW$163, DW_AT_decl_column(0x0d)
    2169$C$DW$164       .dwtag  DW_TAG_member
    2170        .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$11)
    2171        .dwattr $C$DW$164, DW_AT_name("rsvd28")
    2172        .dwattr $C$DW$164, DW_AT_TI_symbol_name("rsvd28")
    2173        .dwattr $C$DW$164, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
    2174        .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2175        .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2176        .dwattr $C$DW$164, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2177        .dwattr $C$DW$164, DW_AT_decl_line(0x32)
    2178        .dwattr $C$DW$164, DW_AT_decl_column(0x0d)
    2179$C$DW$165       .dwtag  DW_TAG_member
    2180        .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$11)
    2181        .dwattr $C$DW$165, DW_AT_name("REV_SCHEME")
PRU Assembler Unix v2.1.4 Sun Apr 15 00:36:12 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
beacon.asm                                                           PAGE   41

    2182        .dwattr $C$DW$165, DW_AT_TI_symbol_name("REV_SCHEME")
    2183        .dwattr $C$DW$165, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
    2184        .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2185        .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2186        .dwattr $C$DW$165, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2187        .dwattr $C$DW$165, DW_AT_decl_line(0x33)
    2188        .dwattr $C$DW$165, DW_AT_decl_column(0x0d)
    2189        .dwendtag $C$DW$T$36
    2190
    2191        .dwattr $C$DW$T$36, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    2192        .dwattr $C$DW$T$36, DW_AT_decl_line(0x2c)
    2193        .dwattr $C$DW$T$36, DW_AT_decl_column(0x13)
    2194$C$DW$T$134     .dwtag  DW_TAG_volatile_type
    2195        .dwattr $C$DW$T$134, DW_AT_type(*$C$DW$T$36)
    2196
    2197$C$DW$T$37      .dwtag  DW_TAG_structure_type
    2198        .dwattr $C$DW$T$37, DW_AT_byte_size(0x04)
    2199$C$DW$166       .dwtag  DW_TAG_member
    2200        .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$11)
    2201        .dwattr $C$DW$166, DW_AT_name("rsvd0")
    2202        .dwattr $C$DW$166, DW_AT_TI_symbol_name("rsvd0")
    2203        .dwattr $C$DW$166, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x02)
    2204        .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2205        .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2206        .dwattr $C$DW$166, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2207        .dwattr $C$DW$166, DW_AT_decl_line(0x3d)
    2208        .dwattr $C$DW$166, DW_AT_decl_column(0x0d)
    2209$C$DW$167       .dwtag  DW_TAG_member
    2210        .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$11)
    2211        .dwattr $C$DW$167, DW_AT_name("NEST_MODE")
    2212        .dwattr $C$DW$167, DW_AT_TI_symbol_name("NEST_MODE")
    2213        .dwattr $C$DW$167, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x02)
    2214        .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2215        .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2216        .dwattr $C$DW$167, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2217        .dwattr $C$DW$167, DW_AT_decl_line(0x3e)
    2218        .dwattr $C$DW$167, DW_AT_decl_column(0x0d)
    2219$C$DW$168       .dwtag  DW_TAG_member
    2220        .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$11)
    2221        .dwattr $C$DW$168, DW_AT_name("rsvd4")
    2222        .dwattr $C$DW$168, DW_AT_TI_symbol_name("rsvd4")
    2223        .dwattr $C$DW$168, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1c)
    2224        .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2225        .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2226        .dwattr $C$DW$168, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2227        .dwattr $C$DW$168, DW_AT_decl_line(0x3f)
    2228        .dwattr $C$DW$168, DW_AT_decl_column(0x0d)
    2229        .dwendtag $C$DW$T$37
    2230
    2231        .dwattr $C$DW$T$37, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    2232        .dwattr $C$DW$T$37, DW_AT_decl_line(0x3c)
    2233        .dwattr $C$DW$T$37, DW_AT_decl_column(0x13)
    2234$C$DW$T$136     .dwtag  DW_TAG_volatile_type
    2235        .dwattr $C$DW$T$136, DW_AT_type(*$C$DW$T$37)
    2236
PRU Assembler Unix v2.1.4 Sun Apr 15 00:36:12 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
beacon.asm                                                           PAGE   42

    2237$C$DW$T$38      .dwtag  DW_TAG_structure_type
    2238        .dwattr $C$DW$T$38, DW_AT_byte_size(0x04)
    2239$C$DW$169       .dwtag  DW_TAG_member
    2240        .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$11)
    2241        .dwattr $C$DW$169, DW_AT_name("EN_HINT_ANY")
    2242        .dwattr $C$DW$169, DW_AT_TI_symbol_name("EN_HINT_ANY")
    2243        .dwattr $C$DW$169, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
    2244        .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2245        .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2246        .dwattr $C$DW$169, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2247        .dwattr $C$DW$169, DW_AT_decl_line(0x4c)
    2248        .dwattr $C$DW$169, DW_AT_decl_column(0x0d)
    2249$C$DW$170       .dwtag  DW_TAG_member
    2250        .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$11)
    2251        .dwattr $C$DW$170, DW_AT_name("rsvd1")
    2252        .dwattr $C$DW$170, DW_AT_TI_symbol_name("rsvd1")
    2253        .dwattr $C$DW$170, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1f)
    2254        .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2255        .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    2256        .dwattr $C$DW$170, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2257        .dwattr $C$DW$170, DW_AT_decl_line(0x4d)
    2258        .dwattr $C$DW$170, DW_AT_decl_column(0x0d)
    2259        .dwendtag $C$DW$T$38
    2260
    2261        .dwattr $C$DW$T$38, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    2262        .dwattr $C$DW$T$38, DW_AT_decl_line(0x4b)
    2263        .dwattr $C$DW$T$38, DW_AT_decl_column(0x13)
    2264$C$DW$T$138     .dwtag  DW_TAG_volatile_type
    2265        .dwattr $C$DW$T$138, DW_AT_type(*$C$DW$T$38)
    2266
    2267$C$DW$T$39      .dwtag  DW_TAG_structure_type
    2268        .dwattr $C$DW$T$39, DW_AT_byte_size(0x04)
    2269$C$DW$171       .dwtag  DW_TAG_member
    2270        .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$11)
    2271        .dwattr $C$DW$171, DW_AT_name("GLB_NEST_LEVEL")
    2272        .dwattr $C$DW$171, DW_AT_TI_symbol_name("GLB_NEST_LEVEL")
    2273        .dwattr $C$DW$171, DW_AT_bit_offset(0x17), DW_AT_bit_size(0x09)
    2274        .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2275        .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    2276        .dwattr $C$DW$171, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2277        .dwattr $C$DW$171, DW_AT_decl_line(0x5a)
    2278        .dwattr $C$DW$171, DW_AT_decl_column(0x0d)
    2279$C$DW$172       .dwtag  DW_TAG_member
    2280        .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$11)
    2281        .dwattr $C$DW$172, DW_AT_name("rsvd9")
    2282        .dwattr $C$DW$172, DW_AT_TI_symbol_name("rsvd9")
    2283        .dwattr $C$DW$172, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x16)
    2284        .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2285        .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    2286        .dwattr $C$DW$172, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2287        .dwattr $C$DW$172, DW_AT_decl_line(0x5b)
    2288        .dwattr $C$DW$172, DW_AT_decl_column(0x0d)
    2289$C$DW$173       .dwtag  DW_TAG_member
    2290        .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$11)
    2291        .dwattr $C$DW$173, DW_AT_name("AUTO_OVERRIDE")
PRU Assembler Unix v2.1.4 Sun Apr 15 00:36:12 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
beacon.asm                                                           PAGE   43

    2292        .dwattr $C$DW$173, DW_AT_TI_symbol_name("AUTO_OVERRIDE")
    2293        .dwattr $C$DW$173, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    2294        .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2295        .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    2296        .dwattr $C$DW$173, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2297        .dwattr $C$DW$173, DW_AT_decl_line(0x5c)
    2298        .dwattr $C$DW$173, DW_AT_decl_column(0x0d)
    2299        .dwendtag $C$DW$T$39
    2300
    2301        .dwattr $C$DW$T$39, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    2302        .dwattr $C$DW$T$39, DW_AT_decl_line(0x59)
    2303        .dwattr $C$DW$T$39, DW_AT_decl_column(0x13)
    2304$C$DW$T$140     .dwtag  DW_TAG_volatile_type
    2305        .dwattr $C$DW$T$140, DW_AT_type(*$C$DW$T$39)
    2306
    2307$C$DW$T$40      .dwtag  DW_TAG_structure_type
    2308        .dwattr $C$DW$T$40, DW_AT_byte_size(0x04)
    2309$C$DW$174       .dwtag  DW_TAG_member
    2310        .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$11)
    2311        .dwattr $C$DW$174, DW_AT_name("STS_SET_IDX")
    2312        .dwattr $C$DW$174, DW_AT_TI_symbol_name("STS_SET_IDX")
    2313        .dwattr $C$DW$174, DW_AT_bit_offset(0x16), DW_AT_bit_size(0x0a)
    2314        .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2315        .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    2316        .dwattr $C$DW$174, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2317        .dwattr $C$DW$174, DW_AT_decl_line(0x66)
    2318        .dwattr $C$DW$174, DW_AT_decl_column(0x0d)
    2319$C$DW$175       .dwtag  DW_TAG_member
    2320        .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$11)
    2321        .dwattr $C$DW$175, DW_AT_name("rsvd10")
    2322        .dwattr $C$DW$175, DW_AT_TI_symbol_name("rsvd10")
    2323        .dwattr $C$DW$175, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x16)
    2324        .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2325        .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    2326        .dwattr $C$DW$175, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2327        .dwattr $C$DW$175, DW_AT_decl_line(0x67)
    2328        .dwattr $C$DW$175, DW_AT_decl_column(0x0d)
    2329        .dwendtag $C$DW$T$40
    2330
    2331        .dwattr $C$DW$T$40, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    2332        .dwattr $C$DW$T$40, DW_AT_decl_line(0x65)
    2333        .dwattr $C$DW$T$40, DW_AT_decl_column(0x13)
    2334$C$DW$T$142     .dwtag  DW_TAG_volatile_type
    2335        .dwattr $C$DW$T$142, DW_AT_type(*$C$DW$T$40)
    2336
    2337$C$DW$T$41      .dwtag  DW_TAG_structure_type
    2338        .dwattr $C$DW$T$41, DW_AT_byte_size(0x04)
    2339$C$DW$176       .dwtag  DW_TAG_member
    2340        .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$11)
    2341        .dwattr $C$DW$176, DW_AT_name("STS_CLR_IDX")
    2342        .dwattr $C$DW$176, DW_AT_TI_symbol_name("STS_CLR_IDX")
    2343        .dwattr $C$DW$176, DW_AT_bit_offset(0x16), DW_AT_bit_size(0x0a)
    2344        .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2345        .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    2346        .dwattr $C$DW$176, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
PRU Assembler Unix v2.1.4 Sun Apr 15 00:36:12 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
beacon.asm                                                           PAGE   44

    2347        .dwattr $C$DW$176, DW_AT_decl_line(0x71)
    2348        .dwattr $C$DW$176, DW_AT_decl_column(0x0d)
    2349$C$DW$177       .dwtag  DW_TAG_member
    2350        .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$11)
    2351        .dwattr $C$DW$177, DW_AT_name("rsvd10")
    2352        .dwattr $C$DW$177, DW_AT_TI_symbol_name("rsvd10")
    2353        .dwattr $C$DW$177, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x16)
    2354        .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2355        .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    2356        .dwattr $C$DW$177, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    2357        .dwattr $C$DW$177, DW_AT_decl_line(0x72)
    2358        .dwattr $C$DW$177, DW_AT_decl_column(0x0d)
    2359        .dwendtag $C$DW$T$41
    2360
    2361        .dwattr $C$DW$T$41, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    2362        .dwattr $C$DW$T$41, DW_AT_decl_line(0x70)
    2363        .dwattr $C$DW$T$41, DW_AT_decl_column(0x13)
    2364$C$DW$T$144     .dwtag  DW_TAG_volatile_type
