PRU Assembler Unix v2.1.4 Thu Apr 12 02:56:25 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
hello-pru.asm                                                        PAGE    1

       1;******************************************************************************
       2;* PRU C/C++ Codegen                                              Unix v2.1.4 *
       3;* Date/Time created: Thu Apr 12 02:56:25 2018                                *
       4;******************************************************************************
       5        .compiler_opts --abi=eabi --endian=little --hll_source=on --object_format=elf --silicon_versio
       6
       7$C$DW$CU        .dwtag  DW_TAG_compile_unit
       8        .dwattr $C$DW$CU, DW_AT_name("hello-pru.c")
       9        .dwattr $C$DW$CU, DW_AT_producer("TI PRU C/C++ Codegen Unix v2.1.4 Copyright (c) 2012-2015 Tex
      10        .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      11        .dwattr $C$DW$CU, DW_AT_comp_dir("/var/lib/cloud9/2ecf864e1b3f250bad82c0eae12b7b64")
      12        .global __PRU_CREG_PRU_CFG
      13
      14$C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("__halt")
      15        .dwattr $C$DW$1, DW_AT_TI_symbol_name("__halt")
      16        .dwattr $C$DW$1, DW_AT_declaration
      17        .dwattr $C$DW$1, DW_AT_external
      18
      19$C$DW$2 .dwtag  DW_TAG_subprogram, DW_AT_name("__delay_cycles")
      20        .dwattr $C$DW$2, DW_AT_TI_symbol_name("__delay_cycles")

     239 00000058 000000E1002584          SBBO      &r4, r5, 0, 4         ; [ALU_PRU] |102| $O$K10,$O$K7
     240        .dwpsn  file "hello-pru.c",line 105,column 3,is_stmt,isa 0
     241 0000005c 0000001504FEFE          XOR       r30, r30, 0x04        ; [ALU_PRU] |105| 
     242        .dwpsn  file "hello-pru.c",line 107,column 11,is_stmt,isa 0
     243 00000060 00000015806E6E          XOR       r14.b3, r14.b3, 0x80  ; [ALU_PRU] |107| 
     244 00000064 00000015806060          XOR       r0.b3, r0.b3, 0x80    ; [ALU_PRU] |107| 
     245 00000068 00000070E0EE08          QBGE      ||$C$L4||, r14, r0    ; [ALU_PRU] |107| 
     246;* --------------------------------------------------------------------------*
     247        .dwpsn  file "hello-pru.c",line 107,column 21,is_stmt,isa 0
     248 0000006c 00000010FDFDE0          MOV       r0, r29               ; [ALU_PRU] |107| $O$L2,i
     249;* --------------------------------------------------------------------------*
     250;*   BEGIN LOOP ||$C$L3||
     251;*
     252;*   Loop source line                : 107
     253;*   Loop closing brace source line  : 107
     254;*   Known Minimum Trip Count        : 1
     255;*   Known Maximum Trip Count        : 2147483647
     256;*   Known Max Trip Count Factor     : 1
     257;* --------------------------------------------------------------------------*
     258||$C$L3||:    
     259        .newblock
     260 00000070 003181240000C1          LDI32    r1, 49
     261 00000078 0000000501E1E1  $1:     SUB      r1, r1, 1
     262 0000007c 0000006F00E1FF          QBNE     $1, r1, 0             ; [ALU_PRU] |107| 
     263        .dwpsn  file "hello-pru.c",line 107,column 11,is_stmt,isa 0
     264 00000080 0000000501E0E0          SUB       r0, r0, 0x01          ; [ALU_PRU] |107| $O$L2,$O$L2
     265 00000084 0000006F00E0FB          QBNE      ||$C$L3||, r0, 0x00   ; [ALU_PRU] |107| $O$L2
     266;* --------------------------------------------------------------------------*
     267 00000088                 ||$C$L4||:    
     268        .dwpsn  file "hello-pru.c",line 93,column 26,is_stmt,isa 0
     269 00000088 000000240013FC          LDI       r28, 0x0013           ; [ALU_PRU] |93| 
     270 0000008c 000000240014EF          LDI       r15, 0x0014           ; [ALU_PRU] |93| 
     271 00000090 0000002E80019A          XIN       0, &r26, 4            ; [ALU_PRU] |93| 
     272 00000094 00000010FAFAEE          MOV       r14, r26              ; [ALU_PRU] |93| 
     273$C$DW$11        .dwtag  DW_TAG_TI_branch
     274        .dwattr $C$DW$11, DW_AT_low_pc(0x00)
     275        .dwattr $C$DW$11, DW_AT_name("__pruabi_divi")
PRU Assembler Unix v2.1.4 Thu Apr 12 02:56:25 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
hello-pru.asm                                                        PAGE    6

     276        .dwattr $C$DW$11, DW_AT_TI_call
     277 00000098 000000230000C3!         JAL       r3.w2, ||__pruabi_divi|| ; [ALU_PRU] |93| __pruabi_divi
     278 0000009c 000000240000E0          LDI       r0, 0x0000            ; [ALU_PRU] |93| 
     279 000000a0 00000015806060          XOR       r0.b3, r0.b3, 0x80    ; [ALU_PRU] |93| 
     280 000000a4 00000010EEEEFD          MOV       r29, r14              ; [ALU_PRU] |93| 
     281 000000a8 00000015806E6E          XOR       r14.b3, r14.b3, 0x80  ; [ALU_PRU] |93| 
     282 000000ac 0000004EE0EEE0          QBLT      ||$C$L1||, r14, r0    ; [ALU_PRU] |93| 
     283;* --------------------------------------------------------------------------*
     284        .dwpsn  file "hello-pru.c",line 111,column 2,is_stmt,isa 0
     285;----------------------------------------------------------------------
     286; 111 | __halt();                                                              
     287;----------------------------------------------------------------------
     288 000000b0 0000002A000000          HALT      ; [ALU_PRU] |111| 
     289 000000b4 000000F10082C3          LBBO      &r3.b2, r2, 0, 10     ; [ALU_PRU] 
     290        .dwcfi  restore_reg, 14
     291        .dwcfi  restore_reg, 15
     292        .dwcfi  restore_reg, 16
     293        .dwcfi  restore_reg, 17
     294        .dwcfi  restore_reg, 18
     295        .dwcfi  restore_reg, 19
     296        .dwcfi  restore_reg, 20
     297        .dwcfi  restore_reg, 21
     298        .dwcfi  restore_reg, 22
     299        .dwcfi  restore_reg, 23
     300 000000b8 000000010AE2E2          ADD       r2, r2, 0x0a          ; [ALU_PRU] 
     301        .dwcfi  cfa_offset, 0
     302$C$DW$12        .dwtag  DW_TAG_TI_branch
     303        .dwattr $C$DW$12, DW_AT_low_pc(0x00)
     304        .dwattr $C$DW$12, DW_AT_TI_return
     305 000000bc 00000020C30000          JMP       r3.w2                 ; [ALU_PRU] 
     306        .dwattr $C$DW$9, DW_AT_TI_end_file("hello-pru.c")
     307        .dwattr $C$DW$9, DW_AT_TI_end_line(0x70)
     308        .dwattr $C$DW$9, DW_AT_TI_end_column(0x01)
     309        .dwendentry
     310        .dwendtag $C$DW$9
     311
     312;*****************************************************************************
     313;* UNDEFINED EXTERNAL REFERENCES                                             *
     314;*****************************************************************************
     315        .global ||__pruabi_divi||
     316
     317;******************************************************************************
     318;* TYPE INFORMATION                                                           *
     319;******************************************************************************
     320
     321$C$DW$T$19      .dwtag  DW_TAG_structure_type
     322        .dwattr $C$DW$T$19, DW_AT_byte_size(0x04)
     323$C$DW$13        .dwtag  DW_TAG_member
     324        .dwattr $C$DW$13, DW_AT_type(*$C$DW$T$11)
     325        .dwattr $C$DW$13, DW_AT_name("REVID")
     326        .dwattr $C$DW$13, DW_AT_TI_symbol_name("REVID")
     327        .dwattr $C$DW$13, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x20)
     328        .dwattr $C$DW$13, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     329        .dwattr $C$DW$13, DW_AT_accessibility(DW_ACCESS_public)
     330        .dwattr $C$DW$13, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
PRU Assembler Unix v2.1.4 Thu Apr 12 02:56:25 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
hello-pru.asm                                                        PAGE    7

     331        .dwattr $C$DW$13, DW_AT_decl_line(0x2d)
     332        .dwattr $C$DW$13, DW_AT_decl_column(0x0d)
     333        .dwendtag $C$DW$T$19
     334
     335        .dwattr $C$DW$T$19, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
     336        .dwattr $C$DW$T$19, DW_AT_decl_line(0x2c)
     337        .dwattr $C$DW$T$19, DW_AT_decl_column(0x13)
     338$C$DW$T$37      .dwtag  DW_TAG_volatile_type
     339        .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$19)
     340
     341$C$DW$T$20      .dwtag  DW_TAG_structure_type
     342        .dwattr $C$DW$T$20, DW_AT_byte_size(0x04)
     343$C$DW$14        .dwtag  DW_TAG_member
     344        .dwattr $C$DW$14, DW_AT_type(*$C$DW$T$11)
     345        .dwattr $C$DW$14, DW_AT_name("IDLE_MODE")
     346        .dwattr $C$DW$14, DW_AT_TI_symbol_name("IDLE_MODE")
     347        .dwattr $C$DW$14, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x02)
     348        .dwattr $C$DW$14, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     349        .dwattr $C$DW$14, DW_AT_accessibility(DW_ACCESS_public)
     350        .dwattr $C$DW$14, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     351        .dwattr $C$DW$14, DW_AT_decl_line(0x37)
     352        .dwattr $C$DW$14, DW_AT_decl_column(0x0d)
     353$C$DW$15        .dwtag  DW_TAG_member
     354        .dwattr $C$DW$15, DW_AT_type(*$C$DW$T$11)
     355        .dwattr $C$DW$15, DW_AT_name("STANDBY_MODE")
     356        .dwattr $C$DW$15, DW_AT_TI_symbol_name("STANDBY_MODE")
     357        .dwattr $C$DW$15, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x02)
     358        .dwattr $C$DW$15, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     359        .dwattr $C$DW$15, DW_AT_accessibility(DW_ACCESS_public)
     360        .dwattr $C$DW$15, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     361        .dwattr $C$DW$15, DW_AT_decl_line(0x38)
     362        .dwattr $C$DW$15, DW_AT_decl_column(0x0d)
     363$C$DW$16        .dwtag  DW_TAG_member
     364        .dwattr $C$DW$16, DW_AT_type(*$C$DW$T$11)
     365        .dwattr $C$DW$16, DW_AT_name("STANDBY_INIT")
     366        .dwattr $C$DW$16, DW_AT_TI_symbol_name("STANDBY_INIT")
     367        .dwattr $C$DW$16, DW_AT_bit_offset(0x1b), DW_AT_bit_size(0x01)
     368        .dwattr $C$DW$16, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     369        .dwattr $C$DW$16, DW_AT_accessibility(DW_ACCESS_public)
     370        .dwattr $C$DW$16, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     371        .dwattr $C$DW$16, DW_AT_decl_line(0x39)
     372        .dwattr $C$DW$16, DW_AT_decl_column(0x0d)
     373$C$DW$17        .dwtag  DW_TAG_member
     374        .dwattr $C$DW$17, DW_AT_type(*$C$DW$T$11)
     375        .dwattr $C$DW$17, DW_AT_name("SUB_MWAIT")
     376        .dwattr $C$DW$17, DW_AT_TI_symbol_name("SUB_MWAIT")
     377        .dwattr $C$DW$17, DW_AT_bit_offset(0x1a), DW_AT_bit_size(0x01)
     378        .dwattr $C$DW$17, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     379        .dwattr $C$DW$17, DW_AT_accessibility(DW_ACCESS_public)
     380        .dwattr $C$DW$17, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     381        .dwattr $C$DW$17, DW_AT_decl_line(0x3a)
     382        .dwattr $C$DW$17, DW_AT_decl_column(0x0d)
     383$C$DW$18        .dwtag  DW_TAG_member
     384        .dwattr $C$DW$18, DW_AT_type(*$C$DW$T$11)
     385        .dwattr $C$DW$18, DW_AT_name("rsvd6")
PRU Assembler Unix v2.1.4 Thu Apr 12 02:56:25 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
hello-pru.asm                                                        PAGE    8

     386        .dwattr $C$DW$18, DW_AT_TI_symbol_name("rsvd6")
     387        .dwattr $C$DW$18, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1a)
     388        .dwattr $C$DW$18, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     389        .dwattr $C$DW$18, DW_AT_accessibility(DW_ACCESS_public)
     390        .dwattr $C$DW$18, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     391        .dwattr $C$DW$18, DW_AT_decl_line(0x3b)
     392        .dwattr $C$DW$18, DW_AT_decl_column(0x0d)
     393        .dwendtag $C$DW$T$20
     394
     395        .dwattr $C$DW$T$20, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
     396        .dwattr $C$DW$T$20, DW_AT_decl_line(0x36)
     397        .dwattr $C$DW$T$20, DW_AT_decl_column(0x13)
     398$C$DW$T$39      .dwtag  DW_TAG_volatile_type
     399        .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$20)
     400
     401$C$DW$T$21      .dwtag  DW_TAG_structure_type
     402        .dwattr $C$DW$T$21, DW_AT_byte_size(0x04)
     403$C$DW$19        .dwtag  DW_TAG_member
     404        .dwattr $C$DW$19, DW_AT_type(*$C$DW$T$11)
     405        .dwattr $C$DW$19, DW_AT_name("PRU0_GPI_MODE")
     406        .dwattr $C$DW$19, DW_AT_TI_symbol_name("PRU0_GPI_MODE")
     407        .dwattr $C$DW$19, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x02)
     408        .dwattr $C$DW$19, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     409        .dwattr $C$DW$19, DW_AT_accessibility(DW_ACCESS_public)
     410        .dwattr $C$DW$19, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     411        .dwattr $C$DW$19, DW_AT_decl_line(0x45)
     412        .dwattr $C$DW$19, DW_AT_decl_column(0x0d)
     413$C$DW$20        .dwtag  DW_TAG_member
     414        .dwattr $C$DW$20, DW_AT_type(*$C$DW$T$11)
     415        .dwattr $C$DW$20, DW_AT_name("PRU0_GPI_CLK_MODE")
     416        .dwattr $C$DW$20, DW_AT_TI_symbol_name("PRU0_GPI_CLK_MODE")
     417        .dwattr $C$DW$20, DW_AT_bit_offset(0x1d), DW_AT_bit_size(0x01)
     418        .dwattr $C$DW$20, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     419        .dwattr $C$DW$20, DW_AT_accessibility(DW_ACCESS_public)
     420        .dwattr $C$DW$20, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     421        .dwattr $C$DW$20, DW_AT_decl_line(0x46)
     422        .dwattr $C$DW$20, DW_AT_decl_column(0x0d)
     423$C$DW$21        .dwtag  DW_TAG_member
     424        .dwattr $C$DW$21, DW_AT_type(*$C$DW$T$11)
     425        .dwattr $C$DW$21, DW_AT_name("PRU0_GPI_DIV0")
     426        .dwattr $C$DW$21, DW_AT_TI_symbol_name("PRU0_GPI_DIV0")
     427        .dwattr $C$DW$21, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x05)
     428        .dwattr $C$DW$21, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     429        .dwattr $C$DW$21, DW_AT_accessibility(DW_ACCESS_public)
     430        .dwattr $C$DW$21, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     431        .dwattr $C$DW$21, DW_AT_decl_line(0x47)
     432        .dwattr $C$DW$21, DW_AT_decl_column(0x0d)
     433$C$DW$22        .dwtag  DW_TAG_member
     434        .dwattr $C$DW$22, DW_AT_type(*$C$DW$T$11)
     435        .dwattr $C$DW$22, DW_AT_name("PRU0_GPI_DIV1")
     436        .dwattr $C$DW$22, DW_AT_TI_symbol_name("PRU0_GPI_DIV1")
     437        .dwattr $C$DW$22, DW_AT_bit_offset(0x13), DW_AT_bit_size(0x05)
     438        .dwattr $C$DW$22, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     439        .dwattr $C$DW$22, DW_AT_accessibility(DW_ACCESS_public)
     440        .dwattr $C$DW$22, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
PRU Assembler Unix v2.1.4 Thu Apr 12 02:56:25 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
hello-pru.asm                                                        PAGE    9

     441        .dwattr $C$DW$22, DW_AT_decl_line(0x48)
     442        .dwattr $C$DW$22, DW_AT_decl_column(0x0d)
     443$C$DW$23        .dwtag  DW_TAG_member
     444        .dwattr $C$DW$23, DW_AT_type(*$C$DW$T$11)
     445        .dwattr $C$DW$23, DW_AT_name("PRU0_GPI_SB")
     446        .dwattr $C$DW$23, DW_AT_TI_symbol_name("PRU0_GPI_SB")
     447        .dwattr $C$DW$23, DW_AT_bit_offset(0x12), DW_AT_bit_size(0x01)
     448        .dwattr $C$DW$23, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     449        .dwattr $C$DW$23, DW_AT_accessibility(DW_ACCESS_public)
     450        .dwattr $C$DW$23, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     451        .dwattr $C$DW$23, DW_AT_decl_line(0x49)
     452        .dwattr $C$DW$23, DW_AT_decl_column(0x0d)
     453$C$DW$24        .dwtag  DW_TAG_member
     454        .dwattr $C$DW$24, DW_AT_type(*$C$DW$T$11)
     455        .dwattr $C$DW$24, DW_AT_name("PRU0_GPO_MODE")
     456        .dwattr $C$DW$24, DW_AT_TI_symbol_name("PRU0_GPO_MODE")
     457        .dwattr $C$DW$24, DW_AT_bit_offset(0x11), DW_AT_bit_size(0x01)
     458        .dwattr $C$DW$24, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     459        .dwattr $C$DW$24, DW_AT_accessibility(DW_ACCESS_public)
     460        .dwattr $C$DW$24, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     461        .dwattr $C$DW$24, DW_AT_decl_line(0x4a)
     462        .dwattr $C$DW$24, DW_AT_decl_column(0x0d)
     463$C$DW$25        .dwtag  DW_TAG_member
     464        .dwattr $C$DW$25, DW_AT_type(*$C$DW$T$11)
     465        .dwattr $C$DW$25, DW_AT_name("PRU0_GPO_DIV0")
     466        .dwattr $C$DW$25, DW_AT_TI_symbol_name("PRU0_GPO_DIV0")
     467        .dwattr $C$DW$25, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x05)
     468        .dwattr $C$DW$25, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     469        .dwattr $C$DW$25, DW_AT_accessibility(DW_ACCESS_public)
     470        .dwattr $C$DW$25, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     471        .dwattr $C$DW$25, DW_AT_decl_line(0x4b)
     472        .dwattr $C$DW$25, DW_AT_decl_column(0x0d)
     473$C$DW$26        .dwtag  DW_TAG_member
     474        .dwattr $C$DW$26, DW_AT_type(*$C$DW$T$11)
     475        .dwattr $C$DW$26, DW_AT_name("PRU0_GPO_DIV1")
     476        .dwattr $C$DW$26, DW_AT_TI_symbol_name("PRU0_GPO_DIV1")
     477        .dwattr $C$DW$26, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x05)
     478        .dwattr $C$DW$26, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     479        .dwattr $C$DW$26, DW_AT_accessibility(DW_ACCESS_public)
     480        .dwattr $C$DW$26, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     481        .dwattr $C$DW$26, DW_AT_decl_line(0x4c)
     482        .dwattr $C$DW$26, DW_AT_decl_column(0x0d)
     483$C$DW$27        .dwtag  DW_TAG_member
     484        .dwattr $C$DW$27, DW_AT_type(*$C$DW$T$11)
     485        .dwattr $C$DW$27, DW_AT_name("PRU0_GPO_SH_SEL")
     486        .dwattr $C$DW$27, DW_AT_TI_symbol_name("PRU0_GPO_SH_SEL")
     487        .dwattr $C$DW$27, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
     488        .dwattr $C$DW$27, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     489        .dwattr $C$DW$27, DW_AT_accessibility(DW_ACCESS_public)
     490        .dwattr $C$DW$27, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     491        .dwattr $C$DW$27, DW_AT_decl_line(0x4d)
     492        .dwattr $C$DW$27, DW_AT_decl_column(0x0d)
     493$C$DW$28        .dwtag  DW_TAG_member
     494        .dwattr $C$DW$28, DW_AT_type(*$C$DW$T$11)
     495        .dwattr $C$DW$28, DW_AT_name("rsvd26")
PRU Assembler Unix v2.1.4 Thu Apr 12 02:56:25 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
hello-pru.asm                                                        PAGE   10

     496        .dwattr $C$DW$28, DW_AT_TI_symbol_name("rsvd26")
     497        .dwattr $C$DW$28, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x06)
     498        .dwattr $C$DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     499        .dwattr $C$DW$28, DW_AT_accessibility(DW_ACCESS_public)
     500        .dwattr $C$DW$28, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     501        .dwattr $C$DW$28, DW_AT_decl_line(0x4e)
     502        .dwattr $C$DW$28, DW_AT_decl_column(0x0d)
     503        .dwendtag $C$DW$T$21
     504
     505        .dwattr $C$DW$T$21, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
     506        .dwattr $C$DW$T$21, DW_AT_decl_line(0x44)
     507        .dwattr $C$DW$T$21, DW_AT_decl_column(0x13)
     508$C$DW$T$41      .dwtag  DW_TAG_volatile_type
     509        .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$21)
     510
     511$C$DW$T$22      .dwtag  DW_TAG_structure_type
     512        .dwattr $C$DW$T$22, DW_AT_byte_size(0x04)
     513$C$DW$29        .dwtag  DW_TAG_member
     514        .dwattr $C$DW$29, DW_AT_type(*$C$DW$T$11)
     515        .dwattr $C$DW$29, DW_AT_name("PRU1_GPI_MODE")
     516        .dwattr $C$DW$29, DW_AT_TI_symbol_name("PRU1_GPI_MODE")
     517        .dwattr $C$DW$29, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x02)
     518        .dwattr $C$DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     519        .dwattr $C$DW$29, DW_AT_accessibility(DW_ACCESS_public)
     520        .dwattr $C$DW$29, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     521        .dwattr $C$DW$29, DW_AT_decl_line(0x58)
     522        .dwattr $C$DW$29, DW_AT_decl_column(0x0d)
     523$C$DW$30        .dwtag  DW_TAG_member
     524        .dwattr $C$DW$30, DW_AT_type(*$C$DW$T$11)
     525        .dwattr $C$DW$30, DW_AT_name("PRU1_GPI_CLK_MODE")
     526        .dwattr $C$DW$30, DW_AT_TI_symbol_name("PRU1_GPI_CLK_MODE")
     527        .dwattr $C$DW$30, DW_AT_bit_offset(0x1d), DW_AT_bit_size(0x01)
     528        .dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     529        .dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
     530        .dwattr $C$DW$30, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     531        .dwattr $C$DW$30, DW_AT_decl_line(0x59)
     532        .dwattr $C$DW$30, DW_AT_decl_column(0x0d)
     533$C$DW$31        .dwtag  DW_TAG_member
     534        .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$11)
     535        .dwattr $C$DW$31, DW_AT_name("PRU1_GPI_DIV0")
     536        .dwattr $C$DW$31, DW_AT_TI_symbol_name("PRU1_GPI_DIV0")
     537        .dwattr $C$DW$31, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x05)
     538        .dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     539        .dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
     540        .dwattr $C$DW$31, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     541        .dwattr $C$DW$31, DW_AT_decl_line(0x5a)
     542        .dwattr $C$DW$31, DW_AT_decl_column(0x0d)
     543$C$DW$32        .dwtag  DW_TAG_member
     544        .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$11)
     545        .dwattr $C$DW$32, DW_AT_name("PRU1_GPI_DIV1")
     546        .dwattr $C$DW$32, DW_AT_TI_symbol_name("PRU1_GPI_DIV1")
     547        .dwattr $C$DW$32, DW_AT_bit_offset(0x13), DW_AT_bit_size(0x05)
     548        .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     549        .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
     550        .dwattr $C$DW$32, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
PRU Assembler Unix v2.1.4 Thu Apr 12 02:56:25 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
hello-pru.asm                                                        PAGE   11

     551        .dwattr $C$DW$32, DW_AT_decl_line(0x5b)
     552        .dwattr $C$DW$32, DW_AT_decl_column(0x0d)
     553$C$DW$33        .dwtag  DW_TAG_member
     554        .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$11)
     555        .dwattr $C$DW$33, DW_AT_name("PRU1_GPI_SB")
     556        .dwattr $C$DW$33, DW_AT_TI_symbol_name("PRU1_GPI_SB")
     557        .dwattr $C$DW$33, DW_AT_bit_offset(0x12), DW_AT_bit_size(0x01)
     558        .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     559        .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
     560        .dwattr $C$DW$33, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     561        .dwattr $C$DW$33, DW_AT_decl_line(0x5c)
     562        .dwattr $C$DW$33, DW_AT_decl_column(0x0d)
     563$C$DW$34        .dwtag  DW_TAG_member
     564        .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$11)
     565        .dwattr $C$DW$34, DW_AT_name("PRU1_GPO_MODE")
     566        .dwattr $C$DW$34, DW_AT_TI_symbol_name("PRU1_GPO_MODE")
     567        .dwattr $C$DW$34, DW_AT_bit_offset(0x11), DW_AT_bit_size(0x01)
     568        .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     569        .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
     570        .dwattr $C$DW$34, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     571        .dwattr $C$DW$34, DW_AT_decl_line(0x5d)
     572        .dwattr $C$DW$34, DW_AT_decl_column(0x0d)
     573$C$DW$35        .dwtag  DW_TAG_member
     574        .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$11)
     575        .dwattr $C$DW$35, DW_AT_name("PRU1_GPO_DIV0")
     576        .dwattr $C$DW$35, DW_AT_TI_symbol_name("PRU1_GPO_DIV0")
     577        .dwattr $C$DW$35, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x05)
     578        .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     579        .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
     580        .dwattr $C$DW$35, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     581        .dwattr $C$DW$35, DW_AT_decl_line(0x5e)
     582        .dwattr $C$DW$35, DW_AT_decl_column(0x0d)
     583$C$DW$36        .dwtag  DW_TAG_member
     584        .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$11)
     585        .dwattr $C$DW$36, DW_AT_name("PRU1_GPO_DIV1")
     586        .dwattr $C$DW$36, DW_AT_TI_symbol_name("PRU1_GPO_DIV1")
     587        .dwattr $C$DW$36, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x05)
     588        .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     589        .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
     590        .dwattr $C$DW$36, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     591        .dwattr $C$DW$36, DW_AT_decl_line(0x5f)
     592        .dwattr $C$DW$36, DW_AT_decl_column(0x0d)
     593$C$DW$37        .dwtag  DW_TAG_member
     594        .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$11)
     595        .dwattr $C$DW$37, DW_AT_name("PRU1_GPO_SH_SEL")
     596        .dwattr $C$DW$37, DW_AT_TI_symbol_name("PRU1_GPO_SH_SEL")
     597        .dwattr $C$DW$37, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
     598        .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     599        .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
     600        .dwattr $C$DW$37, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     601        .dwattr $C$DW$37, DW_AT_decl_line(0x60)
     602        .dwattr $C$DW$37, DW_AT_decl_column(0x0d)
     603$C$DW$38        .dwtag  DW_TAG_member
     604        .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$11)
     605        .dwattr $C$DW$38, DW_AT_name("rsvd26")
PRU Assembler Unix v2.1.4 Thu Apr 12 02:56:25 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
hello-pru.asm                                                        PAGE   12

     606        .dwattr $C$DW$38, DW_AT_TI_symbol_name("rsvd26")
     607        .dwattr $C$DW$38, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x06)
     608        .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     609        .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
     610        .dwattr $C$DW$38, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     611        .dwattr $C$DW$38, DW_AT_decl_line(0x61)
     612        .dwattr $C$DW$38, DW_AT_decl_column(0x0d)
     613        .dwendtag $C$DW$T$22
     614
     615        .dwattr $C$DW$T$22, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
     616        .dwattr $C$DW$T$22, DW_AT_decl_line(0x57)
     617        .dwattr $C$DW$T$22, DW_AT_decl_column(0x13)
     618$C$DW$T$43      .dwtag  DW_TAG_volatile_type
     619        .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$22)
     620
     621$C$DW$T$23      .dwtag  DW_TAG_structure_type
     622        .dwattr $C$DW$T$23, DW_AT_byte_size(0x04)
     623$C$DW$39        .dwtag  DW_TAG_member
     624        .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$11)
     625        .dwattr $C$DW$39, DW_AT_name("PRU0_CLK_STOP_REQ")
     626        .dwattr $C$DW$39, DW_AT_TI_symbol_name("PRU0_CLK_STOP_REQ")
     627        .dwattr $C$DW$39, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
     628        .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     629        .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
     630        .dwattr $C$DW$39, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     631        .dwattr $C$DW$39, DW_AT_decl_line(0x6b)
     632        .dwattr $C$DW$39, DW_AT_decl_column(0x0d)
     633$C$DW$40        .dwtag  DW_TAG_member
     634        .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$11)
     635        .dwattr $C$DW$40, DW_AT_name("PRU0_CLK_STOP_ACK")
     636        .dwattr $C$DW$40, DW_AT_TI_symbol_name("PRU0_CLK_STOP_ACK")
     637        .dwattr $C$DW$40, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x01)
     638        .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     639        .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     640        .dwattr $C$DW$40, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     641        .dwattr $C$DW$40, DW_AT_decl_line(0x6c)
     642        .dwattr $C$DW$40, DW_AT_decl_column(0x0d)
     643$C$DW$41        .dwtag  DW_TAG_member
     644        .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$11)
     645        .dwattr $C$DW$41, DW_AT_name("PRU0_CLK_EN")
     646        .dwattr $C$DW$41, DW_AT_TI_symbol_name("PRU0_CLK_EN")
     647        .dwattr $C$DW$41, DW_AT_bit_offset(0x1d), DW_AT_bit_size(0x01)
     648        .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     649        .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
     650        .dwattr $C$DW$41, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     651        .dwattr $C$DW$41, DW_AT_decl_line(0x6d)
     652        .dwattr $C$DW$41, DW_AT_decl_column(0x0d)
     653$C$DW$42        .dwtag  DW_TAG_member
     654        .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$11)
     655        .dwattr $C$DW$42, DW_AT_name("PRU1_CLK_STOP_REQ")
     656        .dwattr $C$DW$42, DW_AT_TI_symbol_name("PRU1_CLK_STOP_REQ")
     657        .dwattr $C$DW$42, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x01)
     658        .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     659        .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     660        .dwattr $C$DW$42, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
PRU Assembler Unix v2.1.4 Thu Apr 12 02:56:25 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
hello-pru.asm                                                        PAGE   13

     661        .dwattr $C$DW$42, DW_AT_decl_line(0x6e)
     662        .dwattr $C$DW$42, DW_AT_decl_column(0x0d)
     663$C$DW$43        .dwtag  DW_TAG_member
     664        .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$11)
     665        .dwattr $C$DW$43, DW_AT_name("PRU1_CLK_STOP_ACK")
     666        .dwattr $C$DW$43, DW_AT_TI_symbol_name("PRU1_CLK_STOP_ACK")
     667        .dwattr $C$DW$43, DW_AT_bit_offset(0x1b), DW_AT_bit_size(0x01)
     668        .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     669        .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     670        .dwattr $C$DW$43, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     671        .dwattr $C$DW$43, DW_AT_decl_line(0x6f)
     672        .dwattr $C$DW$43, DW_AT_decl_column(0x0d)
     673$C$DW$44        .dwtag  DW_TAG_member
     674        .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$11)
     675        .dwattr $C$DW$44, DW_AT_name("PRU1_CLK_EN")
     676        .dwattr $C$DW$44, DW_AT_TI_symbol_name("PRU1_CLK_EN")
     677        .dwattr $C$DW$44, DW_AT_bit_offset(0x1a), DW_AT_bit_size(0x01)
     678        .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     679        .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     680        .dwattr $C$DW$44, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     681        .dwattr $C$DW$44, DW_AT_decl_line(0x70)
     682        .dwattr $C$DW$44, DW_AT_decl_column(0x0d)
     683$C$DW$45        .dwtag  DW_TAG_member
     684        .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$11)
     685        .dwattr $C$DW$45, DW_AT_name("INTC_CLK_STOP_REQ")
     686        .dwattr $C$DW$45, DW_AT_TI_symbol_name("INTC_CLK_STOP_REQ")
     687        .dwattr $C$DW$45, DW_AT_bit_offset(0x19), DW_AT_bit_size(0x01)
     688        .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     689        .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     690        .dwattr $C$DW$45, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     691        .dwattr $C$DW$45, DW_AT_decl_line(0x71)
     692        .dwattr $C$DW$45, DW_AT_decl_column(0x0d)
     693$C$DW$46        .dwtag  DW_TAG_member
     694        .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$11)
     695        .dwattr $C$DW$46, DW_AT_name("INTC_CLK_STOP_ACK")
     696        .dwattr $C$DW$46, DW_AT_TI_symbol_name("INTC_CLK_STOP_ACK")
     697        .dwattr $C$DW$46, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x01)
     698        .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     699        .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     700        .dwattr $C$DW$46, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     701        .dwattr $C$DW$46, DW_AT_decl_line(0x72)
     702        .dwattr $C$DW$46, DW_AT_decl_column(0x0d)
     703$C$DW$47        .dwtag  DW_TAG_member
     704        .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$11)
     705        .dwattr $C$DW$47, DW_AT_name("INTC_CLK_EN")
     706        .dwattr $C$DW$47, DW_AT_TI_symbol_name("INTC_CLK_EN")
     707        .dwattr $C$DW$47, DW_AT_bit_offset(0x17), DW_AT_bit_size(0x01)
     708        .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     709        .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     710        .dwattr $C$DW$47, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     711        .dwattr $C$DW$47, DW_AT_decl_line(0x73)
     712        .dwattr $C$DW$47, DW_AT_decl_column(0x0d)
     713$C$DW$48        .dwtag  DW_TAG_member
     714        .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$11)
     715        .dwattr $C$DW$48, DW_AT_name("UART_CLK_STOP_REQ")
PRU Assembler Unix v2.1.4 Thu Apr 12 02:56:25 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
hello-pru.asm                                                        PAGE   14

     716        .dwattr $C$DW$48, DW_AT_TI_symbol_name("UART_CLK_STOP_REQ")
     717        .dwattr $C$DW$48, DW_AT_bit_offset(0x16), DW_AT_bit_size(0x01)
     718        .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     719        .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     720        .dwattr $C$DW$48, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     721        .dwattr $C$DW$48, DW_AT_decl_line(0x74)
     722        .dwattr $C$DW$48, DW_AT_decl_column(0x0d)
     723$C$DW$49        .dwtag  DW_TAG_member
     724        .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$11)
     725        .dwattr $C$DW$49, DW_AT_name("UART_CLK_STOP_ACK")
     726        .dwattr $C$DW$49, DW_AT_TI_symbol_name("UART_CLK_STOP_ACK")
     727        .dwattr $C$DW$49, DW_AT_bit_offset(0x15), DW_AT_bit_size(0x01)
     728        .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     729        .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     730        .dwattr $C$DW$49, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     731        .dwattr $C$DW$49, DW_AT_decl_line(0x75)
     732        .dwattr $C$DW$49, DW_AT_decl_column(0x0d)
     733$C$DW$50        .dwtag  DW_TAG_member
     734        .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$11)
     735        .dwattr $C$DW$50, DW_AT_name("UART_CLK_EN")
     736        .dwattr $C$DW$50, DW_AT_TI_symbol_name("UART_CLK_EN")
     737        .dwattr $C$DW$50, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x01)
     738        .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     739        .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     740        .dwattr $C$DW$50, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     741        .dwattr $C$DW$50, DW_AT_decl_line(0x76)
     742        .dwattr $C$DW$50, DW_AT_decl_column(0x0d)
     743$C$DW$51        .dwtag  DW_TAG_member
     744        .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$11)
     745        .dwattr $C$DW$51, DW_AT_name("ECAP_CLK_STOP_REQ")
     746        .dwattr $C$DW$51, DW_AT_TI_symbol_name("ECAP_CLK_STOP_REQ")
     747        .dwattr $C$DW$51, DW_AT_bit_offset(0x13), DW_AT_bit_size(0x01)
     748        .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     749        .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     750        .dwattr $C$DW$51, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     751        .dwattr $C$DW$51, DW_AT_decl_line(0x77)
     752        .dwattr $C$DW$51, DW_AT_decl_column(0x0d)
     753$C$DW$52        .dwtag  DW_TAG_member
     754        .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$11)
     755        .dwattr $C$DW$52, DW_AT_name("ECAP_CLK_STOP_ACK")
     756        .dwattr $C$DW$52, DW_AT_TI_symbol_name("ECAP_CLK_STOP_ACK")
     757        .dwattr $C$DW$52, DW_AT_bit_offset(0x12), DW_AT_bit_size(0x01)
     758        .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     759        .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     760        .dwattr $C$DW$52, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     761        .dwattr $C$DW$52, DW_AT_decl_line(0x78)
     762        .dwattr $C$DW$52, DW_AT_decl_column(0x0d)
     763$C$DW$53        .dwtag  DW_TAG_member
     764        .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$11)
     765        .dwattr $C$DW$53, DW_AT_name("ECAP_CLK_EN")
     766        .dwattr $C$DW$53, DW_AT_TI_symbol_name("ECAP_CLK_EN")
     767        .dwattr $C$DW$53, DW_AT_bit_offset(0x11), DW_AT_bit_size(0x01)
     768        .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     769        .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     770        .dwattr $C$DW$53, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
PRU Assembler Unix v2.1.4 Thu Apr 12 02:56:25 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
hello-pru.asm                                                        PAGE   15

     771        .dwattr $C$DW$53, DW_AT_decl_line(0x79)
     772        .dwattr $C$DW$53, DW_AT_decl_column(0x0d)
     773$C$DW$54        .dwtag  DW_TAG_member
     774        .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$11)
     775        .dwattr $C$DW$54, DW_AT_name("IEP_CLK_STOP_REQ")
     776        .dwattr $C$DW$54, DW_AT_TI_symbol_name("IEP_CLK_STOP_REQ")
     777        .dwattr $C$DW$54, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x01)
     778        .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     779        .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     780        .dwattr $C$DW$54, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     781        .dwattr $C$DW$54, DW_AT_decl_line(0x7a)
     782        .dwattr $C$DW$54, DW_AT_decl_column(0x0d)
     783$C$DW$55        .dwtag  DW_TAG_member
     784        .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$11)
     785        .dwattr $C$DW$55, DW_AT_name("IEP_CLK_STOP_ACK")
     786        .dwattr $C$DW$55, DW_AT_TI_symbol_name("IEP_CLK_STOP_ACK")
     787        .dwattr $C$DW$55, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
     788        .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     789        .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     790        .dwattr $C$DW$55, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     791        .dwattr $C$DW$55, DW_AT_decl_line(0x7b)
     792        .dwattr $C$DW$55, DW_AT_decl_column(0x0d)
     793$C$DW$56        .dwtag  DW_TAG_member
     794        .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$11)
     795        .dwattr $C$DW$56, DW_AT_name("IEP_CLK_EN")
     796        .dwattr $C$DW$56, DW_AT_TI_symbol_name("IEP_CLK_EN")
     797        .dwattr $C$DW$56, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
     798        .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     799        .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     800        .dwattr $C$DW$56, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     801        .dwattr $C$DW$56, DW_AT_decl_line(0x7c)
     802        .dwattr $C$DW$56, DW_AT_decl_column(0x0d)
     803$C$DW$57        .dwtag  DW_TAG_member
     804        .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$11)
     805        .dwattr $C$DW$57, DW_AT_name("rsvd18")
     806        .dwattr $C$DW$57, DW_AT_TI_symbol_name("rsvd18")
     807        .dwattr $C$DW$57, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0e)
     808        .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     809        .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     810        .dwattr $C$DW$57, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     811        .dwattr $C$DW$57, DW_AT_decl_line(0x7d)
     812        .dwattr $C$DW$57, DW_AT_decl_column(0x0d)
     813        .dwendtag $C$DW$T$23
     814
     815        .dwattr $C$DW$T$23, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
     816        .dwattr $C$DW$T$23, DW_AT_decl_line(0x6a)
     817        .dwattr $C$DW$T$23, DW_AT_decl_column(0x13)
     818$C$DW$T$45      .dwtag  DW_TAG_volatile_type
     819        .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$23)
     820
     821$C$DW$T$24      .dwtag  DW_TAG_structure_type
     822        .dwattr $C$DW$T$24, DW_AT_byte_size(0x04)
     823$C$DW$58        .dwtag  DW_TAG_member
     824        .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$11)
     825        .dwattr $C$DW$58, DW_AT_name("PRU0_IMEM_PE_RAW")
PRU Assembler Unix v2.1.4 Thu Apr 12 02:56:25 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
hello-pru.asm                                                        PAGE   16

     826        .dwattr $C$DW$58, DW_AT_TI_symbol_name("PRU0_IMEM_PE_RAW")
     827        .dwattr $C$DW$58, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x04)
     828        .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     829        .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     830        .dwattr $C$DW$58, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     831        .dwattr $C$DW$58, DW_AT_decl_line(0x87)
     832        .dwattr $C$DW$58, DW_AT_decl_column(0x0d)
     833$C$DW$59        .dwtag  DW_TAG_member
     834        .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$11)
     835        .dwattr $C$DW$59, DW_AT_name("PRU0_DMEM_PE_RAW")
     836        .dwattr $C$DW$59, DW_AT_TI_symbol_name("PRU0_DMEM_PE_RAW")
     837        .dwattr $C$DW$59, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x04)
     838        .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     839        .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     840        .dwattr $C$DW$59, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     841        .dwattr $C$DW$59, DW_AT_decl_line(0x88)
     842        .dwattr $C$DW$59, DW_AT_decl_column(0x0d)
     843$C$DW$60        .dwtag  DW_TAG_member
     844        .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$11)
     845        .dwattr $C$DW$60, DW_AT_name("PRU1_IMEM_PE_RAW")
     846        .dwattr $C$DW$60, DW_AT_TI_symbol_name("PRU1_IMEM_PE_RAW")
     847        .dwattr $C$DW$60, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x04)
     848        .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     849        .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     850        .dwattr $C$DW$60, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     851        .dwattr $C$DW$60, DW_AT_decl_line(0x89)
     852        .dwattr $C$DW$60, DW_AT_decl_column(0x0d)
     853$C$DW$61        .dwtag  DW_TAG_member
     854        .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$11)
     855        .dwattr $C$DW$61, DW_AT_name("PRU1_DMEM_PE_RAW")
     856        .dwattr $C$DW$61, DW_AT_TI_symbol_name("PRU1_DMEM_PE_RAW")
     857        .dwattr $C$DW$61, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x04)
     858        .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     859        .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     860        .dwattr $C$DW$61, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     861        .dwattr $C$DW$61, DW_AT_decl_line(0x8a)
     862        .dwattr $C$DW$61, DW_AT_decl_column(0x0d)
     863$C$DW$62        .dwtag  DW_TAG_member
     864        .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$11)
     865        .dwattr $C$DW$62, DW_AT_name("RAM_PE_RAW")
     866        .dwattr $C$DW$62, DW_AT_TI_symbol_name("RAM_PE_RAW")
     867        .dwattr $C$DW$62, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
     868        .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     869        .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     870        .dwattr $C$DW$62, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     871        .dwattr $C$DW$62, DW_AT_decl_line(0x8b)
     872        .dwattr $C$DW$62, DW_AT_decl_column(0x0d)
     873$C$DW$63        .dwtag  DW_TAG_member
     874        .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$11)
     875        .dwattr $C$DW$63, DW_AT_name("rsvd20")
     876        .dwattr $C$DW$63, DW_AT_TI_symbol_name("rsvd20")
     877        .dwattr $C$DW$63, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
     878        .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     879        .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     880        .dwattr $C$DW$63, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
PRU Assembler Unix v2.1.4 Thu Apr 12 02:56:25 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
hello-pru.asm                                                        PAGE   17

     881        .dwattr $C$DW$63, DW_AT_decl_line(0x8c)
     882        .dwattr $C$DW$63, DW_AT_decl_column(0x0d)
     883        .dwendtag $C$DW$T$24
     884
     885        .dwattr $C$DW$T$24, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
     886        .dwattr $C$DW$T$24, DW_AT_decl_line(0x86)
     887        .dwattr $C$DW$T$24, DW_AT_decl_column(0x14)
     888$C$DW$T$47      .dwtag  DW_TAG_volatile_type
     889        .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$24)
     890
     891$C$DW$T$25      .dwtag  DW_TAG_structure_type
     892        .dwattr $C$DW$T$25, DW_AT_byte_size(0x04)
     893$C$DW$64        .dwtag  DW_TAG_member
     894        .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$11)
     895        .dwattr $C$DW$64, DW_AT_name("PRU0_IMEM_PE")
     896        .dwattr $C$DW$64, DW_AT_TI_symbol_name("PRU0_IMEM_PE")
     897        .dwattr $C$DW$64, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x04)
     898        .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     899        .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     900        .dwattr $C$DW$64, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     901        .dwattr $C$DW$64, DW_AT_decl_line(0x96)
     902        .dwattr $C$DW$64, DW_AT_decl_column(0x0d)
     903$C$DW$65        .dwtag  DW_TAG_member
     904        .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$11)
     905        .dwattr $C$DW$65, DW_AT_name("PRU0_DMEM_PE")
     906        .dwattr $C$DW$65, DW_AT_TI_symbol_name("PRU0_DMEM_PE")
     907        .dwattr $C$DW$65, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x04)
     908        .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     909        .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     910        .dwattr $C$DW$65, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     911        .dwattr $C$DW$65, DW_AT_decl_line(0x97)
     912        .dwattr $C$DW$65, DW_AT_decl_column(0x0d)
     913$C$DW$66        .dwtag  DW_TAG_member
     914        .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$11)
     915        .dwattr $C$DW$66, DW_AT_name("PRU1_IMEM_PE")
     916        .dwattr $C$DW$66, DW_AT_TI_symbol_name("PRU1_IMEM_PE")
     917        .dwattr $C$DW$66, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x04)
     918        .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     919        .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     920        .dwattr $C$DW$66, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     921        .dwattr $C$DW$66, DW_AT_decl_line(0x98)
     922        .dwattr $C$DW$66, DW_AT_decl_column(0x0d)
     923$C$DW$67        .dwtag  DW_TAG_member
     924        .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$11)
     925        .dwattr $C$DW$67, DW_AT_name("PRU1_DMEM_PE")
     926        .dwattr $C$DW$67, DW_AT_TI_symbol_name("PRU1_DMEM_PE")
     927        .dwattr $C$DW$67, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x04)
     928        .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     929        .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
     930        .dwattr $C$DW$67, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     931        .dwattr $C$DW$67, DW_AT_decl_line(0x99)
     932        .dwattr $C$DW$67, DW_AT_decl_column(0x0d)
     933$C$DW$68        .dwtag  DW_TAG_member
     934        .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$11)
     935        .dwattr $C$DW$68, DW_AT_name("RAM_PE")
PRU Assembler Unix v2.1.4 Thu Apr 12 02:56:25 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
hello-pru.asm                                                        PAGE   18

     936        .dwattr $C$DW$68, DW_AT_TI_symbol_name("RAM_PE")
     937        .dwattr $C$DW$68, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
     938        .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     939        .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
     940        .dwattr $C$DW$68, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     941        .dwattr $C$DW$68, DW_AT_decl_line(0x9a)
     942        .dwattr $C$DW$68, DW_AT_decl_column(0x0d)
     943$C$DW$69        .dwtag  DW_TAG_member
     944        .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$11)
     945        .dwattr $C$DW$69, DW_AT_name("rsvd20")
     946        .dwattr $C$DW$69, DW_AT_TI_symbol_name("rsvd20")
     947        .dwattr $C$DW$69, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
     948        .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     949        .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
     950        .dwattr $C$DW$69, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     951        .dwattr $C$DW$69, DW_AT_decl_line(0x9b)
     952        .dwattr $C$DW$69, DW_AT_decl_column(0x0d)
     953        .dwendtag $C$DW$T$25
     954
     955        .dwattr $C$DW$T$25, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
     956        .dwattr $C$DW$T$25, DW_AT_decl_line(0x95)
     957        .dwattr $C$DW$T$25, DW_AT_decl_column(0x14)
     958$C$DW$T$49      .dwtag  DW_TAG_volatile_type
     959        .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$25)
     960
     961$C$DW$T$26      .dwtag  DW_TAG_structure_type
     962        .dwattr $C$DW$T$26, DW_AT_byte_size(0x04)
     963$C$DW$70        .dwtag  DW_TAG_member
     964        .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$11)
     965        .dwattr $C$DW$70, DW_AT_name("PRU0_IMEM_PE_SET")
     966        .dwattr $C$DW$70, DW_AT_TI_symbol_name("PRU0_IMEM_PE_SET")
     967        .dwattr $C$DW$70, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x04)
     968        .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     969        .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
     970        .dwattr $C$DW$70, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     971        .dwattr $C$DW$70, DW_AT_decl_line(0xa4)
     972        .dwattr $C$DW$70, DW_AT_decl_column(0x0d)
     973$C$DW$71        .dwtag  DW_TAG_member
     974        .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$11)
     975        .dwattr $C$DW$71, DW_AT_name("PRU0_DMEM_PE_SET")
     976        .dwattr $C$DW$71, DW_AT_TI_symbol_name("PRU0_DMEM_PE_SET")
     977        .dwattr $C$DW$71, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x04)
     978        .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     979        .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
     980        .dwattr $C$DW$71, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
     981        .dwattr $C$DW$71, DW_AT_decl_line(0xa5)
     982        .dwattr $C$DW$71, DW_AT_decl_column(0x0d)
     983$C$DW$72        .dwtag  DW_TAG_member
     984        .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$11)
     985        .dwattr $C$DW$72, DW_AT_name("PRU1_IMEM_PE_SET")
     986        .dwattr $C$DW$72, DW_AT_TI_symbol_name("PRU1_IMEM_PE_SET")
     987        .dwattr $C$DW$72, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x04)
     988        .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     989        .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
     990        .dwattr $C$DW$72, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
PRU Assembler Unix v2.1.4 Thu Apr 12 02:56:25 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
hello-pru.asm                                                        PAGE   19

     991        .dwattr $C$DW$72, DW_AT_decl_line(0xa6)
     992        .dwattr $C$DW$72, DW_AT_decl_column(0x0d)
     993$C$DW$73        .dwtag  DW_TAG_member
     994        .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$11)
     995        .dwattr $C$DW$73, DW_AT_name("PRU1_DMEM_PE_SET")
     996        .dwattr $C$DW$73, DW_AT_TI_symbol_name("PRU1_DMEM_PE_SET")
     997        .dwattr $C$DW$73, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x04)
     998        .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     999        .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
    1000        .dwattr $C$DW$73, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1001        .dwattr $C$DW$73, DW_AT_decl_line(0xa7)
    1002        .dwattr $C$DW$73, DW_AT_decl_column(0x0d)
    1003$C$DW$74        .dwtag  DW_TAG_member
    1004        .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$11)
    1005        .dwattr $C$DW$74, DW_AT_name("RAM_PE_SET")
    1006        .dwattr $C$DW$74, DW_AT_TI_symbol_name("RAM_PE_SET")
    1007        .dwattr $C$DW$74, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
    1008        .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1009        .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
    1010        .dwattr $C$DW$74, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1011        .dwattr $C$DW$74, DW_AT_decl_line(0xa8)
    1012        .dwattr $C$DW$74, DW_AT_decl_column(0x0d)
    1013$C$DW$75        .dwtag  DW_TAG_member
    1014        .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$11)
    1015        .dwattr $C$DW$75, DW_AT_name("rsvd20")
    1016        .dwattr $C$DW$75, DW_AT_TI_symbol_name("rsvd20")
    1017        .dwattr $C$DW$75, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
    1018        .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1019        .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
    1020        .dwattr $C$DW$75, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1021        .dwattr $C$DW$75, DW_AT_decl_line(0xa9)
    1022        .dwattr $C$DW$75, DW_AT_decl_column(0x0d)
    1023        .dwendtag $C$DW$T$26
    1024
    1025        .dwattr $C$DW$T$26, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1026        .dwattr $C$DW$T$26, DW_AT_decl_line(0xa3)
    1027        .dwattr $C$DW$T$26, DW_AT_decl_column(0x13)
    1028$C$DW$T$51      .dwtag  DW_TAG_volatile_type
    1029        .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$26)
    1030
    1031$C$DW$T$27      .dwtag  DW_TAG_structure_type
    1032        .dwattr $C$DW$T$27, DW_AT_byte_size(0x04)
    1033$C$DW$76        .dwtag  DW_TAG_member
    1034        .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$11)
    1035        .dwattr $C$DW$76, DW_AT_name("PRU0_IMEM_PE_CLR")
    1036        .dwattr $C$DW$76, DW_AT_TI_symbol_name("PRU0_IMEM_PE_CLR")
    1037        .dwattr $C$DW$76, DW_AT_bit_offset(0x1c), DW_AT_bit_size(0x04)
    1038        .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1039        .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    1040        .dwattr $C$DW$76, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1041        .dwattr $C$DW$76, DW_AT_decl_line(0xb3)
    1042        .dwattr $C$DW$76, DW_AT_decl_column(0x0d)
    1043$C$DW$77        .dwtag  DW_TAG_member
    1044        .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$11)
    1045        .dwattr $C$DW$77, DW_AT_name("PRU0_DMEM_PE_CLR")
PRU Assembler Unix v2.1.4 Thu Apr 12 02:56:25 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
hello-pru.asm                                                        PAGE   20

    1046        .dwattr $C$DW$77, DW_AT_TI_symbol_name("PRU0_DMEM_PE_CLR")
    1047        .dwattr $C$DW$77, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x04)
    1048        .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1049        .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1050        .dwattr $C$DW$77, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1051        .dwattr $C$DW$77, DW_AT_decl_line(0xb4)
    1052        .dwattr $C$DW$77, DW_AT_decl_column(0x0d)
    1053$C$DW$78        .dwtag  DW_TAG_member
    1054        .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$11)
    1055        .dwattr $C$DW$78, DW_AT_name("PRU1_IMEM_PE_CLR")
    1056        .dwattr $C$DW$78, DW_AT_TI_symbol_name("PRU1_IMEM_PE_CLR")
    1057        .dwattr $C$DW$78, DW_AT_bit_offset(0x14), DW_AT_bit_size(0x04)
    1058        .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1059        .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1060        .dwattr $C$DW$78, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1061        .dwattr $C$DW$78, DW_AT_decl_line(0xb5)
    1062        .dwattr $C$DW$78, DW_AT_decl_column(0x0d)
    1063$C$DW$79        .dwtag  DW_TAG_member
    1064        .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$11)
    1065        .dwattr $C$DW$79, DW_AT_name("PRU1_DMEM_PE_CLR")
    1066        .dwattr $C$DW$79, DW_AT_TI_symbol_name("PRU1_DMEM_PE_CLR")
    1067        .dwattr $C$DW$79, DW_AT_bit_offset(0x10), DW_AT_bit_size(0x04)
    1068        .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1069        .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1070        .dwattr $C$DW$79, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1071        .dwattr $C$DW$79, DW_AT_decl_line(0xb6)
    1072        .dwattr $C$DW$79, DW_AT_decl_column(0x0d)
    1073$C$DW$80        .dwtag  DW_TAG_member
    1074        .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$11)
    1075        .dwattr $C$DW$80, DW_AT_name("rsvd16")
    1076        .dwattr $C$DW$80, DW_AT_TI_symbol_name("rsvd16")
    1077        .dwattr $C$DW$80, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x10)
    1078        .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1079        .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1080        .dwattr $C$DW$80, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1081        .dwattr $C$DW$80, DW_AT_decl_line(0xb7)
    1082        .dwattr $C$DW$80, DW_AT_decl_column(0x0d)
    1083        .dwendtag $C$DW$T$27
    1084
    1085        .dwattr $C$DW$T$27, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1086        .dwattr $C$DW$T$27, DW_AT_decl_line(0xb2)
    1087        .dwattr $C$DW$T$27, DW_AT_decl_column(0x13)
    1088$C$DW$T$53      .dwtag  DW_TAG_volatile_type
    1089        .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$27)
    1090
    1091$C$DW$T$28      .dwtag  DW_TAG_structure_type
    1092        .dwattr $C$DW$T$28, DW_AT_byte_size(0x04)
    1093$C$DW$81        .dwtag  DW_TAG_member
    1094        .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$11)
    1095        .dwattr $C$DW$81, DW_AT_name("PMAO_PRU0")
    1096        .dwattr $C$DW$81, DW_AT_TI_symbol_name("PMAO_PRU0")
    1097        .dwattr $C$DW$81, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
    1098        .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1099        .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1100        .dwattr $C$DW$81, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
PRU Assembler Unix v2.1.4 Thu Apr 12 02:56:25 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
hello-pru.asm                                                        PAGE   21

    1101        .dwattr $C$DW$81, DW_AT_decl_line(0xc4)
    1102        .dwattr $C$DW$81, DW_AT_decl_column(0x0d)
    1103$C$DW$82        .dwtag  DW_TAG_member
    1104        .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$11)
    1105        .dwattr $C$DW$82, DW_AT_name("PMAO_PRU1")
    1106        .dwattr $C$DW$82, DW_AT_TI_symbol_name("PMAO_PRU1")
    1107        .dwattr $C$DW$82, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x01)
    1108        .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1109        .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1110        .dwattr $C$DW$82, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1111        .dwattr $C$DW$82, DW_AT_decl_line(0xc5)
    1112        .dwattr $C$DW$82, DW_AT_decl_column(0x0d)
    1113$C$DW$83        .dwtag  DW_TAG_member
    1114        .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$11)
    1115        .dwattr $C$DW$83, DW_AT_name("rsvd2")
    1116        .dwattr $C$DW$83, DW_AT_TI_symbol_name("rsvd2")
    1117        .dwattr $C$DW$83, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1e)
    1118        .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1119        .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1120        .dwattr $C$DW$83, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1121        .dwattr $C$DW$83, DW_AT_decl_line(0xc6)
    1122        .dwattr $C$DW$83, DW_AT_decl_column(0x0d)
    1123        .dwendtag $C$DW$T$28
    1124
    1125        .dwattr $C$DW$T$28, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1126        .dwattr $C$DW$T$28, DW_AT_decl_line(0xc3)
    1127        .dwattr $C$DW$T$28, DW_AT_decl_column(0x13)
    1128$C$DW$T$55      .dwtag  DW_TAG_volatile_type
    1129        .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$28)
    1130
    1131$C$DW$T$29      .dwtag  DW_TAG_structure_type
    1132        .dwattr $C$DW$T$29, DW_AT_byte_size(0x04)
    1133$C$DW$84        .dwtag  DW_TAG_member
    1134        .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$11)
    1135        .dwattr $C$DW$84, DW_AT_name("OCP_EN")
    1136        .dwattr $C$DW$84, DW_AT_TI_symbol_name("OCP_EN")
    1137        .dwattr $C$DW$84, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
    1138        .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1139        .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1140        .dwattr $C$DW$84, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1141        .dwattr $C$DW$84, DW_AT_decl_line(0xd3)
    1142        .dwattr $C$DW$84, DW_AT_decl_column(0x0d)
    1143$C$DW$85        .dwtag  DW_TAG_member
    1144        .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$11)
    1145        .dwattr $C$DW$85, DW_AT_name("rsvd1")
    1146        .dwattr $C$DW$85, DW_AT_TI_symbol_name("rsvd1")
    1147        .dwattr $C$DW$85, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1f)
    1148        .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1149        .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1150        .dwattr $C$DW$85, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1151        .dwattr $C$DW$85, DW_AT_decl_line(0xd4)
    1152        .dwattr $C$DW$85, DW_AT_decl_column(0x0d)
    1153        .dwendtag $C$DW$T$29
    1154
    1155        .dwattr $C$DW$T$29, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
PRU Assembler Unix v2.1.4 Thu Apr 12 02:56:25 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
hello-pru.asm                                                        PAGE   22

    1156        .dwattr $C$DW$T$29, DW_AT_decl_line(0xd2)
    1157        .dwattr $C$DW$T$29, DW_AT_decl_column(0x13)
    1158$C$DW$T$57      .dwtag  DW_TAG_volatile_type
    1159        .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$29)
    1160
    1161$C$DW$T$30      .dwtag  DW_TAG_structure_type
    1162        .dwattr $C$DW$T$30, DW_AT_byte_size(0x04)
    1163$C$DW$86        .dwtag  DW_TAG_member
    1164        .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$11)
    1165        .dwattr $C$DW$86, DW_AT_name("PRU1_PAD_HP_EN")
    1166        .dwattr $C$DW$86, DW_AT_TI_symbol_name("PRU1_PAD_HP_EN")
    1167        .dwattr $C$DW$86, DW_AT_bit_offset(0x1f), DW_AT_bit_size(0x01)
    1168        .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1169        .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1170        .dwattr $C$DW$86, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1171        .dwattr $C$DW$86, DW_AT_decl_line(0xde)
    1172        .dwattr $C$DW$86, DW_AT_decl_column(0x0d)
    1173$C$DW$87        .dwtag  DW_TAG_member
    1174        .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$11)
    1175        .dwattr $C$DW$87, DW_AT_name("XFR_SHIFT_EN")
    1176        .dwattr $C$DW$87, DW_AT_TI_symbol_name("XFR_SHIFT_EN")
    1177        .dwattr $C$DW$87, DW_AT_bit_offset(0x1e), DW_AT_bit_size(0x01)
    1178        .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1179        .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1180        .dwattr $C$DW$87, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1181        .dwattr $C$DW$87, DW_AT_decl_line(0xdf)
    1182        .dwattr $C$DW$87, DW_AT_decl_column(0x0d)
    1183$C$DW$88        .dwtag  DW_TAG_member
    1184        .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$11)
    1185        .dwattr $C$DW$88, DW_AT_name("rsvd2")
    1186        .dwattr $C$DW$88, DW_AT_TI_symbol_name("rsvd2")
    1187        .dwattr $C$DW$88, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x1e)
    1188        .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1189        .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1190        .dwattr $C$DW$88, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1191        .dwattr $C$DW$88, DW_AT_decl_line(0xe0)
    1192        .dwattr $C$DW$88, DW_AT_decl_column(0x0d)
    1193        .dwendtag $C$DW$T$30
    1194
    1195        .dwattr $C$DW$T$30, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1196        .dwattr $C$DW$T$30, DW_AT_decl_line(0xdd)
    1197        .dwattr $C$DW$T$30, DW_AT_decl_column(0x13)
    1198$C$DW$T$59      .dwtag  DW_TAG_volatile_type
    1199        .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$30)
    1200
    1201$C$DW$T$31      .dwtag  DW_TAG_structure_type
    1202        .dwattr $C$DW$T$31, DW_AT_byte_size(0x04)
    1203$C$DW$89        .dwtag  DW_TAG_member
    1204        .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$11)
    1205        .dwattr $C$DW$89, DW_AT_name("PIN_MUX_SEL")
    1206        .dwattr $C$DW$89, DW_AT_TI_symbol_name("PIN_MUX_SEL")
    1207        .dwattr $C$DW$89, DW_AT_bit_offset(0x18), DW_AT_bit_size(0x08)
    1208        .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1209        .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1210        .dwattr $C$DW$89, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
PRU Assembler Unix v2.1.4 Thu Apr 12 02:56:25 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
hello-pru.asm                                                        PAGE   23

    1211        .dwattr $C$DW$89, DW_AT_decl_line(0xec)
    1212        .dwattr $C$DW$89, DW_AT_decl_column(0x0d)
    1213$C$DW$90        .dwtag  DW_TAG_member
    1214        .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$11)
    1215        .dwattr $C$DW$90, DW_AT_name("rsvd2")
    1216        .dwattr $C$DW$90, DW_AT_TI_symbol_name("rsvd2")
    1217        .dwattr $C$DW$90, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x18)
    1218        .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1219        .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1220        .dwattr $C$DW$90, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1221        .dwattr $C$DW$90, DW_AT_decl_line(0xed)
    1222        .dwattr $C$DW$90, DW_AT_decl_column(0x0d)
    1223        .dwendtag $C$DW$T$31
    1224
    1225        .dwattr $C$DW$T$31, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1226        .dwattr $C$DW$T$31, DW_AT_decl_line(0xeb)
    1227        .dwattr $C$DW$T$31, DW_AT_decl_column(0x13)
    1228$C$DW$T$61      .dwtag  DW_TAG_volatile_type
    1229        .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$31)
    1230
    1231$C$DW$T$35      .dwtag  DW_TAG_structure_type
    1232        .dwattr $C$DW$T$35, DW_AT_byte_size(0x44)
    1233$C$DW$91        .dwtag  DW_TAG_member
    1234        .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$38)
    1235        .dwattr $C$DW$91, DW_AT_name("$P$T0")
    1236        .dwattr $C$DW$91, DW_AT_TI_symbol_name("$P$T0")
    1237        .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1238        .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1239        .dwattr $C$DW$91, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1240        .dwattr $C$DW$91, DW_AT_decl_line(0x29)
    1241        .dwattr $C$DW$91, DW_AT_decl_column(0x02)
    1242$C$DW$92        .dwtag  DW_TAG_member
    1243        .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$40)
    1244        .dwattr $C$DW$92, DW_AT_name("$P$T1")
    1245        .dwattr $C$DW$92, DW_AT_TI_symbol_name("$P$T1")
    1246        .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1247        .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1248        .dwattr $C$DW$92, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1249        .dwattr $C$DW$92, DW_AT_decl_line(0x33)
    1250        .dwattr $C$DW$92, DW_AT_decl_column(0x02)
    1251$C$DW$93        .dwtag  DW_TAG_member
    1252        .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$42)
    1253        .dwattr $C$DW$93, DW_AT_name("$P$T2")
    1254        .dwattr $C$DW$93, DW_AT_TI_symbol_name("$P$T2")
    1255        .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1256        .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1257        .dwattr $C$DW$93, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1258        .dwattr $C$DW$93, DW_AT_decl_line(0x41)
    1259        .dwattr $C$DW$93, DW_AT_decl_column(0x02)
    1260$C$DW$94        .dwtag  DW_TAG_member
    1261        .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$44)
    1262        .dwattr $C$DW$94, DW_AT_name("$P$T3")
    1263        .dwattr $C$DW$94, DW_AT_TI_symbol_name("$P$T3")
    1264        .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1265        .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
PRU Assembler Unix v2.1.4 Thu Apr 12 02:56:25 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
hello-pru.asm                                                        PAGE   24

    1266        .dwattr $C$DW$94, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1267        .dwattr $C$DW$94, DW_AT_decl_line(0x54)
    1268        .dwattr $C$DW$94, DW_AT_decl_column(0x02)
    1269$C$DW$95        .dwtag  DW_TAG_member
    1270        .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$46)
    1271        .dwattr $C$DW$95, DW_AT_name("$P$T4")
    1272        .dwattr $C$DW$95, DW_AT_TI_symbol_name("$P$T4")
    1273        .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1274        .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1275        .dwattr $C$DW$95, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1276        .dwattr $C$DW$95, DW_AT_decl_line(0x67)
    1277        .dwattr $C$DW$95, DW_AT_decl_column(0x02)
    1278$C$DW$96        .dwtag  DW_TAG_member
    1279        .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$48)
    1280        .dwattr $C$DW$96, DW_AT_name("$P$T5")
    1281        .dwattr $C$DW$96, DW_AT_TI_symbol_name("$P$T5")
    1282        .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1283        .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1284        .dwattr $C$DW$96, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1285        .dwattr $C$DW$96, DW_AT_decl_line(0x83)
    1286        .dwattr $C$DW$96, DW_AT_decl_column(0x02)
    1287$C$DW$97        .dwtag  DW_TAG_member
    1288        .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$50)
    1289        .dwattr $C$DW$97, DW_AT_name("$P$T6")
    1290        .dwattr $C$DW$97, DW_AT_TI_symbol_name("$P$T6")
    1291        .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1292        .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1293        .dwattr $C$DW$97, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1294        .dwattr $C$DW$97, DW_AT_decl_line(0x92)
    1295        .dwattr $C$DW$97, DW_AT_decl_column(0x02)
    1296$C$DW$98        .dwtag  DW_TAG_member
    1297        .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$52)
    1298        .dwattr $C$DW$98, DW_AT_name("$P$T7")
    1299        .dwattr $C$DW$98, DW_AT_TI_symbol_name("$P$T7")
    1300        .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1301        .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1302        .dwattr $C$DW$98, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1303        .dwattr $C$DW$98, DW_AT_decl_line(0xa0)
    1304        .dwattr $C$DW$98, DW_AT_decl_column(0x02)
    1305$C$DW$99        .dwtag  DW_TAG_member
    1306        .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$54)
    1307        .dwattr $C$DW$99, DW_AT_name("$P$T8")
    1308        .dwattr $C$DW$99, DW_AT_TI_symbol_name("$P$T8")
    1309        .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1310        .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1311        .dwattr $C$DW$99, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pru
    1312        .dwattr $C$DW$99, DW_AT_decl_line(0xaf)
    1313        .dwattr $C$DW$99, DW_AT_decl_column(0x02)
    1314$C$DW$100       .dwtag  DW_TAG_member
    1315        .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$32)
    1316        .dwattr $C$DW$100, DW_AT_name("rsvd24")
    1317        .dwattr $C$DW$100, DW_AT_TI_symbol_name("rsvd24")
    1318        .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1319        .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1320        .dwattr $C$DW$100, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
PRU Assembler Unix v2.1.4 Thu Apr 12 02:56:25 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
hello-pru.asm                                                        PAGE   25

    1321        .dwattr $C$DW$100, DW_AT_decl_line(0xbc)
    1322        .dwattr $C$DW$100, DW_AT_decl_column(0x0b)
    1323$C$DW$101       .dwtag  DW_TAG_member
    1324        .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$56)
    1325        .dwattr $C$DW$101, DW_AT_name("$P$T9")
    1326        .dwattr $C$DW$101, DW_AT_TI_symbol_name("$P$T9")
    1327        .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
    1328        .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1329        .dwattr $C$DW$101, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1330        .dwattr $C$DW$101, DW_AT_decl_line(0xc0)
    1331        .dwattr $C$DW$101, DW_AT_decl_column(0x02)
    1332$C$DW$102       .dwtag  DW_TAG_member
    1333        .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$33)
    1334        .dwattr $C$DW$102, DW_AT_name("rsvd2c")
    1335        .dwattr $C$DW$102, DW_AT_TI_symbol_name("rsvd2c")
    1336        .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    1337        .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1338        .dwattr $C$DW$102, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1339        .dwattr $C$DW$102, DW_AT_decl_line(0xcb)
    1340        .dwattr $C$DW$102, DW_AT_decl_column(0x0b)
    1341$C$DW$103       .dwtag  DW_TAG_member
    1342        .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$58)
    1343        .dwattr $C$DW$103, DW_AT_name("$P$T10")
    1344        .dwattr $C$DW$103, DW_AT_TI_symbol_name("$P$T10")
    1345        .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    1346        .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1347        .dwattr $C$DW$103, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1348        .dwattr $C$DW$103, DW_AT_decl_line(0xcf)
    1349        .dwattr $C$DW$103, DW_AT_decl_column(0x02)
    1350$C$DW$104       .dwtag  DW_TAG_member
    1351        .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$60)
    1352        .dwattr $C$DW$104, DW_AT_name("$P$T11")
    1353        .dwattr $C$DW$104, DW_AT_TI_symbol_name("$P$T11")
    1354        .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    1355        .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1356        .dwattr $C$DW$104, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1357        .dwattr $C$DW$104, DW_AT_decl_line(0xda)
    1358        .dwattr $C$DW$104, DW_AT_decl_column(0x02)
    1359$C$DW$105       .dwtag  DW_TAG_member
    1360        .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$34)
    1361        .dwattr $C$DW$105, DW_AT_name("rsvd38")
    1362        .dwattr $C$DW$105, DW_AT_TI_symbol_name("rsvd38")
    1363        .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    1364        .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1365        .dwattr $C$DW$105, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1366        .dwattr $C$DW$105, DW_AT_decl_line(0xe5)
    1367        .dwattr $C$DW$105, DW_AT_decl_column(0x0b)
    1368$C$DW$106       .dwtag  DW_TAG_member
    1369        .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$62)
    1370        .dwattr $C$DW$106, DW_AT_name("$P$T12")
    1371        .dwattr $C$DW$106, DW_AT_TI_symbol_name("$P$T12")
    1372        .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    1373        .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1374        .dwattr $C$DW$106, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1375        .dwattr $C$DW$106, DW_AT_decl_line(0xe8)
PRU Assembler Unix v2.1.4 Thu Apr 12 02:56:25 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
hello-pru.asm                                                        PAGE   26

    1376        .dwattr $C$DW$106, DW_AT_decl_column(0x02)
    1377        .dwendtag $C$DW$T$35
    1378
    1379        .dwattr $C$DW$T$35, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1380        .dwattr $C$DW$T$35, DW_AT_decl_line(0x26)
    1381        .dwattr $C$DW$T$35, DW_AT_decl_column(0x10)
    1382$C$DW$T$68      .dwtag  DW_TAG_typedef, DW_AT_name("pruCfg")
    1383        .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$35)
    1384        .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
    1385        .dwattr $C$DW$T$68, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1386        .dwattr $C$DW$T$68, DW_AT_decl_line(0xf0)
    1387        .dwattr $C$DW$T$68, DW_AT_decl_column(0x03)
    1388$C$DW$T$69      .dwtag  DW_TAG_volatile_type
    1389        .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$68)
    1390
    1391$C$DW$T$38      .dwtag  DW_TAG_union_type
    1392        .dwattr $C$DW$T$38, DW_AT_byte_size(0x04)
    1393$C$DW$107       .dwtag  DW_TAG_member
    1394        .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$36)
    1395        .dwattr $C$DW$107, DW_AT_name("REVID")
    1396        .dwattr $C$DW$107, DW_AT_TI_symbol_name("REVID")
    1397        .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1398        .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1399        .dwattr $C$DW$107, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1400        .dwattr $C$DW$107, DW_AT_decl_line(0x2a)
    1401        .dwattr $C$DW$107, DW_AT_decl_column(0x15)
    1402$C$DW$108       .dwtag  DW_TAG_member
    1403        .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$37)
    1404        .dwattr $C$DW$108, DW_AT_name("REVID_bit")
    1405        .dwattr $C$DW$108, DW_AT_TI_symbol_name("REVID_bit")
    1406        .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1407        .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1408        .dwattr $C$DW$108, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1409        .dwattr $C$DW$108, DW_AT_decl_line(0x2e)
    1410        .dwattr $C$DW$108, DW_AT_decl_column(0x05)
    1411        .dwendtag $C$DW$T$38
    1412
    1413        .dwattr $C$DW$T$38, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1414        .dwattr $C$DW$T$38, DW_AT_decl_line(0x29)
    1415        .dwattr $C$DW$T$38, DW_AT_decl_column(0x08)
    1416
    1417$C$DW$T$40      .dwtag  DW_TAG_union_type
    1418        .dwattr $C$DW$T$40, DW_AT_byte_size(0x04)
    1419$C$DW$109       .dwtag  DW_TAG_member
    1420        .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$36)
    1421        .dwattr $C$DW$109, DW_AT_name("SYSCFG")
    1422        .dwattr $C$DW$109, DW_AT_TI_symbol_name("SYSCFG")
    1423        .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1424        .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1425        .dwattr $C$DW$109, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1426        .dwattr $C$DW$109, DW_AT_decl_line(0x34)
    1427        .dwattr $C$DW$109, DW_AT_decl_column(0x15)
    1428$C$DW$110       .dwtag  DW_TAG_member
    1429        .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$39)
    1430        .dwattr $C$DW$110, DW_AT_name("SYSCFG_bit")
PRU Assembler Unix v2.1.4 Thu Apr 12 02:56:25 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
hello-pru.asm                                                        PAGE   27

    1431        .dwattr $C$DW$110, DW_AT_TI_symbol_name("SYSCFG_bit")
    1432        .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1433        .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1434        .dwattr $C$DW$110, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1435        .dwattr $C$DW$110, DW_AT_decl_line(0x3c)
    1436        .dwattr $C$DW$110, DW_AT_decl_column(0x05)
    1437        .dwendtag $C$DW$T$40
    1438
    1439        .dwattr $C$DW$T$40, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1440        .dwattr $C$DW$T$40, DW_AT_decl_line(0x33)
    1441        .dwattr $C$DW$T$40, DW_AT_decl_column(0x08)
    1442
    1443$C$DW$T$42      .dwtag  DW_TAG_union_type
    1444        .dwattr $C$DW$T$42, DW_AT_byte_size(0x04)
    1445$C$DW$111       .dwtag  DW_TAG_member
    1446        .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$36)
    1447        .dwattr $C$DW$111, DW_AT_name("GPCFG0")
    1448        .dwattr $C$DW$111, DW_AT_TI_symbol_name("GPCFG0")
    1449        .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1450        .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1451        .dwattr $C$DW$111, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1452        .dwattr $C$DW$111, DW_AT_decl_line(0x42)
    1453        .dwattr $C$DW$111, DW_AT_decl_column(0x15)
    1454$C$DW$112       .dwtag  DW_TAG_member
    1455        .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$41)
    1456        .dwattr $C$DW$112, DW_AT_name("GPCFG0_bit")
    1457        .dwattr $C$DW$112, DW_AT_TI_symbol_name("GPCFG0_bit")
    1458        .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1459        .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1460        .dwattr $C$DW$112, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1461        .dwattr $C$DW$112, DW_AT_decl_line(0x4f)
    1462        .dwattr $C$DW$112, DW_AT_decl_column(0x05)
    1463        .dwendtag $C$DW$T$42
    1464
    1465        .dwattr $C$DW$T$42, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1466        .dwattr $C$DW$T$42, DW_AT_decl_line(0x41)
    1467        .dwattr $C$DW$T$42, DW_AT_decl_column(0x08)
    1468
    1469$C$DW$T$44      .dwtag  DW_TAG_union_type
    1470        .dwattr $C$DW$T$44, DW_AT_byte_size(0x04)
    1471$C$DW$113       .dwtag  DW_TAG_member
    1472        .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$36)
    1473        .dwattr $C$DW$113, DW_AT_name("GPCFG1")
    1474        .dwattr $C$DW$113, DW_AT_TI_symbol_name("GPCFG1")
    1475        .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1476        .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1477        .dwattr $C$DW$113, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1478        .dwattr $C$DW$113, DW_AT_decl_line(0x55)
    1479        .dwattr $C$DW$113, DW_AT_decl_column(0x15)
    1480$C$DW$114       .dwtag  DW_TAG_member
    1481        .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$43)
    1482        .dwattr $C$DW$114, DW_AT_name("GPCFG1_bit")
    1483        .dwattr $C$DW$114, DW_AT_TI_symbol_name("GPCFG1_bit")
    1484        .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1485        .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
PRU Assembler Unix v2.1.4 Thu Apr 12 02:56:25 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
hello-pru.asm                                                        PAGE   28

    1486        .dwattr $C$DW$114, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1487        .dwattr $C$DW$114, DW_AT_decl_line(0x62)
    1488        .dwattr $C$DW$114, DW_AT_decl_column(0x05)
    1489        .dwendtag $C$DW$T$44
    1490
    1491        .dwattr $C$DW$T$44, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1492        .dwattr $C$DW$T$44, DW_AT_decl_line(0x54)
    1493        .dwattr $C$DW$T$44, DW_AT_decl_column(0x08)
    1494
    1495$C$DW$T$46      .dwtag  DW_TAG_union_type
    1496        .dwattr $C$DW$T$46, DW_AT_byte_size(0x04)
    1497$C$DW$115       .dwtag  DW_TAG_member
    1498        .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$36)
    1499        .dwattr $C$DW$115, DW_AT_name("CGR")
    1500        .dwattr $C$DW$115, DW_AT_TI_symbol_name("CGR")
    1501        .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1502        .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1503        .dwattr $C$DW$115, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1504        .dwattr $C$DW$115, DW_AT_decl_line(0x68)
    1505        .dwattr $C$DW$115, DW_AT_decl_column(0x15)
    1506$C$DW$116       .dwtag  DW_TAG_member
    1507        .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$45)
    1508        .dwattr $C$DW$116, DW_AT_name("CGR_bit")
    1509        .dwattr $C$DW$116, DW_AT_TI_symbol_name("CGR_bit")
    1510        .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1511        .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1512        .dwattr $C$DW$116, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1513        .dwattr $C$DW$116, DW_AT_decl_line(0x7e)
    1514        .dwattr $C$DW$116, DW_AT_decl_column(0x05)
    1515        .dwendtag $C$DW$T$46
    1516
    1517        .dwattr $C$DW$T$46, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1518        .dwattr $C$DW$T$46, DW_AT_decl_line(0x67)
    1519        .dwattr $C$DW$T$46, DW_AT_decl_column(0x08)
    1520
    1521$C$DW$T$48      .dwtag  DW_TAG_union_type
    1522        .dwattr $C$DW$T$48, DW_AT_byte_size(0x04)
    1523$C$DW$117       .dwtag  DW_TAG_member
    1524        .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$36)
    1525        .dwattr $C$DW$117, DW_AT_name("ISRP")
    1526        .dwattr $C$DW$117, DW_AT_TI_symbol_name("ISRP")
    1527        .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1528        .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1529        .dwattr $C$DW$117, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1530        .dwattr $C$DW$117, DW_AT_decl_line(0x84)
    1531        .dwattr $C$DW$117, DW_AT_decl_column(0x15)
    1532$C$DW$118       .dwtag  DW_TAG_member
    1533        .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$47)
    1534        .dwattr $C$DW$118, DW_AT_name("ISRP_bit")
    1535        .dwattr $C$DW$118, DW_AT_TI_symbol_name("ISRP_bit")
    1536        .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1537        .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1538        .dwattr $C$DW$118, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1539        .dwattr $C$DW$118, DW_AT_decl_line(0x8d)
    1540        .dwattr $C$DW$118, DW_AT_decl_column(0x05)
PRU Assembler Unix v2.1.4 Thu Apr 12 02:56:25 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
hello-pru.asm                                                        PAGE   29

    1541        .dwendtag $C$DW$T$48
    1542
    1543        .dwattr $C$DW$T$48, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1544        .dwattr $C$DW$T$48, DW_AT_decl_line(0x83)
    1545        .dwattr $C$DW$T$48, DW_AT_decl_column(0x08)
    1546
    1547$C$DW$T$50      .dwtag  DW_TAG_union_type
    1548        .dwattr $C$DW$T$50, DW_AT_byte_size(0x04)
    1549$C$DW$119       .dwtag  DW_TAG_member
    1550        .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$36)
    1551        .dwattr $C$DW$119, DW_AT_name("ISP")
    1552        .dwattr $C$DW$119, DW_AT_TI_symbol_name("ISP")
    1553        .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1554        .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1555        .dwattr $C$DW$119, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1556        .dwattr $C$DW$119, DW_AT_decl_line(0x93)
    1557        .dwattr $C$DW$119, DW_AT_decl_column(0x15)
    1558$C$DW$120       .dwtag  DW_TAG_member
    1559        .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$49)
    1560        .dwattr $C$DW$120, DW_AT_name("ISP_bit")
    1561        .dwattr $C$DW$120, DW_AT_TI_symbol_name("ISP_bit")
    1562        .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1563        .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1564        .dwattr $C$DW$120, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1565        .dwattr $C$DW$120, DW_AT_decl_line(0x9c)
    1566        .dwattr $C$DW$120, DW_AT_decl_column(0x05)
    1567        .dwendtag $C$DW$T$50
    1568
    1569        .dwattr $C$DW$T$50, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1570        .dwattr $C$DW$T$50, DW_AT_decl_line(0x92)
    1571        .dwattr $C$DW$T$50, DW_AT_decl_column(0x08)
    1572
    1573$C$DW$T$52      .dwtag  DW_TAG_union_type
    1574        .dwattr $C$DW$T$52, DW_AT_byte_size(0x04)
    1575$C$DW$121       .dwtag  DW_TAG_member
    1576        .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$36)
    1577        .dwattr $C$DW$121, DW_AT_name("IESP")
    1578        .dwattr $C$DW$121, DW_AT_TI_symbol_name("IESP")
    1579        .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1580        .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1581        .dwattr $C$DW$121, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1582        .dwattr $C$DW$121, DW_AT_decl_line(0xa1)
    1583        .dwattr $C$DW$121, DW_AT_decl_column(0x15)
    1584$C$DW$122       .dwtag  DW_TAG_member
    1585        .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$51)
    1586        .dwattr $C$DW$122, DW_AT_name("IESP_bit")
    1587        .dwattr $C$DW$122, DW_AT_TI_symbol_name("IESP_bit")
    1588        .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1589        .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1590        .dwattr $C$DW$122, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1591        .dwattr $C$DW$122, DW_AT_decl_line(0xaa)
    1592        .dwattr $C$DW$122, DW_AT_decl_column(0x05)
    1593        .dwendtag $C$DW$T$52
    1594
    1595        .dwattr $C$DW$T$52, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
PRU Assembler Unix v2.1.4 Thu Apr 12 02:56:25 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
hello-pru.asm                                                        PAGE   30

    1596        .dwattr $C$DW$T$52, DW_AT_decl_line(0xa0)
    1597        .dwattr $C$DW$T$52, DW_AT_decl_column(0x08)
    1598
    1599$C$DW$T$54      .dwtag  DW_TAG_union_type
    1600        .dwattr $C$DW$T$54, DW_AT_byte_size(0x04)
    1601$C$DW$123       .dwtag  DW_TAG_member
    1602        .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$36)
    1603        .dwattr $C$DW$123, DW_AT_name("IECP")
    1604        .dwattr $C$DW$123, DW_AT_TI_symbol_name("IECP")
    1605        .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1606        .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1607        .dwattr $C$DW$123, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1608        .dwattr $C$DW$123, DW_AT_decl_line(0xb0)
    1609        .dwattr $C$DW$123, DW_AT_decl_column(0x15)
    1610$C$DW$124       .dwtag  DW_TAG_member
    1611        .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$53)
    1612        .dwattr $C$DW$124, DW_AT_name("IECP_bit")
    1613        .dwattr $C$DW$124, DW_AT_TI_symbol_name("IECP_bit")
    1614        .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1615        .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1616        .dwattr $C$DW$124, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1617        .dwattr $C$DW$124, DW_AT_decl_line(0xb8)
    1618        .dwattr $C$DW$124, DW_AT_decl_column(0x05)
    1619        .dwendtag $C$DW$T$54
    1620
    1621        .dwattr $C$DW$T$54, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1622        .dwattr $C$DW$T$54, DW_AT_decl_line(0xaf)
    1623        .dwattr $C$DW$T$54, DW_AT_decl_column(0x08)
    1624
    1625$C$DW$T$56      .dwtag  DW_TAG_union_type
    1626        .dwattr $C$DW$T$56, DW_AT_byte_size(0x04)
    1627$C$DW$125       .dwtag  DW_TAG_member
    1628        .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$36)
    1629        .dwattr $C$DW$125, DW_AT_name("PMAO")
    1630        .dwattr $C$DW$125, DW_AT_TI_symbol_name("PMAO")
    1631        .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1632        .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1633        .dwattr $C$DW$125, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1634        .dwattr $C$DW$125, DW_AT_decl_line(0xc1)
    1635        .dwattr $C$DW$125, DW_AT_decl_column(0x15)
    1636$C$DW$126       .dwtag  DW_TAG_member
    1637        .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$55)
    1638        .dwattr $C$DW$126, DW_AT_name("PMAO_bit")
    1639        .dwattr $C$DW$126, DW_AT_TI_symbol_name("PMAO_bit")
    1640        .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1641        .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1642        .dwattr $C$DW$126, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/pr
    1643        .dwattr $C$DW$126, DW_AT_decl_line(0xc7)
    1644        .dwattr $C$DW$126, DW_AT_decl_column(0x05)
    1645        .dwendtag $C$DW$T$56
    1646
    1647        .dwattr $C$DW$T$56, DW_AT_decl_file("/usr/lib/ti/pru-software-support-package/include/am335x/p
    1648        .dwattr $C$DW$T$56, DW_AT_decl_line(0xc0)
    1649        .dwattr $C$DW$T$56, DW_AT_decl_column(0x08)
    1650
PRU Assembler Unix v2.1.4 Thu Apr 12 02:56:25 2018

Tools Copyright (c) 2012-2015 Texas Instruments Incorporated
hello-pru.asm                                                        PAGE   31

    1651$C$DW$T$58      .dwtag  DW_TAG_union_type
    1652        .dwattr $C$DW$T$58, DW_AT_byte_size(0x04)
    1653$C$DW$127       .dwtag  DW_TAG_member
    1654        .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$36)
    1655        .dwattr $C$DW$127, DW_AT_name("IEPCLK")
